{
  "generatedAt": "2026-01-06T08:36:24.655Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Frank steunt Amorim: 'Het wordt lastig als je belangrijk personeel vervangt'",
      "link": "https://www.vi.nl/nieuws/frank-steunt-amorim-het-wordt-lastig-als-je-belangrijk-personeel-vervangt",
      "summary": "Thomas Frank heeft zich uitgesproken over de recente ontslagen in de Premier League bij Chelsea en Manchester United. De manager van Tottenham Hotspur is van mening dat clubs managers in het algemeen te weinig tijd geven om succes te behalen, zonder daarbij een oordeel te vellen over de reden achter het ontslag van Enzo Maresca en Ruben Amorim.",
      "publishedAt": "2026-01-06T08:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Rvc Ajax in gesprek met Ophof over opvolging Blind",
      "link": "https://www.vi.nl/nieuws/rvc-ajax-in-gesprek-met-ophof-over-opvolging-blind",
      "summary": "Edo Ophof is nadrukkelijk in beeld om Danny Blind op te volgen in de raad van commissarissen van Ajax. Beide partijen zijn met elkaar in gesprek.",
      "publishedAt": "2026-01-06T08:22:46.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Ex-spelers van FC Groningen in beeld in de Serie A'",
      "link": "https://www.vi.nl/nieuws/ex-spelers-van-fc-groningen-in-beeld-in-de-serie-a",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-06T08:17:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hansson naar Excelsior, Willem II neemt afscheid van De Waal",
      "link": "https://www.vi.nl/nieuws/hansson-naar-excelsior-willem-ii-neemt-afscheid-van-de-waal",
      "summary": "We zitten in het intermezzo tussen de zomer- en winterwindow, toch druppelt er in het najaar vaak nog een aantal transfers binnen. In dit blog vind je alle speculaties en bevestigde transfers in Nederland. Bekijk hier ons blog voor de transferperikelen in het buitenland.",
      "publishedAt": "2026-01-06T08:08:59.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Kampl vroegtijdig met pensioen na familiedrama: 'Hebben geen tijd te verspillen'",
      "link": "https://www.vi.nl/nieuws/kampl-vroegtijdig-met-pensioen-na-familiedrama-hebben-geen-tijd-te-verspillen",
      "summary": "RB Leipzig-middenvelder Kevin Kampl zet per direct een punt achter zijn profcarrière. De 35-jarige Sloveen blijft in zijn thuisland om tijd door te brengen met zijn zieke vader.",
      "publishedAt": "2026-01-06T08:07:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "From academy to Champions League: next manager’s Manchester United in-tray",
      "link": "https://www.theguardian.com/football/2026/jan/06/new-manager-manchester-united-in-tray",
      "summary": "Club must learn to play without fear and harness their young players, particularly Kobbie Mainoo, and regain a seat at Europe’s top table Whatever the protestations from Manchester United about the relationship between Ruben Amorim and the higher-ups not collapsing like a house of cards, clearly something was not right. The head coach became increasingly open that something was amiss after chats with Jason Wilcox. The director of football has not covered himself in glory at the club, but he and the chief executive, Omar Berrada, remain while another head coach departs. Conversations with potential replacements need to centre on everyone being on the same page. There were disagreements over tactics and recruitment, which created tension Old Trafford could ill afford. Nothing will be fixed overnight, meaning the incoming coach needs explicit guidelines on what is required and must offer a clear path on how tactics and style will meet expectations. Season-by-season ambitions should be set, allowing everyone to be held accountable, instead of the blame being foisted on one man. Continue reading...",
      "publishedAt": "2026-01-06T08:00:31.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Venus Williams still competitive at 45 while Nick Kyrgios falls at first hurdle",
      "link": "https://www.skysports.com/tennis/news/12040/13490965/venus-williams-loses-in-auckland-but-still-competitive-at-45-while-nick-kyrgios-falls-at-first-hurdle-in-brisbane",
      "summary": "Venus Williams lost her first singles match of 2026 in Auckland but showed she is still competitive at 45 while Nick Kyrgios fell at first hurdle in Brisbane.",
      "publishedAt": "2026-01-06T07:55:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Highlights: Sabalenka starts 2026 with 47-minute win over Bucsa",
      "link": "https://www.skysports.com/watch/video/13490988/brisbane-international-aryna-sabalenka-vs-cristina-bucsa",
      "summary": "Aryna Sabalenka began her 2026 singles season with a dominant 6-0, 6-1 win over Cristina Bucsa in the first round of Brisbane",
      "publishedAt": "2026-01-06T07:08:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Today on Sky Sports Racing: Sovereign Wealth bids to open account at Wolverhampton",
      "link": "https://www.skysports.com/racing/news/12040/13490410/today-on-sky-sports-racing-southwell-and-wolverhampton-feature-live-on-tuesday",
      "summary": "We have a busy day's racing on Tuesday with all-weather action from Southwell and Wolverhampton live on Sky Sports Racing...",
      "publishedAt": "2026-01-06T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United sacked Amorim after Wilcox row",
      "link": "https://www.espn.com/soccer/story/_/id/47512494/ruben-amorim-sacked-man-united-fiery-jason-wilcox-row-sources",
      "summary": "Ruben Amorim was sacked by Manchester United in the aftermath of an explosive meeting with director of football Jason Wilcox on Friday, sources have confirmed to ESPN.",
      "publishedAt": "2026-01-06T02:05:04.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City's Gvardiol to have surgery on broken leg",
      "link": "https://www.espn.com/soccer/story/_/id/47515550/manchester-city-confirm-josko-gvardiol-leg-fracture-return-unknown",
      "summary": "Manchester City have confirmed that Josko Gvardiol has suffered a leg fracture and is set to undergo surgery this week.",
      "publishedAt": "2026-01-06T02:05:04.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Osimhen double puts Nigeria in AFCON quarters",
      "link": "https://www.espn.com/espn/story/_/id/47515531/victor-osimhen-ademola-lookman-nigeria-make-light-work-mozambique-reach-afcon-quarterfinals",
      "summary": "Nigeria's Super Eagles had no problems, aside from some rain, in Fes on Monday, as Victor Osimhen and Ademola Lookman produced an attacking masterclass against Mozambique to win 4-0 and advance to the AFCON quarterfinals.",
      "publishedAt": "2026-01-06T02:05:04.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Source: Barcelona in talks over João Cancelo loan",
      "link": "https://www.espn.com/soccer/story/_/id/47516174/barcelona-talks-al-hilal-joao-cancelo-loan",
      "summary": "Barcelona are exploring a deal to bring Portugal international João Cancelo back to the club in January, a source has confirmed to ESPN.",
      "publishedAt": "2026-01-06T02:05:04.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man United must go big and hire a superstar manager after firing Ruben Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47512319/manchester-united-fire-ruben-amorim-analysis-reaction",
      "summary": "It is time for one of the most powerful clubs in the world to hire a manager with the experience, track record, credentials and personality befitting Man United's status.",
      "publishedAt": "2026-01-06T02:05:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Stop experiments and get manager who fits Man Utd DNA - Neville",
      "link": "https://www.bbc.com/sport/football/articles/c5yv8v7eqq8o?at_medium=RSS&at_campaign=rss",
      "summary": "Gary Neville urges Manchester United to 'stop experimenting' and appoint a manager who fits the club's DNA after Ruben Amorim was sacked on Monday.",
      "publishedAt": "2026-01-05T21:23:34.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester United undecided on next managerial move after sacking Ruben Amorim",
      "link": "https://www.theguardian.com/football/2026/jan/05/ruben-amorim-sacked-by-manchester-united-transfers-power-struggle",
      "summary": "Head coach goes after outburst at Leeds game Glasner and Iraola among long-term candidates Ruben Amorim was sacked by Manchester United on Monday morning after 14 months as their head coach. He departs after a power struggle with the hierarchy over transfer policy, with Amorim demanding his ­colleagues in the recruitment department “do their job” following Sunday’s draw at Leeds. His immediate replacement is Darren Fletcher, who takes charge as interim head coach. The Scot, a former United midfielder and the ­current under-18s coach, will lead the side at Burnley on Wednesday and could remain in charge for Sunday’s FA Cup tie with Brighton. Continue reading...",
      "publishedAt": "2026-01-05T20:30:58.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Appointing Nancy one of clueless Celtic's greatest blunders'",
      "link": "https://www.bbc.com/sport/football/articles/cx2lwljk4z9o?at_medium=RSS&at_campaign=rss",
      "summary": "There is \"no apparent big picture view at Celtic\", argues BBC Sport Scotland's Tom English as Wilfried Nancy and Paul Tisdale exit the ailing champions.",
      "publishedAt": "2026-01-05T20:07:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Difficult questions loom for Manchester United higher-ups after Amorim’s axing | Jamie Jackson",
      "link": "https://www.theguardian.com/football/2026/jan/05/difficult-questions-manchester-united-ruben-amorim-sacking",
      "summary": "Fallout from a dour and unsuccessful reign will hit well-paid executives who backed the outgoing head coach Ruben Amorim’s tenure as Manchester United head coach began its final unravelling via four words uttered in Friday’s media conference to preview the weekend trip to Leeds. “You are very smart,” was Amorim’s signoff to this correspondent’s last question regarding if the Portuguese had been informed of a change in the January transfer budget by Jason Wilcox, the director of football. The question was asked in reaction to Amorim’s odd comment on Christmas Eve that he was beginning to “understand” the finance was not available to sign the footballers needed to “play a perfect 3-4-3”. Hearing this, the radar bleeped red – Amorim was clearly countenancing changing from a system he was quasi-obsessed with. Continue reading...",
      "publishedAt": "2026-01-05T20:00:16.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "O'Neill returns to Celtic for rest of season",
      "link": "https://www.bbc.com/sport/football/articles/c5y2g5vgjzyo?at_medium=RSS&at_campaign=rss",
      "summary": "Martin O'Neill is returning to Celtic as manager for the remainder of the season following the dismissal of Wilfried Nancy.",
      "publishedAt": "2026-01-05T19:31:30.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester United’s flawed process: why Amorim appointment was doomed from the start",
      "link": "https://www.theguardian.com/football/2026/jan/05/manchester-uniteds-flawed-process-why-amorim-appointment-was-doomed-from-the-start",
      "summary": "Systemic failures at Old Trafford led them to the wrong man last time around – and there is concern that those problems remain When Manchester United embarked upon this season full of fresh hope and optimism, there was an unexpected note of caution from one of the best executives in the game. “It’s clear they don’t have a process,” the executive said of Sir Jim Ratcliffe’s new regime early in the season. It was a stark pronouncement at odds with the consensus that Ruben Amorim, with a proper pre-season to bed in his tactical system and exciting signings, would be able to demonstrate his considerable abilities unencumbered by the hospital pass he had been given on his appointment in November 2024. Continue reading...",
      "publishedAt": "2026-01-05T18:29:27.000Z"
    }
  ]
}