{
  "generatedAt": "2025-12-19T23:34:37.483Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Milik na anderhalf jaar weer bij wedstrijdselectie Juventus",
      "link": "https://www.vi.nl/nieuws/milik-na-anderhalf-jaar-weer-bij-wedstrijdselectie-juventus",
      "summary": "Heuglijk nieuws voor Arkadiusz Milik: de Poolse spits zit voor het eerst in ruim anderhalf jaar weer eens bij de wedstrijdselectie van Juventus. In die periode werd Milik geteisterd door blessureproblemen.",
      "publishedAt": "2025-12-19T22:45:13.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Arteta on Arsenal future: I have to earn new deal",
      "link": "https://www.espn.com/soccer/story/_/id/47358037/mikel-arteta-arsenal-manager-future-earn-new-contract",
      "summary": "Mikel Arteta has hinted he could stay at Arsenal beyond his current contract but suggested he would have to earn any new deal.",
      "publishedAt": "2025-12-19T22:39:48.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "USMNT's Adams (torn MCL) out up to 3 months",
      "link": "https://www.espn.com/soccer/story/_/id/47358655/usa-tyler-adams-injury-bournemouth-3-months-torn-mcl",
      "summary": "United States international Tyler Adams will be out for up to three months after tearing a medial collateral ligament, Bournemouth coach Andoni Iraola said Friday.",
      "publishedAt": "2025-12-19T22:39:47.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "PSG GK fractured hand during shootout heroics",
      "link": "https://www.espn.com/soccer/story/_/id/47358963/psg-goalkeeper-matvei-safonov-intercontinental-cup-shootout",
      "summary": "Paris Saint-Germain goalkeeper Matvey Safonov has been left with a fractured hand following his penalty shootout heroics to win the Intercontinental Cup.",
      "publishedAt": "2025-12-19T22:39:47.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham sunk by keeper's late error at Swansea",
      "link": "https://www.espn.com/soccer/report/_/gameId/744859",
      "summary": "Swansea claimed the Welsh bragging rights over Wrexham with a dramatic 2-1 comeback home win.",
      "publishedAt": "2025-12-19T22:39:47.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ook op 36-jarige leeftijd scoort Ralf Seuntjens er lustig op los in België",
      "link": "https://www.vi.nl/nieuws/ook-op-36-jarige-leeftijd-scoort-ralf-seuntjens-er-lustig-op-los-in-belgi",
      "summary": "SK Lommel heeft vrijdagavond een doelpuntrijk duel met Lierse SK winnend afgesloten. Ralf Seuntjens zette de uitstekende lijn van de afgelopen weken voort met twee doelpunten. Lommel staat nu vierde op het tweede niveau van België en blijft meestrijden om promotie.",
      "publishedAt": "2025-12-19T22:37:58.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'That is how you put a game to bed!' | Aspinall wins with Big Fish",
      "link": "https://www.skysports.com/watch/video/13485784/world-darts-championship-nathan-aspinall-wins-with-big-fish",
      "summary": "An incredible 170 checkout saw Nathan Aspinall secure the hard-fought first round win over Lourence Ilagan.",
      "publishedAt": "2025-12-19T22:31:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City 'must prepare' for successor, says Guardiola",
      "link": "https://www.bbc.com/sport/football/articles/c7vm91l58d0o?at_medium=RSS&at_campaign=rss",
      "summary": "Pep Guardiola says Man City \"must be prepared\" to plan for his eventual departure, after Enzo Maresca says reports suggesting he could succeed the Spaniard are \"100% speculation\".",
      "publishedAt": "2025-12-19T22:30:20.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maresca plays dangerous game as confusion reigns after his Chelsea grenade",
      "link": "https://www.theguardian.com/football/2025/dec/19/enzo-maresca-chelsea-newcastle-manchester-city-premier-league",
      "summary": "Club remain bemused by head coach creating speculation he has issues with the hierarchy who want to avoid drama at all costs One of the theories doing the rounds this week is that Enzo Maresca is behaving like someone who wants to be sacked. He has stumbled into a fight he cannot win. It did not go down well with Chelsea when Maresca lobbed a grenade into the mix by talking about not being supported enough after last Saturday’s humdrum win against Everton and it is hard not to read his refusal to defuse the situation since then as the stance of a man daring his bosses to act. Chelsea remain bemused by their head coach creating speculation that he has issues with the club’s hierarchy by saying that the 48 hours before the Everton game had been his worst since joining the club. Sources say the outburst even caught people close to Maresca by surprise. Confusion reigns. It does not help that Maresca has publicly and privately rejected repeated opportunities to explain the source of his discontent, leaving it open for outsiders to assume that the Italian’s issues are with Chelsea’s hierarchy. Continue reading...",
      "publishedAt": "2025-12-19T22:30:13.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Thomas Frank talks sense but Tottenham’s lack of style has supporters worried",
      "link": "https://www.theguardian.com/football/2025/dec/19/thomas-frank-talks-sense-tottenham-lack-of-style-supporters-worried",
      "summary": "Dane wants time but before Saturday’s match against Liverpool, faithful are frustrated by stodgy performances There are plenty of well-known checkpoints in the life cycle of a Tottenham manager and we have reached one with Thomas Frank. It is the pleading for time bit. “If nobody gets this, nobody will be able to turn this around,” he said after last Sunday’s 3-0 Premier League defeat at Nottingham Forest. It is not a “quick fix,” he added. And nobody was about to disagree. Frank is veering towards another – the one where it is as if he wants to scream, to release the inner hurricane that he referenced in Nottingham. Is anybody seeing what he is seeing? In other words, the immense difficulties that he faces. Continue reading...",
      "publishedAt": "2025-12-19T22:30:12.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Mikel Arteta admits long-term future at Arsenal dependent on winning silverware",
      "link": "https://www.theguardian.com/football/2025/dec/19/mikel-arteta-admits-long-term-future-at-arsenal-dependent-on-winning-silverware",
      "summary": "Spaniard approaches sixth anniversary in charge Arteta ‘has to earn the right to be here tomorrow’ Mikel Arteta has conceded his long-term future at Arsenal is dependent on winning silverware as he prepares to celebrate his sixth anniversary in charge. The Spaniard was appointed on 20 December 2019 and led Arsenal to the FA Cup a few months later but that remains his only major trophy since replacing Unai Emery. Arteta will mark six years in the job against his former club Everton on Saturday night – the same opponents Arsenal faced a day after he was announced as their manager. He watched that game from the stands before officially beginning his role the next day. Continue reading...",
      "publishedAt": "2025-12-19T22:30:12.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Mohamed Salah apologised to Liverpool squad for outburst, reveals Curtis Jones",
      "link": "https://www.theguardian.com/football/2025/dec/19/mohamed-salah-apologised-to-liverpool-squad-for-outburst-reveals-curtis-jones",
      "summary": "Liverpool teammate discusses fallout from interview Slot says Wirtz is adapting by bulking up in the gym Curtis Jones has revealed Mohamed Salah apologised to the Liverpool squad for the fallout from his interview criticising the club and Arne Slot. Salah was omitted from Liverpool’s Champions League win against Inter having accused the club of throwing him under a bus in response to a poor run of results. The striker also claimed his relationship with Slot had broken down and that he had earned his position in the team after eight phenomenal seasons. Continue reading...",
      "publishedAt": "2025-12-19T22:30:05.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Laurens' weekend preview: Mbappé's quest to overtake Ronaldo, Spurs-Liverpool search for form, more",
      "link": "https://www.espn.com/soccer/story/_/id/47358449/julien-laurens-weekend-soccer-preview-kylian-mbappe-quest-overtake-cristiano-ronaldo-real-madrid-history",
      "summary": "What is Julien Laurens watching this weekend? For starters, Kylian Mbappé's quest to make Madrid history, plus the Africa Cup of Nations kicks off.",
      "publishedAt": "2025-12-19T22:20:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FIFA straft Al Nassr met transferban",
      "link": "https://www.vi.nl/nieuws/fifa-straft-al-nassr-met-transferban",
      "summary": "Een flinke tegenvaller voor Al Nassr: de FIFA heeft de Saoedische club gestraft met een transferban. De club van Cristiano Ronaldo mag per direct geen nieuwe spelers meer inschrijven.",
      "publishedAt": "2025-12-19T22:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Alfred Schreuder begint weer na hartproblemen: 'Bewust even gestopt'",
      "link": "https://www.vi.nl/nieuws/alfred-schreuder-begint-weer-na-hartproblemen-bewust-even-gestopt",
      "summary": "Alfred Schreuder is sinds kort weer trainer. De 53-jarige oefenmeester ging aan de slag bij Al-Diriyah uit Saoedi-Arabië. In de maanden daarvoor koos Schreuder er bewust voor om het even rustig aan te doen. Hij vertelt openhartig over de fysieke problemen die hij heeft gehad.",
      "publishedAt": "2025-12-19T22:06:08.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Under-fire Wolves chief Shi steps down",
      "link": "https://www.bbc.com/sport/football/articles/cx2p11555e4o?at_medium=RSS&at_campaign=rss",
      "summary": "Wolves' under-fire executive chairman Jeff Shi steps down, after a desperate start to the season for the club who sit bottom of the Premier League.",
      "publishedAt": "2025-12-19T21:45:22.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'It's not a tiger!' | Ilagan TERRIFIED by Ally Pally wasp",
      "link": "https://www.skysports.com/watch/video/13485747/world-darts-championship-lourence-ilagan-terrified-by-ally-pally-wasp",
      "summary": "Relive the hilarious moment Lourence Ilagan was left frightened by the infamous Ally Pally wasp!",
      "publishedAt": "2025-12-19T21:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Cambuur als eerste KKD-ploeg een heel jaar ongeslagen in eigen huis",
      "link": "https://www.vi.nl/nieuws/cambuur-als-eerste-ploeg-een-heel-jaar-ongeslagen-in-eigen-huis",
      "summary": "Cambuur kroonde zich vrijdagavond tot de eerste ploeg ooit die een heel kalenderjaar geen wedstrijd verloor in de Eerste Divisie. De ploeg uit Leeuwarden won overtuigend van MVV waarmee het totaal van 2025 op zeventien overwinningen en drie remises eindigt.",
      "publishedAt": "2025-12-19T21:33:43.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Greaves loses Gurney epic as Aspinall makes winning start to Worlds",
      "link": "https://www.skysports.com/darts/news/12040/13485650/world-darts-championship-beau-greaves-beaten-in-final-set-thriller-by-daryl-gurney-to-suffer-first-round-exit-at-alexandra-palace",
      "summary": "Beau Greaves narrowly missed out on becoming the second woman in history to win a match at the World Darts Championship after a dramatic 3-2 defeat to Daryl Gurney at Alexandra Palace.",
      "publishedAt": "2025-12-19T21:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'One of the best shots at this year's World Championship' | Gurney takes out 144",
      "link": "https://www.skysports.com/watch/video/13485736/world-darts-championship-daryl-gurney-takes-out-144-vs-beau-greaves",
      "summary": "Daryl Gurney finished 144 under huge pressure as he went on to win his World Darts Championship opener against Beau Greaves.",
      "publishedAt": "2025-12-19T21:11:00.000Z"
    }
  ]
}