{
  "generatedAt": "2025-12-19T14:47:08.160Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie voelt steun en begrip als 'de juiste man voor Feyenoord'",
      "link": "https://www.vi.nl/nieuws/van-persie-voelt-steun-en-begrip-als-de-juiste-man-voor-feyenoord",
      "summary": "Robin van Persie voelt steun en begrip bij Feyenoord. De trainer van de Rotterdammers is niet op zoek naar excuses en gelooft nog altijd dat hij de juiste man is op de juiste plek.",
      "publishedAt": "2025-12-19T14:40:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie heeft respect voor Valente en Smal: 'Hij kon zijn been niet optillen'",
      "link": "https://www.vi.nl/nieuws/van-persie-heeft-respect-voor-valente-en-smal-hij-kon-zijn-been-niet-optillen",
      "summary": "Feyenoord worstelt dit seizoen niet alleen met tegenvallende resultaten, maar ook met de fitheid van de selectie. Een hoop spelers, zoals Luciano Valente en Gijs Smal, lopen momenteel op hun tandvlees, maar blijven zich desondanks maximaal inzetten voor de Rotterdammers. Daar is hoofdtrainer Robin van Persie diep onder de indruk van.",
      "publishedAt": "2025-12-19T14:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Guardiola says ‘no discussions’ about City exit amid Maresca speculation: football – live",
      "link": "https://www.theguardian.com/football/live/2025/dec/19/maresca-on-chelsea-future-premier-league-news-and-more-football-live",
      "summary": "⚽ All the latest news going into the weekend programme ⚽ Premier League: 10 things to look out for | Mail Dom Re the players that have made it to Afcon, this is a handy explainer of the extent to which Premier League teams will be affected. Some of the names not featuring at Afcon are remarkable, and feature some of the most talented footballers from the continent. The main reason for this is that their nation has not qualified (for example, Ghana), but there have also been omissions from squads that have made it (unexpectedly Ivory Coast’s Simon Adingra, who was voted the best young player at Afcon 2023, providing a fine assist for the winner in the final) and there has even been an unexpected retirement on the eve of the tournament (Nigeria’s William Troost-Ekong, who was voted the player of the tournament at the last Afcon). Continue reading...",
      "publishedAt": "2025-12-19T14:37:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Tegenvaller voor Haller: spits FC Utrecht mist Afrika Cup",
      "link": "https://www.vi.nl/nieuws/tegenvaller-voor-haller-spits-fc-utrecht-mist-afrika-cup",
      "summary": "Sébastien Haller komt niet in actie op de Afrika Cup van 2025. De spits van FC Utrecht is door een blessure die hij bij zijn club opliep niet inzetbaar voor Ivoorkust en heeft zich moeten afmelden voor het toernooi.",
      "publishedAt": "2025-12-19T14:37:36.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Carl Hoefkens: 'Ik heb geen enkele interesse in een andere club dan NAC'",
      "link": "https://www.vi.nl/pro/carl-hoefkens-ik-heb-geen-enkele-interesse-in-een-andere-club-dan-nac",
      "summary": "Carl Hoefkens (47) heeft een functie als hoofdtrainer van RC Genk afgezegd. Dat vertelde de oefenmeester van NAC Breda vrijdagmiddag in aanloop naar het belangrijke degradatieduel met Telstar. Donderdag kwam de interesse van de topclub naar buiten, maar de Belg committeert zich aan de Bredanaars en focust zich vol op de sportieve wederopstanding.",
      "publishedAt": "2025-12-19T14:34:39.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Vote to exclude best teams from League Cup shows calendar needs urgent attention | Suzanne Wrack",
      "link": "https://www.theguardian.com/football/2025/dec/19/womens-league-cup-vote-champions-league-teams-calendar-wsl",
      "summary": "A crowded international calendar is undermining domestic leagues and WSL Football has been left to figure it out When the League Cup quarter-finals are played on Sunday it will probably be the last time they look this way. . West Ham v Manchester City, Liverpool v Chelsea, Manchester United v Tottenham and Crystal Palace v Arsenal means the top four in the Women’s Super League are involved. With clubs having voted to remove teams competing in the Champions League from next season, major changes are afoot. The future format of the League Cup is still to be finalised and is subject to Football Association signoff but this forms part of plans for a revamp of an underloved competition that has an identity crisis. The changes include ditching the confusing group stage with its uneven number of teams, weird point scoring and odd geographical groupings. It is understood proposals have been put together in consultation with a competition working group that included clubs and was reviewed by representatives from fan associations through the Football Supporters’ Association. Continue reading...",
      "publishedAt": "2025-12-19T14:22:46.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tottenham latest: Under-pressure Frank 'feels supported' by club",
      "link": "https://www.skysports.com/football/live-blog/12040/13025489/tottenham-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
      "summary": "",
      "publishedAt": "2025-12-19T14:19:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea's Maresca knocks back Man City rumours",
      "link": "https://www.espn.com/soccer/story/_/id/47355796/chelsea-enzo-maresca-knocks-back-man-city-job-rumours",
      "summary": "Chelsea head coach Enzo Maresca dismissed as \"100% speculation\" reports that he could replace Pep Guardiola at Manchester City.",
      "publishedAt": "2025-12-19T14:13:25.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Alonso denies need for Madrid's public support",
      "link": "https://www.espn.com/soccer/story/_/id/47356930/xabi-alonso-denies-needs-real-madrid-publicly-back-him",
      "summary": "Xabi Alonso has insisted that Real Madrid are united \"from the president to the players,\" denying that a public show of support from the club would help shore up his position as coach.",
      "publishedAt": "2025-12-19T14:13:25.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Slot: Liverpool have moved on from Salah saga",
      "link": "https://www.espn.com/soccer/story/_/id/47355797/liverpool-moved-mohamed-salah-saga-arne-slot",
      "summary": "Liverpool head coach Arne Slot said the club have \"moved on\" from the saga surrounding Mohamed Salah following his incendiary interview at Elland Road earlier this month.",
      "publishedAt": "2025-12-19T14:13:25.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City 'must prepare' for successor, says Guardiola",
      "link": "https://www.bbc.com/sport/football/articles/c7vm91l58d0o?at_medium=RSS&at_campaign=rss",
      "summary": "Pep Guardiola says Manchester City \"must be prepared\" to plan for his departure and eventual successor.",
      "publishedAt": "2025-12-19T14:02:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Bayern dacht aan ex-Ajacied Ramaj, Man City-huurling verlaat Leverkusen'",
      "link": "https://www.vi.nl/nieuws/bayern-dacht-aan-ex-ajacied-ramaj-man-city-huurling-verlaat-leverkusen",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2025-12-19T13:36:03.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Jet Blue tipped to land Long Walk Hurdle at Ascot",
      "link": "https://www.skysports.com/racing/news/12040/13485502/ascot-tips-jet-blue-fancied-for-grade-1-glory-in-long-walk-hurdle",
      "summary": "Host Kate Tracey is joined to preview an exciting weekend of racing from Ascot by Declan Rix and Sam Boswell. on the latest episode of Weekend Winners.",
      "publishedAt": "2025-12-19T13:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Will this Wolves team go down as the worst in Premier League history?",
      "link": "https://www.theguardian.com/football/who-scored-blog/2025/dec/19/wolves-worst-team-premier-league-history-derby-games-points",
      "summary": "After 16 games they are yet to win and are on course to break Derby’s record of securing 11 points in a season By WhoScored At what point does a relegation scrap turn into a scramble to prevent an historic crisis? Wolves appear to be answering that question this season. Sixteen games into the season they are without a win, have just two points, and are threatening to relieve Derby County of the unenviable label of the Premier League’s worst ever team. This isn’t just another bad side going down; this is a club threatening to become the Premier League’s ultimate cautionary tale. Wolves may have already crossed that line. They became the first team in Premier League history to start consecutive campaigns with 10 or more winless matches, and now they stand on the brink of further infamy. Failure to beat Brentford this weekend would see Wolves equal Sheffield United’s record 17-game winless start in the 2020-21 season. Continue reading...",
      "publishedAt": "2025-12-19T12:58:15.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Nancy, Ayunga & Hearts v Rangers in spotlight",
      "link": "https://www.bbc.com/sport/football/articles/ce3zp87yy5ko?at_medium=RSS&at_campaign=rss",
      "summary": "Will Wilfried Nancy end his losing start as Celtic manager? Will Jonah Ayunga continue his scoring streak? And how are Heart of Midlothian and Rangers shaping up for Sunday's Scottish Premiership game of the weekend?",
      "publishedAt": "2025-12-19T12:14:49.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "They lead the NFL - but are the Broncos really Super Bowl contenders?",
      "link": "https://www.skysports.com/nfl/news/12040/13485064/nfl-bo-nix-and-denver-broncos-show-they-are-super-bowl-contenders-as-trevor-lawrences-jacksonville-jaguars-face-biggest-test",
      "summary": "Christmas football is here and the NFL playoffs are on the horizon. With just three weeks of the regular season remaining, postseason places are on the line...",
      "publishedAt": "2025-12-19T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bayern Munich’s Luis Díaz: ‘I want to enjoy it and create those chaotic moments’",
      "link": "https://www.theguardian.com/football/2025/dec/19/luis-diaz-inerview-bayern-munich-liverpool-colombia-world-cup",
      "summary": "The former Liverpool winger speaks about his hot start at Bayern, playing with Harry Kane, and hopes for the 2026 World Cup After leaving Liverpool this past summer, Luis Díaz has had a strong start at Bayern Munich under Vincent Kompany, having accumulated 18 goal contributions (12 goals, six assists) in all competitions. Bayern manager Vincent Kompany gave Díaz a few days off to press the reset button after his sending off against PSG, but now the 28-year-old winger is back and ready to wrap up the year as Bayern play their final game of 2025 this Sunday when they travel to Heidenheim. I spoke to the Colombian star about his new club, life in Germany and next summer’s World Cup, which includes a headline matchup against Cristiano Ronaldo’s Portugal. This interview has been lightly edited for length and clarity. Continue reading...",
      "publishedAt": "2025-12-19T11:00:02.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "England's X-factor has 'hill to climb' - will Palmer go to World Cup?",
      "link": "https://www.bbc.com/sport/football/articles/clyd7ndpvvno?at_medium=RSS&at_campaign=rss",
      "summary": "Does Cole Palmer still have hope of making England's World Cup squad? BBC Sport chief football writer Phil McNulty examines the Chelsea star's chances.",
      "publishedAt": "2025-12-19T10:33:08.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The 100 best male footballers in the world 2025",
      "link": "https://www.theguardian.com/football/ng-interactive/2025/dec/16/the-100-best-male-footballers-in-the-world-2025",
      "summary": "Ousmane Dembélé becomes our seventh winner as he beats Lamine Yamal into second and Vitinha into third on our list of the best players on the planet Premier League dominates list | How every judge voted | Our methodology | The top 100 female players for 2025 2024 edition | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 Continue reading...",
      "publishedAt": "2025-12-19T10:04:51.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League Future Power Rankings: Long-term projections for all 20 teams",
      "link": "https://www.espn.com/soccer/story/_/id/47349773/premier-league-future-power-rankings-projections-all-20-teams",
      "summary": "We ranked all 20 Premier League clubs' expectations for the next few years. Which teams are set up to thrive in the future?",
      "publishedAt": "2025-12-19T08:49:03.000Z"
    }
  ]
}