{
  "generatedAt": "2026-01-10T07:22:38.279Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: AZ krijgt bezoek van FC Volendam, Twente ontvangt PEC",
      "link": "https://www.vi.nl/nieuws/vi-live-az-krijgt-bezoek-van-fc-volendam-twente-ontvangt-pec",
      "summary": "Zaterdag wordt de Eredivisie weer hervat. Er staan vier wedstrijden op het programma. Daarnaast is er volop voetbal in het buitenland. In deze VI Live blijf je op de hoogte van de belangrijkste verrichtingen in binnen- en buitenland.",
      "publishedAt": "2026-01-10T07:01:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hearn: Grieving Joshua needs time before deciding on boxing future",
      "link": "https://www.skysports.com/boxing/news/12040/13492688/anthony-joshua-needs-time-to-process-friends-deaths-before-decision-on-boxing-future-says-eddie-hearn",
      "summary": "Eddie Hearn says Anthony Joshua needs time to grieve before he makes a decision on his boxing future - but does think the former heavyweight champion will return to the ring.",
      "publishedAt": "2026-01-10T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "In-form pair Accrual and Baldomero clash at Lingfield",
      "link": "https://www.skysports.com/racing/news/12040/13492158/today-on-sky-sports-racing-lingfield-and-newcastle",
      "summary": "We have a busy day’s racing on Saturday with All-Weather action from Lingfield and Newcastle, live on Sky Sports Racing.",
      "publishedAt": "2026-01-10T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De 33-jarige Nederlander die met een bordje een MLS-stage wil regelen",
      "link": "https://www.vi.nl/pro/de-33-jarige-nederlander-die-met-een-bordje-een-mls-stage-wil-regelen",
      "summary": "Er zijn verschillende manieren om een stage bij een club te regelen. Een voetballer kan zijn zaakwaarnemer aan het werk zetten of zelf contact opnemen met iemand uit zijn netwerk. Jerry van Wolfgang (33) pakt het compleet anders aan. De voormalig Nederlands jeugdinternational speelde ruim anderhalf jaar geleden zijn laatste wedstrijd, maar voelt aan alles dat hij nog lang niet klaar is. Daarom staat hij nu iedere dag met een bordje in Washington en vraagt hij MLS-club DC United om een kans.",
      "publishedAt": "2026-01-10T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: PSV hervat Eredivisie met thuiswedstrijd tegen Excelsior",
      "link": "https://www.vi.nl/nieuws/vi-live-psv-hervat-eredivisie-met-thuiswedstrijd-tegen-excelsior",
      "summary": "Zaterdag om 20.00 uur hervat PSV de Eredivisie. De koploper krijgt om 20.00 uur bezoek van Excelsior. In deze VI Live blijf je volledig op de hoogte van die wedstrijd.",
      "publishedAt": "2026-01-10T06:01:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League rights may end up at Netflix despite reluctant football romance",
      "link": "https://www.theguardian.com/football/2026/jan/10/premier-league-netflix-paramount-skydance-wbd-media",
      "summary": "As Netflix and Paramount Skydance clash over WBD, football rights once considered peripheral could become central to the future of UK streaming Netflix has spent years politely rebuffing Premier League and Uefa entreaties to bid for their TV rights, so it would be ironic if it picked them up by default. That intriguing outcome is a possibility as a result of the $100bn-plus takeover battle for Warner Bros Discovery (WBD) between Netflix and its streaming rival Paramount Skydance which will shape the future not only of Hollywood but global news. Much-hyped sports rights are a footnote in a deal of such magnitude that it will require signoff from the US government, but the implications for football will be profound, even if Donald Trump is more concerned about who owns (and presents on) CNN than which platform shows Bournemouth v Brighton at Saturday lunchtime next season. Continue reading...",
      "publishedAt": "2026-01-10T06:00:49.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De verbeelding aan de macht: toen VI in de Panini-rage dook",
      "link": "https://www.vi.nl/pro/de-verbeelding-aan-de-macht-toen-vi-in-de-panini-rage-dook",
      "summary": "In de rubriek VI Tijdmachine herplaatsen we elke dag in het weekeinde een verhaal uit ons rijke archief. Ditmaal uit de winter van 2003/04, toen de Panini-voetbalplaatjes na drie jaar weer terugkeerden.",
      "publishedAt": "2026-01-10T05:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham hail 'special' cup win in front of Reynolds",
      "link": "https://www.espn.com/soccer/story/_/id/47564201/wrexham-fa-cup-ryan-reynolds-nottingham-forest",
      "summary": "Wrexham manager Phil Parkinson hailed their \"special\" FA Cup giant-killing triumph over the Premier League's Nottingham Forest and expressed his delight that the Welsh club's movie star owner Ryan Reynolds was there to see it.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "San Diego working on exit of Mexico star Lozano",
      "link": "https://www.espn.com/soccer/story/_/id/47562938/san-diego-fc-hirving-chucky-lozano-transfer-mexico",
      "summary": "San Diego FC said Friday they were working on the exit of Mexico international Hirving Lozano.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior: Chelsea can equal United's 'class of 92'",
      "link": "https://www.espn.com/soccer/story/_/id/47562611/liam-rosenior-chelsea-emulate-man-united-class-92",
      "summary": "Liam Rosenior believes Chelsea can emulate Manchester United's fabled 'Class of '92' as they pursue a policy of targeting silverware with young players.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Interim boss Fletcher in dark over Man Utd plans",
      "link": "https://www.espn.com/soccer/story/_/id/47561062/darren-fletcher-dark-man-united-manager-plans-no-conversations",
      "summary": "Darren Fletcher says he's in the dark over Manchester United's plans for his future as he prepares to take charge of his second game as caretaker boss.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham's story 'written in the stars, literally'",
      "link": "https://www.bbc.com/sport/football/articles/cj0nz85nplpo?at_medium=RSS&at_campaign=rss",
      "summary": "Wrexham's remarkable rise continues by knocking Premier League side Nottingham Forest out of the FA Cup in dramatic fashion.",
      "publishedAt": "2026-01-10T00:03:16.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Unacceptable to the badge' - Dyche fumes at FA Cup exit",
      "link": "https://www.bbc.com/sport/football/articles/c4g4rqgqe0jo?at_medium=RSS&at_campaign=rss",
      "summary": "Sean Dyche calls for some of his Nottingham Forest players to \"have a look in the mirror\" after an \"unacceptable\" first-half performance in their FA Cup loss at Wrexham on penalties.",
      "publishedAt": "2026-01-09T23:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Papers: Arsenal and Man City to battle for Livramento this summer",
      "link": "https://www.skysports.com/football/news/12040/13492676/arsenal-and-man-city-to-battle-for-newcastles-tino-livramento-this-summer-paper-talk-and-football-transfer-gossip",
      "summary": "The top stories and transfer rumours from Saturday's newspapers...",
      "publishedAt": "2026-01-09T23:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Pocognoli en AS Monaco zijn het even flink kwijt: 'Het bestuur staat achter me'",
      "link": "https://www.vi.nl/nieuws/pocognoli-en-as-monaco-zijn-het-even-flink-kwijt-het-bestuur-staat-achter-me",
      "summary": "Sébastien Pocognoli kwam met hoge verwachtingen binnen bij AS Monaco, maar moet nu al zijn eerste brandje blussen. De club presteert slecht en won er van de afgelopen zeven competitiewedstrijden slechts één.",
      "publishedAt": "2026-01-09T22:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Goalkeeper Okonkwo is the hero as Wrexham shock Nottingham Forest in FA Cup shootout",
      "link": "https://www.theguardian.com/football/2026/jan/09/wrexham-nottingham-forest-fa-cup-third-round-match-report",
      "summary": "North Americans have rarely been fans of draws in sport, so the unscripted FA Cup drama of seeing Arthur Okonkwo take a starring role in a penalty shootout after Wrexham were pegged back in the final minute of normal time must have brought joy to co-owner Ryan Reynolds in the stands. The club the Hollywood actor invested in were just about underdogs against Premier League Nottingham Forest in a game that included numerous plot twists, only to provide the romantic ending the majority wanted. The heroic Okonkwo saved from Igor Jesus and Omari Hutchinson in the shootout to ensure James McClean’s miss was irrelevant. It should have been easier for ­Wrexham, who had a two-goal lead at 3-1 before Callum Hudson-Odoi’s double forced extra time on an energy-sapping and freezing night. Continue reading...",
      "publishedAt": "2026-01-09T22:34:48.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "O'Sullivan pulls out of Masters on medical grounds",
      "link": "https://www.skysports.com/snooker/news/12040/13492660/ronnie-osullivan-eight-time-masters-snooker-champion-pulls-out-of-2026-tournament-on-medical-grounds",
      "summary": "Ronnie O'Sullivan has pulled out of the Masters on medical grounds for the second year in a row.",
      "publishedAt": "2026-01-09T22:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Morocco sail into Afcon semi-finals as Díaz sparks fine win over Cameroon",
      "link": "https://www.theguardian.com/football/2026/jan/09/cameroon-morocco-africa-cup-of-nations-quarter-final-match-report",
      "summary": "At last, Morocco have arrived at the tournament they are hosting. For four games they had played scratchy, crabbed football. Finally, in a spiky, ill-tempered quarter-final, there was something more like the Morocco that reached the semi-finals of the World Cup two years ago. If the game wasn’t fluent, that was largely Cameroon’s doing as they spoiled and delayed and sought treatment for injuries. But the hosts, for the most part, retained their cool, protecting a lead earned with verve in the first half with maturity in the second. In previous games, Morocco had looked tense, limbs leadened by the expectation of a country that last won the Cup of Nations 50 years ago and that has spent a vast amount on football-related infrastructure as it prepares to co-host the 2030 World Cup. The coach, Walid Regragui, was even booed in the last-16 victory over Tanzania, his football deemed overly cautious despite a record of only four defeats in his 46 games as national coach before this quarter-final. “I always say that we are a family,” said Regragui. “Even if many people don’t believe in us or in me … that’s OK. We play for the country and for the supporters who want to see Morocco at the top.” Continue reading...",
      "publishedAt": "2026-01-09T21:25:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Edinburgh stage comeback to defeat Gloucester as Bath stay top",
      "link": "https://www.skysports.com/rugby-union/news/12040/13492633/champions-cup-edinburgh-deny-gloucester-in-comeback-victory-as-bath-beat-castres-to-close-on-winning-pool-two",
      "summary": "Edinburgh staged a second-half comeback to pick up a hard-fought 26-24 win over Gloucester in the Champions Cup and consigned the visitors to a fifth straight defeat.",
      "publishedAt": "2026-01-09T20:44:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ole Gunnar Solskjær set for face-to-face talks with Manchester United this weekend",
      "link": "https://www.theguardian.com/football/2026/jan/09/ole-gunnar-solskjr-set-for-face-to-face-talks-with-manchester-united-this-weekend",
      "summary": "Coach is vying with Michael Carrick to be interim manager Solskjær due at Carrington training base on Saturday Ole Gunnar Solskjær will have face-to-face talks with Manchester United on Saturday regarding becoming the interim manager until the end of the season. The Norwegian is vying with Michael Carrick for the role and is expected to meet Omar Berrada, United’s chief executive, and Jason Wilcox, the director of football, at the club’s Carrington training base. Continue reading...",
      "publishedAt": "2026-01-09T20:19:05.000Z"
    }
  ]
}