{
  "generatedAt": "2026-01-11T04:11:32.964Z",
  "items": [
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "USMNT's Pepi suffers broken arm scoring for PSV",
      "link": "https://www.espn.com/soccer/story/_/id/47573639/usmnt-ricardo-pepi-broken-arm-psv-eindhoven-goal",
      "summary": "United States striker Ricardo Pepi suffered a broken forearm while in action for PSV Eindhoven on Saturday and and is set to be sidelined for two months, the Dutch club has confirmed..",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Buoyant Rosenior lauds 5-star Chelsea start",
      "link": "https://www.espn.com/soccer/story/_/id/47574761/liam-rosenior-chelsea-squad-charlton-fa-cup",
      "summary": "New Chelsea head coach Liam Rosenior promised more to come from his second string after they swept aside Charlton 5-1 at the Valley in his first match in charge.",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Fletcher 'prepared' to lead Man Utd until summer",
      "link": "https://www.espn.com/soccer/story/_/id/47572566/darren-fletcher-man-united-manager-interim-season",
      "summary": "Darren Fletcher has said he's \"prepared\" if Manchester United decide to hand him the head coach job until the end of the season.",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah scores to set up AFCON reunion with Mané",
      "link": "https://www.espn.com/espn/story/_/id/47573488/salah-fires-egypt-afcon-champions-ivory-coast-set-mane-senegal-reunion-semifinal",
      "summary": "Mohamed Salah scored his fourth goal of the Africa Cup of Nations as Egypt defeated defending champions Ivory Coast 3-2 in Agadir.",
      "publishedAt": "2026-01-11T00:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Supercopa Clasico preview, predictions: Are Barcelona favorites vs. Real Madrid?",
      "link": "https://www.espn.com/soccer/story/_/id/47568270/barcelona-favorites-vs-real-madrid",
      "summary": "Barcelona and Real Madrid meet in the Supercopa final Sunday, but who has the upper hand? Sam Marsden and Alex Kirkland preview the upcoming Clasico.",
      "publishedAt": "2026-01-11T00:14:58.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Rosenior sees no need for drastic change at Chelsea",
      "link": "https://www.bbc.com/sport/football/articles/crrnzerklyeo?at_medium=RSS&at_campaign=rss",
      "summary": "Liam Rosenior does not see a need for drastic change at Chelsea - and that was part of the reason he was brought in.",
      "publishedAt": "2026-01-10T23:48:13.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hato verbaasd door eerste goal voor Chelsea: 'Daarom juichte ik niet'",
      "link": "https://www.vi.nl/nieuws/hato-verbaasd-door-eerste-goal-voor-chelsea-daarom-juichte-ik-niet",
      "summary": "Bij Chelsea werd het zaterdag een avond vol primeurs. Manager Liam Rosenior coachte zijn eerste wedstrijd bij The Blues en verdediger Jorrel Hato maakte zijn eerste goal. Daar was de Oranje-international uiteraard dolblij mee.",
      "publishedAt": "2026-01-10T22:47:35.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Give me the world title fight' - Kabayel wants Usyk after beating Knyba",
      "link": "https://www.skysports.com/boxing/news/12040/13492954/agit-kabayel-stops-damian-knyba-to-retain-wbc-interim-world-heavyweight-title-and-calls-for-oleksandr-usyk-fight",
      "summary": "Agit Kabayel stopped Damian Knyba in the third round to retain his WBC interim heavyweight title as the unbeaten fighter set his sights on Oleksandr Usyk.",
      "publishedAt": "2026-01-10T22:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Vaessen gaat in op WK-kansen Suriname en nieuwe bondscoach Ten Cate",
      "link": "https://www.vi.nl/nieuws/vaessen-gaat-in-op-wk-kansen-met-suriname-en-nieuwe-bondscoach-ten-cate",
      "summary": "Etienne Vaessen was na afloop van de remise tegen NAC Breda niet tevreden over het resultaat ( 0-0 ). De Surinaamse doelman ging daarna ook in op de WK-kansen van zijn land en de aanstelling van de nieuwe bondscoach Henk ten Cate. 'We gaan het gewoon halen.'",
      "publishedAt": "2026-01-10T22:41:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transfers PSV: Bosz sluit extra transfer niet uit na blessure Pepi",
      "link": "https://www.vi.nl/nieuws/transfers-psv-bosz-sluit-extra-transfer-niet-uit-na-blessure-pepi",
      "summary": "Ook buiten de transferperiode om volgt VI het transfernieuws bij PSV op de voet, ook omdat het sneller dan je denkt alweer januari is. De doelwitten van de Eindhovenaren, duiding van de clubwatcher, of aandacht in buitenlandse media. We verzamelen alles hier.",
      "publishedAt": "2026-01-10T22:38:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bosz legt uit wat rol Afellay in technische staf bij PSV wordt",
      "link": "https://www.vi.nl/video/bosz-legt-uit-wat-rol-afellay-in-technische-staf-bij-psv-wordt",
      "summary": "PSV-trainer Peter Bosz ging na de Eredivisie-zege op Excelsior in op de rol van Ibrahim Afellay in de technische staf. De 39-jarige oud-international volgde André Ooijer op als assistent-coach en zal zich voornamelijk gaan bezighouden met de middenvelders in de selectie van PSV. Maar er is meer, legde Bosz uit op zijn persconferentie.",
      "publishedAt": "2026-01-10T22:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bosz gaat in op blessure Pepi en aanstelling van extra specialist",
      "link": "https://www.vi.nl/nieuws/bosz-gaat-in-op-blessure-pepi-en-aanstelling-van-extra-specialist",
      "summary": "PSV-trainer Peter Bosz heeft op de persconferentie na de zege op Excelsior gereageerde op de nieuwe blessure van Ricardo Pepi. De spits viel na zijn doelpunt uit met een armblessure en blijkt nu een aantal maanden uit de roulatie te zijn.",
      "publishedAt": "2026-01-10T22:20:29.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Another door closes for Spurs and Frank with damaging FA Cup exit",
      "link": "https://www.bbc.com/sport/football/articles/cvg1p1vgvg3o?at_medium=RSS&at_campaign=rss",
      "summary": "After Spurs' damaging FA Cup exit at home to Aston Villa, chief football writer Phil McNulty asks how long can head coach Thomas Frank survive?",
      "publishedAt": "2026-01-10T22:18:43.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea thrash Charlton to get Liam Rosenior era off to winning start",
      "link": "https://www.theguardian.com/football/2026/jan/10/charlton-chelsea-premier-league-match-report",
      "summary": "It sums up the uneasy state of affairs at Chelsea that the new head coach winning his first match in charge was not enough to stop the mutiny. This was a controlled, clinical performance from Liam Rosenior’s second string, who strolled into the fourth round of the FA Cup after a 5-1 win over a game but limited Charlton Athletic, but once again the big talking point was the travelling support spewing venom in the direction of their unpopular owners. Dissatisfaction with the project is not going away. It did not even matter when Rosenior looked at his bench with Chelsea 3-1 up in the second half and decided to give Estevão Willian a runout against tired, lowly Championship opposition. The Brazilian winger is one of the best young players in the world and his runs were soon making Charlton’s defenders dizzy, but even signings like Estêvão have done little to sway the view of a fanbase united in opposition to an ownership almost four years in and still to convince naysayers that their unique vision will bring success. Continue reading...",
      "publishedAt": "2026-01-10T22:08:57.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior wins first game in charge as Chelsea see off Charlton in FA Cup",
      "link": "https://www.skysports.com/football/charlton-athletic-vs-chelsea/report/550856",
      "summary": "Liam Rosenior won his first game as Chelsea's new head coach, beating Charlton 5-1 in the FA Cup third round.",
      "publishedAt": "2026-01-10T22:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Frank's failing Spurs knocked out of FA Cup by Aston Villa",
      "link": "https://www.bbc.com/sport/football/videos/c24gqz3379eo?at_medium=RSS&at_campaign=rss",
      "summary": "Goals from Emiliano Buendia and Morgan Rogers knock a wasteful Tottenham Hotspur side out of the FA Cup to pile more pressure on manager Thomas Frank.",
      "publishedAt": "2026-01-10T20:22:52.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Buendía deepens gloom for Frank and Spurs as Aston Villa progress in FA Cup",
      "link": "https://www.theguardian.com/football/2026/jan/10/tottenham-aston-villa-fa-cup-match-report",
      "summary": "This was Tottenham’s second defeat to Aston Villa this season and it is becoming increasingly hard to imagine Thomas Frank being in charge when the teams come together a third time in May. A performance that put an end to any realistic chance of a trophy fell well below the expectations of a furious crowd. That their opponents currently offer the diametric opposite of Tottenham’s dysfunction can only have heightened the sting. Goals from Emi Buendía and Morgan Rogers put this tie to bed for Villa in the first half, Wilson Odobert’s strike after half-time bringing a closeness to the scoreline that was not reflected in the general play. A scuffle on the field at the final whistle involving Rogers, João Palhinha and a host of Tottenham players only added further sourness to the occasion. Continue reading...",
      "publishedAt": "2026-01-10T20:03:02.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Weston-super-Mare’s lecturers and builders denied FA Cup glory at Grimsby",
      "link": "https://www.theguardian.com/football/2026/jan/10/grimsby-weston-super-mare-fa-cup-match-report",
      "summary": "The romance of the FA Cup in Cleethorpes, ultimately, was limited to a good old-fashioned away following of 571 hardy yet boisterous souls from Weston-super-Mare. The Seagull Army twice wildly celebrated second-half equalisers through Luke Coulson and their predatory striker Louis Britton before Grimsby substitute Kieran Green’s looping header settled the match and ended Weston’s stirring six-game run in the competition. Continue reading...",
      "publishedAt": "2026-01-10T20:01:48.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Pressure builds on Frank as Spurs booed off after FA Cup exit to Villa",
      "link": "https://www.skysports.com/football/tottenham-hotspur-vs-aston-villa/report/550880",
      "summary": "Tottenham were booed off as pressure continues to build on Thomas Frank following a 2-1 defeat to Aston Villa in the third round of the FA Cup.",
      "publishedAt": "2026-01-10T19:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Humble' Semenyo steals show in FA Cup mauling",
      "link": "https://www.bbc.com/sport/football/articles/c5y24vw1vd2o?at_medium=RSS&at_campaign=rss",
      "summary": "Antoine Semenyo signed off at Bournemouth in fairytale fashion and makes start to life at Manchester City in a similarly dreamy manner during 10-1 FA Cup win over League One Exeter City.",
      "publishedAt": "2026-01-10T19:13:37.000Z"
    }
  ]
}