{
  "generatedAt": "2026-01-17T04:35:04.499Z",
  "items": [
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Transfer request from teen starlet stuns Barça",
      "link": "https://www.espn.com/soccer/story/_/id/47632181/barcelona-stunned-transfer-request-teen-dro-fernandez",
      "summary": "Barcelona have been left stunned after teenager Dro Fernández informed the club of his desire to leave this January by exercising his €6 million ($7m) release clause, sources have told ESPN.",
      "publishedAt": "2026-01-17T03:20:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "USMNT's Sargent banished to Norwich U21s",
      "link": "https://www.espn.com/soccer/story/_/id/47632092/usmnt-josh-sargent-norwich-u21s-transfer-toronto-fc-wrexham",
      "summary": "Norwich City manager Philippe Clement revealed that USMNT striker Josh Sargent has been sent to play with the club's under-21s following his refusal to take part in last weekend's FA Cup match against Walsall.",
      "publishedAt": "2026-01-17T03:20:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Senegal demand 'equal treatment' for AFCON final",
      "link": "https://www.espn.com/soccer/story/_/id/47634920/senegal-slam-host-morocco-lack-fair-play-ahead-afcon-final",
      "summary": "The Senegalese Football Federation filed a formal complaint ahead of Sunday's Africa Cup of Nations final against Morocco, citing a failure to provide adequate security, accommodation, training facilities, and fair ticket allocations.",
      "publishedAt": "2026-01-17T03:20:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Dembélé scores stunning lob in PSG win over Lille",
      "link": "https://www.espn.com/soccer/report/_/gameId/746570",
      "summary": "Ousmane Dembélé put transfer talk behind him and scored a crucial brace for Paris Saint-Germain in a 3-0 win over Lille that returned it to the top of Ligue 1 on Friday.",
      "publishedAt": "2026-01-17T03:20:14.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Nix is like a dog on a leash' - Schecter on why Bills have hope at Broncos",
      "link": "https://www.skysports.com/nfl/news/12040/13495204/buffalo-bills-vs-denver-broncos-bo-nixs-limitations-give-josh-allen-chance-to-claim-another-road-win-in-nfl-playoffs-says-phoebe-schecter",
      "summary": "Denver Broncos quarterback Bo Nix still needing to be manipulated like \"a dog on a leash\" gives Josh Allen hope of extending the Buffalo Bills' playoff run, according to Phoebe Schecter.",
      "publishedAt": "2026-01-16T23:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De Jong lovend over uitblinker Baouf na cruciale zege bij ADO",
      "link": "https://www.vi.nl/nieuws/de-jong-lovend-over-uitblinker-baouf-na-cruciale-zege-bij-ado",
      "summary": "Cambuur deed vrijdagavond uitstekende zaken in de Keuken Kampioen Divisie. De Friezen wonnen de eerste wedstrijd van het kalenderjaar, nota bene op bezoek bij koploper ADO Den Haag. Na afloop wilde trainer Henk de Jong het maar wat graag hebben over een uitblinker in zijn ploeg.",
      "publishedAt": "2026-01-16T22:48:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie laat zijn licht schijnen op Sparta: 'We zullen getest worden'",
      "link": "https://www.vi.nl/video/van-persie-laat-zijn-licht-schijnen-op-sparta-we-zullen-getest-worden",
      "summary": "Feyenoord hoopt zijn eerste zege van 2026 zondag te boeken, thuis tegen Sparta Rotterdam. Robin van Persie, trainer van de club uit Rotterdam-Zuid, verwacht geen makkelijke middag tegen de Kasteelheren .",
      "publishedAt": "2026-01-16T22:32:03.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Uitvallen Nederlandse doelman blijkt begin van rampavond voor Club Brugge",
      "link": "https://www.vi.nl/nieuws/uitvallen-nederlandse-doelman-blijkt-begin-van-rampavond-voor-club-brugge",
      "summary": "De eerste voetbalweek van 2026 werd een inktzwarte voor Club Brugge. De Vlaamse topclub werd midweeks in de beker uitgeschakeld door Charleroi, vrijdagavond gaf het thuis een 2-0 voorsprong helemaal weg tegen La Louvière: 2-3. Tot overmaat van ramp viel Dani van den Heuvel geblesseerd uit.",
      "publishedAt": "2026-01-16T22:30:16.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Former Man Utd players' comments 'irrelevant' - Carrick",
      "link": "https://www.bbc.com/sport/football/articles/c5yv019g5nwo?at_medium=RSS&at_campaign=rss",
      "summary": "Michael Carrick brands the noise generated around Manchester United by former players \"irrelevant\" and says Roy Keane's personal comments did not bother him.",
      "publishedAt": "2026-01-16T22:30:12.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Frank must beware ghost of Tottenham managers past to avoid Nuno’s fate",
      "link": "https://www.theguardian.com/football/2026/jan/16/tottenham-thomas-frank-west-ham-nuno",
      "summary": "Manager aware his reign has parallels to the Spurs spell of his counterpart at West Ham, Saturday’s visitors When Thomas Frank glances along the touchline at Nuno Espírito Santo on Saturday afternoon, he will see more than the ghost of Tottenham managers past. Because during his darkest hours – and there have been a few of those during a fraught first season at the club – he may also see a vision of his own future. The parallels between the two are clear and they are difficult to ignore as Nuno makes his return to Spurs with West Ham, desperate for a result to help lift the club out of the relegation places. When Nuno went to Spurs in 2021, he did so as a manager who had made his name in English football with Wolves, getting them promoted from the Championship and going on to enjoy success with them in the top division. Ditto Frank with Brentford before his move to Spurs last summer. Continue reading...",
      "publishedAt": "2026-01-16T22:30:09.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League news: Arteta welcomes throw-in coach, Moyes defends Barry",
      "link": "https://www.theguardian.com/football/2026/jan/16/premier-league-news-arsenal-coach-mikel-arteta",
      "summary": "News from Friday’s press conferences, including updates on Arsenal, Nottingham Forest and West Ham Continue reading...",
      "publishedAt": "2026-01-16T22:30:04.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Historic moment! Sergio Perez drives first ever Cadillac car at Silverstone",
      "link": "https://www.skysports.com/watch/video/13495201/f1-historic-moment-sergio-perez-drives-first-ever-cadillac-car-at-silverstone",
      "summary": "A historic moment for Cadillac as Sergio Perez drives their first ever car at Silverstone.",
      "publishedAt": "2026-01-16T22:08:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Magnifieke Dembélé gidst PSG naar (tijdelijke) Franse koppositie",
      "link": "https://www.vi.nl/nieuws/magnifieke-demb-l-gidst-psg-naar-tijdelijke-franse-koppositie",
      "summary": "Paris Saint-Germain heeft vrijdagavond geen misstap begaan in de Franse titelstrijd. In eigen huis was de topclub te sterk voor Lille en daarvoor mochten de bedankjes naar Ousmane Dembélé. Vooral de tweede treffer van de sterspeler was onwaarschijnlijk mooi. Eerder op de avond zonk AS Monaco verder weg in de eigen moeilijkheden.",
      "publishedAt": "2026-01-16T21:55:13.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Miovski hat-trick helps Rangers beat fourth-tier Annan in Scottish Cup",
      "link": "https://www.skysports.com/football/rangers-vs-annan-athletic/report/550772",
      "summary": "Rangers are safely through to the fifth round of the Scottish Cup after a routine 5-0 victory over fourth-tier Annan Athletic at Ibrox.",
      "publishedAt": "2026-01-16T21:43:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Roma-aanwinst Malen bespreekt het Colosseum en vriendschap met Kluivert",
      "link": "https://www.vi.nl/nieuws/roma-aanwinst-malen-bespreekt-het-colosseum-en-vriendschap-met-kluivert",
      "summary": "Donyell Malen was nog nooit in Rome geweest, maar is maar wat blij dat hij voortaan speler van AS Roma is. De Italianen maakten zijn transfer vrijdag wereldkundig, en Malen stond het clubkanaal op zijn eerste werkdag meteen te woord.",
      "publishedAt": "2026-01-16T21:31:51.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Van Gerwen wins Bahrain title as Littler's 21-match winning run is ended",
      "link": "https://www.skysports.com/darts/news/12040/13495058/bahrain-darts-masters-michael-van-gerwen-wins-title-against-gian-van-veen-as-luke-littlers-winning-streak-is-ended",
      "summary": "Michael van Gerwen won the Dutch derby against Gian van Veen to win the Bahrain Darts Masters as Luke Littler's 21-match winning run came to an end.",
      "publishedAt": "2026-01-16T20:18:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No cups, no Europe, 40 matches: is this Manchester United’s post-Ferguson nadir?",
      "link": "https://www.theguardian.com/football/2026/jan/16/manchester-united-nadir-michael-carrick-derby",
      "summary": "As Michael Carrick prepares for Saturday’s derby, fans wonder if this is the club’s worst moment – but they are spoilt for choice Manchester United, without a permanent head coach or European football and knocked out of both domestic cups at the first time of asking, are facing another bleak season. In the almost 13 years since Sir Alex Ferguson left, the club have struggled to find stability, with his shadow stretching down from the directors’ box to the dugout, emphasised by the stand named in his honour staring back. Manchester City arrive at Old Trafford on Saturday in the opposite position, having had Pep Guardiola in post for a decade, amassing 18 major trophies. Michael Carrick will take charge of United for the first time since being appointed until the end of the season at a club who appear to be without a functioning long-term plan. This will be a campaign of only 40 competitive games for United, their fewest since 1914-15, with some fans thankful for being able to cut down on trudging visits. So is this, in the post-Ferguson era, the lowest of the lows? Continue reading...",
      "publishedAt": "2026-01-16T20:00:06.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The dramatic 24 hours that sealed Guehi and Glasner's futures",
      "link": "https://www.bbc.com/sport/football/articles/cvgpvgzl377o?at_medium=RSS&at_campaign=rss",
      "summary": "BBC Sport looks at a dramatic 24 hours for Crystal Palace as captain Marc Guehi agrees to join Manchester City and manager Oliver Glasner confirms he is leaving in the summer.",
      "publishedAt": "2026-01-16T19:55:30.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'No panic buy' - Guehi would cap £414m rebuild as Man City up title ante",
      "link": "https://www.bbc.com/sport/football/articles/cwywey6yyzlo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City have upped the ante in the Premier League title race by flexing their muscles in the January transfer window.",
      "publishedAt": "2026-01-16T19:06:44.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Oliver Glasner’s inevitable exit compounds one of Crystal Palace’s worst ever weeks | Ed Aarons",
      "link": "https://www.theguardian.com/football/2026/jan/16/oliver-glasner-inevitable-exit-crystal-palace-marc-guehi",
      "summary": "Manager’s decision is no surprise having fought to keep Marc Guéhi in the summer and amid doubts over futures of a host of Palace’s FA Cup-winning stars It was the day Crystal Palace supporters had dreaded but feared was inevitable. Oliver Glasner, having confirmed that the captain Marc Guéhi’s move to Manchester City is poised to go ahead, had another bombshell prepared for his press conference to preview Saturday’s trip to Sunderland. Nearly eight months to the day since the Austrian led the club to their first major trophy by beating Manchester City in the FA Cup final, his announcement that he will leave Selhurst Park at the end of the season came as no surprise. It rounds off one of the worst weeks in the club’s history after the humiliating defeat by non-league Macclesfield that will be for ever an unwanted postscript to their victory. Continue reading...",
      "publishedAt": "2026-01-16T19:00:05.000Z"
    }
  ]
}