{
  "generatedAt": "2026-01-08T19:23:08.754Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Sneijder heeft goed gevoel bij Lazio-transfer Taylor: 'Hij is realistisch geweest'",
      "link": "https://www.vi.nl/nieuws/sneijder-heeft-goed-gevoel-bij-lazio-transfer-taylor-hij-is-realistisch-geweest",
      "summary": "Wesley Sneijder denkt dat Kenneth Taylor een succes kan worden in de Serie A. De middenvelder van Ajax is donderdag naar Rome afgereisd om zijn transfer naar Lazio af te ronden. 'Een ideale stap', aldus Sneijder, die vindt dat Taylor een realistisch besluit heeft genomen.",
      "publishedAt": "2026-01-08T19:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal v Liverpool: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/08/arsenal-v-liverpool-premier-league-live",
      "summary": "⚽ Premier League updates from the 8pm GMT kick-off ⚽ Live scores | Table | Football Daily | Follow us on Bluesky Arne Slot has said it hurts his principles as an attacking coach to hear his Liverpool team described as boring but he could not entirely disagree on current form. Liverpool have stabilised after a damaging sequence of nine defeats in 12 matches, the club’s worst return in 71 years, with a nine-game unbeaten run but are struggling to produce convincing performances. Successive draws against Fulham and Leeds have prompted further criticism of Slot’s style and resulted in the champions falling 14 points behind the leaders, Arsenal, who they face at the Emirates Stadium on Thursday. Continue reading...",
      "publishedAt": "2026-01-08T19:14:13.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Koke zet tegen Real Madrid derby-record op zijn naam",
      "link": "https://www.vi.nl/video/koke-zet-tegen-real-madrid-derby-record-op-zijn-naam",
      "summary": "Atlético Madrid-aanvoerder Koke staat op het punt om Spaanse voetbalgeschiedenis te schrijven. De middenvelder kan donderdagavond de speler met de meeste Madrileense derby's achter zijn naam worden. Koke deelt dat record momenteel met Real Madrid-icoon Sergio Ramos. Hij houdt zich er naar eigen zeggen niet zo mee bezig.",
      "publishedAt": "2026-01-08T19:08:51.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Hecke legt Haaland het vuur opnieuw aan de schenen: 'Leuk voor de fans'",
      "link": "https://www.vi.nl/nieuws/van-hecke-legt-haaland-het-vuur-opnieuw-aan-de-schenen-leuk-voor-de-fans",
      "summary": "Jan Paul van Hecke geniet van spelen tegen Erling Haaland. De 25-jarige Oranje-international vocht woensdagavond weer de nodige duels uit met de Noorse spits. 'Er werd wel hard gestreden, ja.'",
      "publishedAt": "2026-01-08T19:06:40.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Valverde schiet Real Madrid binnen een minuut prachtig op 0-1 in derby",
      "link": "https://www.vi.nl/nieuws/vi-live-valverde-schiet-real-madrid-binnen-een-minuut-prachtig-op-0-1-in-derby",
      "summary": "Voetballiefhebbers kunnen hun vingers donderdag weer aflikken. Zo speelt het Liverpool van Arne Slot in de Premier League tegen koploper Arsenal, staan Atlético en Real Madrid tegenover elkaar in de halve finale van de Spaanse Supercopa en strijden Paris Saint-Germain en Olympique Marseille om de Franse Supercup. Volg alles in de VI Live.",
      "publishedAt": "2026-01-08T19:04:20.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Trinity Rodman headlines USWNT Jan. camp roster",
      "link": "https://www.espn.com/soccer/story/_/id/47550378/rodman-headlines-usa-jan-camp-roster-paraguay-chile",
      "summary": "Forward Trinity Rodman, who is out of contract with a club, will join the United States women's national team in training camp later this month for the first time since April 2025.",
      "publishedAt": "2026-01-08T18:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Mourinho on shock loss: I hope players don't sleep",
      "link": "https://www.espn.com/soccer/story/_/id/47548211/jose-mourinho-hopes-benfica-players-sleep-braga-loss",
      "summary": "An angry Benfica coach Jose Mourinho hopes his players had a sleepless night after their shock defeat to Braga in the Portuguese Allianz Cup semifinal on Wednesday.",
      "publishedAt": "2026-01-08T18:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs boss backs Romero after IG post 'mistake'",
      "link": "https://www.espn.com/soccer/story/_/id/47549498/tottenham-thomas-frank-defends-cristian-romero-social-media-mistake",
      "summary": "Tottenham Hotspur manager Thomas Frank has defended captain Cristian Romero after a social media post where he accused people at the club of telling \"lies.\"",
      "publishedAt": "2026-01-08T18:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Source: Minnesota boss Ramsay set for West Brom",
      "link": "https://www.espn.com/soccer/story/_/id/47551227/minnesota-united-coach-eric-ramsay-west-brom-manager",
      "summary": "Minnesota United head coach Eric Ramsay is set to join English Championship side West Bromwich Albion, a source has confirmed to ESPN.",
      "publishedAt": "2026-01-08T18:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior unready to coach Chelsea loss at Fulham",
      "link": "https://www.espn.com/soccer/story/_/id/47540904/liam-rosenior-not-ready-coach-chelsea-fulham",
      "summary": "Liam Rosenior chose not to take charge of Chelsea for the first time in Wednesday's Premier League clash against Fulham because of the \"difficult time-frame\" between his appointment on Tuesday and the game at Craven Cottage.",
      "publishedAt": "2026-01-08T18:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "USA midfielder Sam Coffey in talks to join Manchester City from Portland Thorns",
      "link": "https://www.theguardian.com/football/2026/jan/08/sam-coffey-manchester-city-portland-thorns-transfer-talks-uswnt-midfielder",
      "summary": "Midfielder given permission to fly to England Transfer talks behind her omission from USA squad Manchester City are in advanced talks to sign the United States midfielder Sam Coffey from Portland Thorns, the Guardian understands. The 27-year-old has been granted permission to fly to Manchester to try to finalise the move, which multiple sources have said is close to completion, and could give City a big boost in their quest to win a first Women’s Super League title since 2016. Continue reading...",
      "publishedAt": "2026-01-08T18:19:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Beaton in prime position for PDC Tour Card after quarter-final run at Q-School",
      "link": "https://www.skysports.com/darts/news/12040/13492119/steve-beaton-in-prime-position-to-regain-pdc-tour-card-after-quarter-final-run-at-q-school",
      "summary": "Steve 'The Adonis' Beaton is in prime position to regain his PDC Tour Card following a superb run to quarter-finals at UK Q-School on Thursday.",
      "publishedAt": "2026-01-08T18:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Aanhoudende zorgen en hoopvolle ontwikkelingen bij Fortuna Sittard",
      "link": "https://www.vi.nl/pro/aanhoudende-zorgen-en-hoopvolle-ontwikkelingen-bij-fortuna-sittard",
      "summary": "Op een paar uitzonderingen na die juist net in een flow waren geraakt, haalden de Eredivisie-clubs op het tandvlees de winterstop. Veel tijd om weer op adem te komen, hebben ze alleen niet, want dit weekeinde begint het hele circus alweer. In aanloop naar het cruciale deel van het seizoen maken we bij elke club de balans op, waarbij we wat de volgorde betreft uitgaan van de eerste speelronde van 2026. Deze keer: Fortuna Sittard.",
      "publishedAt": "2026-01-08T18:02:52.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No Ekitike for Liverpool at league leaders Arsenal LIVE!",
      "link": "https://www.skysports.com/football/arsenal-vs-liverpool/live/531329",
      "summary": "",
      "publishedAt": "2026-01-08T18:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sutton's FA Cup third-round predictions v DJ and producer Shadow Child",
      "link": "https://www.bbc.com/sport/football/articles/cvg5ldyz606o?at_medium=RSS&at_campaign=rss",
      "summary": "BBC Sport football expert Chris Sutton takes on DJ and producer Shadow Child - and AI - with his predictions for all 32 FA Cup third-round ties.",
      "publishedAt": "2026-01-08T17:55:15.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘I hope they don’t sleep’: José Mourinho turns on Benfica players after cup loss",
      "link": "https://www.theguardian.com/football/2026/jan/08/jose-mourinho-benfica-braga-league-cup-seixal",
      "summary": "Players will stay at club’s Seixal training ground Benfica lost 3-1 to Braga in League Cup semi-finals José Mourinho has turned on his Benfica players after the team’s 3-1 defeat by Braga in the Portuguese League Cup semi-finals, suggesting that the squad would be staying at the club’s Seixal training base until further notice. “The players will sleep in Seixal, and on Thursday there is training, and the day after there will be training,” Mourinho said at his post-match press conference. “When we arrive in Seixal, everyone will go to their rooms.” Continue reading...",
      "publishedAt": "2026-01-08T17:39:16.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Celebrating the Premier League’s unbridled wildness and joyous puerility",
      "link": "https://www.theguardian.com/football/2026/jan/08/football-daily-newsletter-premier-league-drama",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! There’s been much talk in recent years about moving Premier League games to various parts of the world that do not boast Premier League teams – Sheffield, Miami and so on – with the stated aim of spreading the gospel, had the gospel been stolen from Jesus and the Four Evangelists, to be bastardised and defiled, to be converted into folding green and then into geopolitical power and influence. By way of total non-sequitur, this year’s Geopolitics World Cup will be held in Donald Trump’s America. There was, of course, much anger at this ludicrous plan for many righteous reasons, then we all got back to enjoying the football as the ignoramiti knew we would, the game too chaotically, joyously puerile and affirming for its own and our own good. How can we possibly excise it from our souls when it bestows upon us the unbridled wildness of Wednesday’s behaviour, as it also did during the last round of midweek fixtures? The campaign for a fully night-time Premier League begins here. Continue reading...",
      "publishedAt": "2026-01-08T16:49:36.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Dolphins fire head coach McDaniel",
      "link": "https://www.skysports.com/nfl/news/12040/13492118/mike-mcdaniel-miami-dolphins-fire-head-coach-after-four-seasons-as-nfl-coaching-vacancies-rise-to-eight",
      "summary": "Mike McDaniel has become the NFL's latest postseason coaching casualty after he was relieved of his duties by the Miami Dolphins.",
      "publishedAt": "2026-01-08T16:03:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The PL players free to negotiate a transfer with foreign clubs in January",
      "link": "https://www.skysports.com/football/news/12040/13467920/premier-league-free-transfers-marc-guehi-bernardo-silva-and-ibrahima-konate-could-leave-for-free-next-summer",
      "summary": "A number of Premier League stars have entered the final six months of their deals and can now negotiate pre-contract agreements with foreign clubs.",
      "publishedAt": "2026-01-08T16:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'A gift I can't repay' - McDonald on playing with brother's kidney",
      "link": "https://www.bbc.com/sport/football/articles/cgkep218r30o?at_medium=RSS&at_campaign=rss",
      "summary": "Five years after receiving a kidney from his brother, Exeter midfielder Kevin McDonald is preparing to face Manchester City in the FA Cup.",
      "publishedAt": "2026-01-08T14:42:18.000Z"
    }
  ]
}