{
  "generatedAt": "2026-01-03T07:22:03.091Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Liverpool wil contract van Gravenberch openbreken'",
      "link": "https://www.vi.nl/nieuws/west-ham-united-legt-23-miljoen-euro-op-tafel-voor-nieuwe-spits",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-03T07:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bosz rekende op vertrek Veerman, nu staat hij (in het donker) op PSV-veld",
      "link": "https://www.vi.nl/pro/bosz-rekende-op-vertrek-veerman-nu-staat-hij-in-het-donker-op-psv-veld",
      "summary": "PSV is begonnen aan het kalenderjaar 2026. Hoe precies? Met Joey Veerman (geen transfer) en Ibi Afellay (nieuwe assistent) binnen de gelederen. Maar ook: met uren vertraging op het vliegveld van Eindhoven en een pikdonker en dus onbespeelbaar veld in Marbella later op de vrijdagavond.",
      "publishedAt": "2026-01-03T07:07:44.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: de dag van de Old Firm en de Catalaanse derby",
      "link": "https://www.vi.nl/nieuws/vi-live-de-dag-van-de-old-firm-en-de-catalaanse-derby",
      "summary": "In deze VI Live volgen we de hoogtepunten in verschillende competities. Met onder meer aandacht voor Celtic - Rangers FC, AFC Bournemouth - Arsenal en Espanyol - Barcelona.",
      "publishedAt": "2026-01-03T07:01:30.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Today on Sky Sports Racing: Westcombe looks to complete hat-trick at Lingfield",
      "link": "https://www.skysports.com/racing/news/12040/13489479/today-on-sky-sports-racing-lingfield-newcastle-and-southwell-feature-live-on-saturday",
      "summary": "We have a busy day’s racing on Saturday with action from Lingfield, Newcastle and Southwell live on Sky Sports Racing...",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'No coasting' and no selfishness from England in 'huge' final Ashes Test",
      "link": "https://www.skysports.com/cricket/news/12040/13489832/the-ashes-england-captain-ben-stokes-says-final-test-vs-australia-in-sydney-is-huge-despite-series-already-being-lost",
      "summary": "England captain Ben Stokes vowed there will be let up from his side in a \"huge\" final Ashes Test in Sydney as they aim to leave Australia with a narrow 3-2 defeat.",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Will Steelers vs Ravens be Rodgers' final game in the NFL?",
      "link": "https://www.skysports.com/nfl/news/12040/13489655/aaron-rodgers-retirement-decision-looms-as-pittsburgh-steelers-face-baltimore-ravens-in-nfl-playoff-decider",
      "summary": "Aaron Rodgers has often alluded to being on the 'back nine' of his NFL career in recent years. There is a sense he could be strolling up the fairway to putt at the 18th this weekend.",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De Feyenoorder die hardop over een carrière als darter droomde",
      "link": "https://www.vi.nl/pro/de-feyenoorder-die-hardop-over-een-carri-re-als-darter-droomde",
      "summary": "Voetbal International zit al ruim zes decennia boven op het voetbal. Elke dag van het weekeinde publiceren we een onvergetelijk verhaal uit ons archief. Ditmaal reizen we met de VI-Tijdmachine naar eind 2015. Speciaal voor de finale van het World Darts Championship in het Londense Alexandra Palace: Feyenoord-middenvelder Lex Immers die zijn eigen dartstoernooi bestiert, het The Hague Championship. En daar blijft het niet bij. ‘Net zo’n goede darter worden als mijn idool Raymond van Barneveld, dat is mijn droom.’",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Blackburn to Barcelona - Dolan's 'unbelievable' journey",
      "link": "https://www.bbc.com/sport/football/articles/cwy1wn866y5o?at_medium=RSS&at_campaign=rss",
      "summary": "Five years ago, Tyrhys Dolan was playing for Clitheroe - now he is preparing to face Barcelona in the Catalan derby.",
      "publishedAt": "2026-01-03T06:46:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "I’m the ‘miracle’ woken from a coma by Kenny Dalglish after Hillsborough. And now I’ve met him again",
      "link": "https://www.theguardian.com/football/2026/jan/03/36-years-on-miracle-hillsborough-disaster-survivor-meets-kenny-dalglish-liverpool",
      "summary": "It’s said that you should never meet your heroes, but 36 years after the Liverpool manager sat by my hospital bed, I got to thank our greatest ally Born to a son of Anfield in a Warwickshire village, I grew up geographically remote from my spiritual football home. Emotionally, though, the pull of the boys in red was ever-present: from my first game at Anfield in 1974 to FA Cup final defeat at Wembley in ’77, to witnessing the first of Liverpool’s six European Cups, in Rome, when my first hero, Kevin Keegan, ran Berti Vogts ragged. I cried when Keegan left, but soon a new king was born in my imagination: Kenny Dalglish, that wily, tough, insanely skilful Scot. I travelled the country to follow my team through the peaks and troughs that culminated in the lowest possible low, on 15 April 1989, the day of the FA Cup semi-final between Liverpool and Nottingham Forest. There are many things I remember about Hillsborough, some of which returned to me years, even decades, later. My dad saying: “If it’s a nice day tomorrow, we’ll go.” Ian St John on the end of my hospital bed. My best mate laughing as I struggled to eat a yoghurt. The endless bright white lights of the Royal Hallamshire. The surreal trip to my local hospital in an ancient, drafty ambulance. One thing I don’t remember, though, is meeting my hero. And for good reason. For I’m the “miracle” boy woken by the sound of Kenny’s voice when he spoke at my bedside. Continue reading...",
      "publishedAt": "2026-01-03T06:00:32.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McIlroy's Boston Common earn first TGL win as Thorbjornsen sparkles",
      "link": "https://www.skysports.com/golf/news/12040/13489827/tgl-golf-rory-mcilroys-boston-common-golf-earn-first-win-in-tournament-with-victory-over-justin-roses-los-angeles",
      "summary": "Rory McIlroy's Boston Common Golf finally secured their first TGL victory as Michael Thorbjornsen sparkled in a 7-5 triumph over 2025 semi-finalists Los Angeles.",
      "publishedAt": "2026-01-03T05:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior frontrunner to replace Maresca",
      "link": "https://www.espn.com/soccer/story/_/id/47479925/liam-rosenior-frontrunner-replace-enzo-maresca-chelsea-sources",
      "summary": "Strasbourg boss Liam Rosenior is the leading candidate to succeed Enzo Maresca as Chelsea head coach, sources have told ESPN.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep denies Maresca, City links: 'I have a contract'",
      "link": "https://www.espn.com/soccer/story/_/id/47481706/pep-guardiola-denies-enzo-maresca-man-city-links-contract",
      "summary": "Pep Guardiola has reiterated his desire to stay on at Manchester City amid fresh rumours surrounding Enzo Maresca.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Neymar hint about next contract teased",
      "link": "https://www.espn.com/soccer/story/_/id/47480654/neymar-hint-next-contract-teased-social-media",
      "summary": "Santos have indicated that Neymar will be with the club until the end of the year.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Sterling keen on permanent Chelsea exit",
      "link": "https://www.espn.com/soccer/story/_/id/47482059/raheem-sterling-keen-permanent-chelsea-exit-amid-west-ham-fulham-interest-sources",
      "summary": "Raheem Sterling is prioritising a permanent move away from Chelsea this month amid interest from West Ham and Fulham, sources have told ESPN.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Laurens' weekend preview: Maresca-less Chelsea visit Man City, Barcelona derby, more",
      "link": "https://www.espn.com/soccer/story/_/id/47482083/julien-laurens-weekend-soccer-preview-chelsea-manchester-city-premier-league-barcelona-laliga",
      "summary": "What is Julien Laurens watching this weekend? There's the start of the post-Maresca era at Chelsea as they head to Man City, huge derbies in Scotland and France, and much more.",
      "publishedAt": "2026-01-03T02:36:11.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PSG-fans kunnen voor €800 naar luxe Koeweit-duel, Marseille-aanhang blijft thuis",
      "link": "https://www.vi.nl/nieuws/psg-fans-kunnen-voor-800-naar-luxe-koeweit-duel-marseille-aanhang-blijft-thuis",
      "summary": "In Frankrijk is er veel te doen om de Franse Supercup (Trophée des Champions). Deze wedstrijd wordt namelijk in Koeweit gespeeld. Het zorgt voor veel aversie én een gekleurd decor. De fans van Paris Saint-Germain krijgen de kans op een luxe all-inclusive reis, terwijl die van Olympique Marseille thuisblijven.",
      "publishedAt": "2026-01-02T22:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Thomas Frank admits ‘it’s difficult to enjoy’ being Tottenham head coach",
      "link": "https://www.theguardian.com/football/2026/jan/02/thomas-frank-admits-its-difficult-to-enjoy-being-tottenham-head-coach",
      "summary": "Frank likens challenges at Spurs to running a marathon Tottenham booed off after goalless draw at Brentford Thomas Frank has admitted he is not enjoying his job at Tottenham. The head coach is dealing with numerous problems as he navigates what always stood to be a transitional season, the most insistent being his team’s lack of creativity. Spurs were booed off after Thursday’s 0-0 draw at Brentford by the travelling support, who also chanted “boring, boring Tottenham”. But Frank is confident he will come to look back on the first half of his debut campaign more fondly once – and not if – his squad emerges on the other side, stronger and wiser for the suffering. Tottenham are 12th in the Premier League – their next game is at home to Sunderland on Sunday and Frank leant into a marathon-running analogy when he was asked whether he was enjoying the challenge to which he has signed up. Continue reading...",
      "publishedAt": "2026-01-02T22:30:20.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Nancy leaps to his own defence as he feels Old Firm heat'",
      "link": "https://www.bbc.com/sport/football/articles/czx3dqxl769o?at_medium=RSS&at_campaign=rss",
      "summary": "Just over four weeks on from his appointment as Celtic manager, Wilfried Nancy's passionate defence of his reign shows the pressure he is facing before Saturday's Old Firm derby against Rangers.",
      "publishedAt": "2026-01-02T22:00:17.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sutton's predictions v singer-songwriter & Newcastle fan Andrew Cushin",
      "link": "https://www.bbc.com/sport/football/articles/cddg40qzqmjo?at_medium=RSS&at_campaign=rss",
      "summary": "BBC Sport football expert Chris Sutton takes on singer-songwriter & Newcastle fan Andrew Cushin - and AI - with his predictions for this week's Premier League fixtures.",
      "publishedAt": "2026-01-02T18:32:56.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Another year, another manager – but it is unfair to paint Chelsea’s project as a flop | Jacob Steinberg",
      "link": "https://www.theguardian.com/football/2026/jan/02/chelsea-enzo-maresca-liam-rosenior-analysis",
      "summary": "Enzo Maresca got the sack because of his actions. That does not mean the club’s structure needs a complete overhaul Some clubs build around their manager. Eddie Howe is hugely influential at Newcastle and Aston Villa are pretty much Unai Emery FC these days. Chelsea, though, have adopted an alternative model. They have a team of five sporting directors, led by Paul Winstanley and Laurence Stewart, and do not want one person to hold all the power. Yet the question many are asking in the wake of Enzo Maresca’s demise is whether the template will yield success at the very highest level. It is never quiet at Chelsea. They are often busy in the transfer market, meaning there is an element of players coming and going, and they are now looking for their fifth permanent head coach since a consortium led by Todd Boehly and Clearlake Capital, a private equity firm run by Behdad Eghbali and José E Feliciano, bought the club from Roman Abramovich in 2022. Continue reading...",
      "publishedAt": "2026-01-02T18:21:21.000Z"
    }
  ]
}