{
  "generatedAt": "2026-01-10T04:36:17.134Z",
  "items": [
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham hail 'special' cup win in front of Reynolds",
      "link": "https://www.espn.com/soccer/story/_/id/47564201/wrexham-fa-cup-ryan-reynolds-nottingham-forest",
      "summary": "Wrexham manager Phil Parkinson hailed their \"special\" FA Cup giant-killing triumph over the Premier League's Nottingham Forest and expressed his delight that the Welsh club's movie star owner Ryan Reynolds was there to see it.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "San Diego working on exit of Mexico star Lozano",
      "link": "https://www.espn.com/soccer/story/_/id/47562938/san-diego-fc-hirving-chucky-lozano-transfer-mexico",
      "summary": "San Diego FC said Friday they were working on the exit of Mexico international Hirving Lozano.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior: Chelsea can equal United's 'class of 92'",
      "link": "https://www.espn.com/soccer/story/_/id/47562611/liam-rosenior-chelsea-emulate-man-united-class-92",
      "summary": "Liam Rosenior believes Chelsea can emulate Manchester United's fabled 'Class of '92' as they pursue a policy of targeting silverware with young players.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Interim boss Fletcher in dark over Man Utd plans",
      "link": "https://www.espn.com/soccer/story/_/id/47561062/darren-fletcher-dark-man-united-manager-plans-no-conversations",
      "summary": "Darren Fletcher says he's in the dark over Manchester United's plans for his future as he prepares to take charge of his second game as caretaker boss.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham's story 'written in the stars, literally'",
      "link": "https://www.bbc.com/sport/football/articles/cj0nz85nplpo?at_medium=RSS&at_campaign=rss",
      "summary": "Wrexham's remarkable rise continues by knocking Premier League side Nottingham Forest out of the FA Cup in dramatic fashion.",
      "publishedAt": "2026-01-10T00:03:16.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Unacceptable to the badge' - Dyche fumes at FA Cup exit",
      "link": "https://www.bbc.com/sport/football/articles/c4g4rqgqe0jo?at_medium=RSS&at_campaign=rss",
      "summary": "Sean Dyche calls for some of his Nottingham Forest players to \"have a look in the mirror\" after an \"unacceptable\" first-half performance in their FA Cup loss at Wrexham on penalties.",
      "publishedAt": "2026-01-09T23:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Papers: Arsenal and Man City to battle for Livramento this summer",
      "link": "https://www.skysports.com/football/news/12040/13492676/arsenal-and-man-city-to-battle-for-newcastles-tino-livramento-this-summer-paper-talk-and-football-transfer-gossip",
      "summary": "The top stories and transfer rumours from Saturday's newspapers...",
      "publishedAt": "2026-01-09T23:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Pocognoli en AS Monaco zijn het even flink kwijt: 'Het bestuur staat achter me'",
      "link": "https://www.vi.nl/nieuws/pocognoli-en-as-monaco-zijn-het-even-flink-kwijt-het-bestuur-staat-achter-me",
      "summary": "Sébastien Pocognoli kwam met hoge verwachtingen binnen bij AS Monaco, maar moet nu al zijn eerste brandje blussen. De club presteert slecht en won er van de afgelopen zeven competitiewedstrijden slechts één.",
      "publishedAt": "2026-01-09T22:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Goalkeeper Okonkwo is the hero as Wrexham shock Nottingham Forest in FA Cup shootout",
      "link": "https://www.theguardian.com/football/2026/jan/09/wrexham-nottingham-forest-fa-cup-third-round-match-report",
      "summary": "North Americans have rarely been fans of draws in sport, so the unscripted FA Cup drama of seeing Arthur Okonkwo take a starring role in a penalty shootout after Wrexham were pegged back in the final minute of normal time must have brought joy to co-owner Ryan Reynolds in the stands. The club the Hollywood actor invested in were just about underdogs against Premier League Nottingham Forest in a game that included numerous plot twists, only to provide the romantic ending the majority wanted. The heroic Okonkwo saved from Igor Jesus and Omari Hutchinson in the shootout to ensure James McClean’s miss was irrelevant. It should have been easier for ­Wrexham, who had a two-goal lead at 3-1 before Callum Hudson-Odoi’s double forced extra time on an energy-sapping and freezing night. Continue reading...",
      "publishedAt": "2026-01-09T22:34:48.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘I’ll make the decisions’: Liam Rosenior confident he will be in control at Chelsea",
      "link": "https://www.theguardian.com/football/2026/jan/09/ill-make-the-decisions-liam-rosenior-confident-he-will-be-in-control-at-chelsea",
      "summary": "Manager takes charge of first game on Saturday in FA Cup ‘It’s not possible to be in this job and not be your own man’ Liam Rosenior is confident he will make the decisions at Chelsea, insisting he would not have agreed to take over as head coach if he doubted his ability to work within the club’s structure. Rosenior, who takes charge of his first game when Chelsea visit Charlton in the FA Cup third round on Saturday night, was appointed after Enzo Maresca left in acrimonious circumstances. Maresca’s position became untenable after a power battle with the Chelsea hierarchy went beyond the point of no return. Continue reading...",
      "publishedAt": "2026-01-09T22:30:40.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Saibari schiet Marokko naar halve finale: 'Het wordt moeilijker en moeilijker'",
      "link": "https://www.vi.nl/nieuws/saibari-schiet-marokko-naar-halve-finale-het-wordt-moeilijker-en-moeilijker",
      "summary": "Ismael Saibari was vrijdagavond van grote waarde voor Marokko. De PSV'er besliste de kwartfinale tegen Kameroen in de slotfase en zo bracht hij zijn land weer iets dichter bij het hoofddoel: voor het oog van de eigen fans de Afrika Cup winnen.",
      "publishedAt": "2026-01-09T22:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham stun Forest on penalties to reach FA Cup fourth round",
      "link": "https://www.skysports.com/football/wrexham-vs-nottingham-forest/report/550883",
      "summary": "Wrexham reached the fourth round of the FA Cup by stunning Premier League Nottingham Forest on penalties after a six-goal thriller at the Racecourse Ground.",
      "publishedAt": "2026-01-09T22:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Nieuw hoofdstuk Wrexham-sprookje: Hollywoodclub knikkert Nottingham uit FA Cup",
      "link": "https://www.vi.nl/nieuws/nieuw-hoofdstuk-wrexham-sprookje-hollywoodclub-knikkert-nottingham-uit-fa-cup",
      "summary": "Wrexham blijft een verhaal dat zelfs in Hollywood ongeloofwaardig klinkt. Vrijdagavond versloeg de club van eigenaren en Hollywood-sterren Ryan Reynolds en Rob McElhenney Nottingham Forest in de derde ronde van de FA Cup. Daar had het strafschoppen voor nodig, nadat het in de reguliere speeltijd lange tijd al op weg leek naar een overwinning.",
      "publishedAt": "2026-01-09T22:13:30.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "O'Sullivan pulls out of Masters on medical grounds",
      "link": "https://www.skysports.com/snooker/news/12040/13492660/ronnie-osullivan-eight-time-masters-snooker-champion-pulls-out-of-2026-tournament-on-medical-grounds",
      "summary": "Ronnie O'Sullivan has pulled out of the Masters on medical grounds for the second year in a row.",
      "publishedAt": "2026-01-09T22:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Dortmund geeft Bayern kans verder uit te lopen na spectaculaire pot",
      "link": "https://www.vi.nl/nieuws/dortmund-geeft-bayern-kans-verder-uit-te-lopen-na-spectaculaire-pot",
      "summary": "Borussia Dortmund heeft vrijdagavond een pas op de plaats gemaakt in de Duitse titelrace. Een spectaculaire wedstrijd tegen Eintracht Frankfurt eindigde in een remise. Bayern krijgt daardoor de kans om de marge te vergroten naar tien punten.",
      "publishedAt": "2026-01-09T21:39:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Morocco sail into Afcon semi-finals as Díaz sparks fine win over Cameroon",
      "link": "https://www.theguardian.com/football/2026/jan/09/cameroon-morocco-africa-cup-of-nations-quarter-final-match-report",
      "summary": "At last, Morocco have arrived at the tournament they are hosting. For four games they had played scratchy, crabbed football. Finally, in a spiky, ill-tempered quarter-final, there was something more like the Morocco that reached the semi-finals of the World Cup two years ago. If the game wasn’t fluent, that was largely Cameroon’s doing as they spoiled and delayed and sought treatment for injuries. But the hosts, for the most part, retained their cool, protecting a lead earned with verve in the first half with maturity in the second. In previous games, Morocco had looked tense, limbs leadened by the expectation of a country that last won the Cup of Nations 50 years ago and that has spent a vast amount on football-related infrastructure as it prepares to co-host the 2030 World Cup. The coach, Walid Regragui, was even booed in the last-16 victory over Tanzania, his football deemed overly cautious despite a record of only four defeats in his 46 games as national coach before this quarter-final. “I always say that we are a family,” said Regragui. “Even if many people don’t believe in us or in me … that’s OK. We play for the country and for the supporters who want to see Morocco at the top.” Continue reading...",
      "publishedAt": "2026-01-09T21:25:21.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Marokko voor het eerst in 22 jaar naar halve finale Afrika Cup",
      "link": "https://www.vi.nl/nieuws/vi-live-brahim-d-az-schiet-marokko-op-voorsprong-tegen-kameroen",
      "summary": "Na een onderbreking van ruim twee weken wordt vrijdag eindelijk de Eredivisie weer hervat. Om 20.00 uur staan NEC en FC Utrecht tegenover elkaar. Daarnaast speelt Marokko op dat tijdstip de kwartfinale van de Afrika Cup tegen Kameroen en wordt er gespeeld in de Keuken Kampioen Divisie. Volg alles in de VI Live.",
      "publishedAt": "2026-01-09T21:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Edinburgh stage comeback to defeat Gloucester as Bath stay top",
      "link": "https://www.skysports.com/rugby-union/news/12040/13492633/champions-cup-edinburgh-deny-gloucester-in-comeback-victory-as-bath-beat-castres-to-close-on-winning-pool-two",
      "summary": "Edinburgh staged a second-half comeback to pick up a hard-fought 26-24 win over Gloucester in the Champions Cup and consigned the visitors to a fifth straight defeat.",
      "publishedAt": "2026-01-09T20:44:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Solskjaer set for face-to-face talks with Man Utd chiefs",
      "link": "https://www.bbc.com/sport/football/articles/cx2kg8djv7jo?at_medium=RSS&at_campaign=rss",
      "summary": "Ole Gunnar Solskjaer is set for face-to-face talks with Manchester United chiefs about becoming the club's interim boss.",
      "publishedAt": "2026-01-09T19:33:47.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Reyes secures PDC Tour return while new names earn first cards",
      "link": "https://www.skysports.com/darts/news/12040/13492575/pdc-tour-q-school-cristo-reyes-secures-return-after-five-years-while-two-debutants-to-join-professional-circuit",
      "summary": "Cristo Reyes and Jeffrey Sparidaans secured PDC Tour returns, while Ireland's Niall Culleton and England's Carl Sneyd won cards for the first time, on the second day at the final stage of the PDC's Qualifying Schools.",
      "publishedAt": "2026-01-09T17:44:00.000Z"
    }
  ]
}