{
  "generatedAt": "2026-01-08T15:30:15.062Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Timber wijst winterse overstap naar Lazio af",
      "link": "https://www.vi.nl/nieuws/timber-wijst-winterse-overstap-naar-lazio-af",
      "summary": "Lazio heeft zich deze week officieel gemeld bij Feyenoord voor Quinten Timber. De 24-jarige middenvelder beschikt over een aflopend contract in De Kuip.",
      "publishedAt": "2026-01-08T15:11:48.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Joël Piroe jaagt Surinaamse WK-droom na: 'Henk ten Cate zette me aan het denken'",
      "link": "https://www.vi.nl/pro/jo-l-piroe-jaagt-surinaamse-wk-droom-na",
      "summary": "In de jacht op een WK-ticket kan Suriname in maart beschikken over Joël Piroe (26). De spits van Leeds United hoopte zich dit seizoen in de kijker te spelen bij Ronald Koeman, maar werd deze week overtuigd door Henk ten Cate. ‘Ik zag een twinkeling in de ogen van mijn vader.’",
      "publishedAt": "2026-01-08T15:00:01.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Piroe zet Oranje uit zijn hoofd en wil met Suriname naar WK",
      "link": "https://www.vi.nl/nieuws/piroe-zet-oranje-uit-zijn-hoofd-en-wil-met-suriname-naar-wk",
      "summary": "Joël Piroe gaat uitkomen voor Suriname. Dat heeft de 26-jarige spits van Leeds United donderdag bekendgemaakt. De voormalig Nederlands jeugdinternational was al een tijdje in beeld bij De Natio als beoogde international.",
      "publishedAt": "2026-01-08T15:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'A gift I can't repay' - McDonald on playing with brother's kidney",
      "link": "https://www.bbc.com/sport/football/articles/cgkep218r30o?at_medium=RSS&at_campaign=rss",
      "summary": "Five years after receiving a kidney from his brother, Exeter midfielder Kevin McDonald is preparing to face Manchester City in the FA Cup.",
      "publishedAt": "2026-01-08T14:42:18.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Mourinho hard voor spelers na bekeruitschakeling: 'Hoop dat ze niet slapen'",
      "link": "https://www.vi.nl/nieuws/mourinho-hard-voor-spelers-na-bekeruitschakeling-hoop-dat-ze-niet-slapen",
      "summary": "José Mourinho heeft op zijn eigen manier gereageerd op de uitschakeling in de Portugese beker. De Benfica-trainer heeft een trainingskamp op Madeira ingelast en hoopt dat zijn spelers in de aanloop naar de topper tegen FC Porto een nachtje 'weinig slapen'.",
      "publishedAt": "2026-01-08T14:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "US actions in Venezuela put the 2026 World Cup in disgraceful company | Leander Schaerlaeckens",
      "link": "https://www.theguardian.com/football/2026/jan/08/usa-world-cup-2026-venezuela",
      "summary": "In 1934 and 1978, Fifa’s big event was given over to authoritarian aims. There’s no more doubt that 2026 will be the same By 1934, it was entirely evident what Benito Mussolini was up to. Italy’s dictator had already consolidated power, colonized Libya and annexed the city of Rijeka. He nevertheless got to stage the second-ever World Cup, managing it with a heavy hand and even supplanting the Jules Rimet trophy with a far larger one. Hosting and winning that World Cup didn’t sate his expansionist appetites. By the end of decade, Mussolini would take Ethiopia, annex Albania and back Francisco Franco in the Spanish civil war. It was equally well established in 1978 in Argentina that General Jorge Rafaél Videla’s military junta, which had taken over two years earlier, was maintaining its grip on power through systematic detention, torture and murder. Still, protestations from other nations were ignored and the World Cup kicked off. Leander Schaerlaeckens’ book on the United States men’s national soccer team, The Long Game, is out on May 12. You can preorder it here. He teaches at Marist University. Continue reading...",
      "publishedAt": "2026-01-08T14:21:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Selectie Nigeria dreigt met boycot richting kwartfinale Afrika Cup'",
      "link": "https://www.vi.nl/nieuws/opnieuw-onrust-bij-nigeria-door-conflict-over-wedstrijdpremies",
      "summary": "Nigeria kent een onrustige aanloop naar de kwartfinale op de Afrika Cup van komende zaterdag tegen Algerije. De selectie dreigt de training te boycotten en mogelijk zelgs niet naar Marrakech af te reizen, als ze de beloofde premies niet ontvangen.",
      "publishedAt": "2026-01-08T14:06:57.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester United pulled off a coup by signing Lea Schüller – so what will she bring?",
      "link": "https://www.theguardian.com/football/2026/jan/08/manchester-united-pulled-off-a-coup-by-signing-lea-schuller-so-what-will-she-bring",
      "summary": "‘She has everything to be a world-class striker – fast, two great feet, good with the head and strong,’ says the coach who set the forward’s career rolling Since they were promoted to the Women’s Super League in 2019, no Manchester United player has managed to score more than 10 league goals in a single season. In Lea Schüller they have signed someone who has surpassed that mark seven seasons in a row in Germany’s Frauen Bundesliga, so it is easy to understand why United are so enamoured with their new striker. With a formidable 54 goals in 82 internationals, the Germany forward arrives at Carrington with a prolific record and the match-winner profile the club have been craving. At 28 years old she could spend the best years of her career at United, where she has signed a contract until June 2029. Continue reading...",
      "publishedAt": "2026-01-08T14:03:47.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I'm above average intelligence' - Frank backs himself to improve Spurs situation",
      "link": "https://www.skysports.com/football/news/12040/13492058/thomas-frank-tottenham-head-coach-believes-he-has-done-enough-to-deserve-more-time-in-charge-of-club",
      "summary": "Thomas Frank believes he has earned the right to have more time in charge at Tottenham as the pressure continues to mount on the head coach.",
      "publishedAt": "2026-01-08T13:44:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "What is Man Utd's 'DNA' and does it really matter?",
      "link": "https://www.bbc.com/sport/football/articles/cx2xe6lg1r7o?at_medium=RSS&at_campaign=rss",
      "summary": "As Manchester United look for Ruben Amorim's successor, Phil McNulty asks if a club's so-called \"DNA\" is actually relevant?",
      "publishedAt": "2026-01-08T13:43:23.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Mourinho on shock loss: I hope players don't sleep",
      "link": "https://www.espn.com/soccer/story/_/id/47548211/jose-mourinho-hopes-benfica-players-sleep-braga-loss",
      "summary": "An angry Benfica coach Jose Mourinho hopes his players had a sleepless night after their shock defeat to Braga in the Portuguese Allianz Cup semifinal on Wednesday.",
      "publishedAt": "2026-01-08T13:35:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs captain Romero in fiery 'lies' post after loss",
      "link": "https://www.espn.com/soccer/story/_/id/47547868/tottenham-captain-cristian-romero-fiery-lies-post-bournemouth-loss",
      "summary": "Tottenham captain Cristian Romero appeared to accuse the club's hierarchy of \"lies\" in a fiery, now-edited social media post following the defeat to Bournemouth.",
      "publishedAt": "2026-01-08T13:35:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior unready to coach Chelsea loss at Fulham",
      "link": "https://www.espn.com/soccer/story/_/id/47540904/liam-rosenior-not-ready-coach-chelsea-fulham",
      "summary": "Liam Rosenior chose not to take charge of Chelsea for the first time in Wednesday's Premier League clash against Fulham because of the \"difficult time-frame\" between his appointment on Tuesday and the game at Craven Cottage.",
      "publishedAt": "2026-01-08T13:35:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sesko: 'Great things' coming with United change",
      "link": "https://www.espn.com/soccer/story/_/id/47549251/benjamin-sesko-great-things-coming-man-united-manager-talks",
      "summary": "Benjamin Sesko believes \"great things are coming\" despite managerless Manchester United's winless start to 2026.",
      "publishedAt": "2026-01-08T13:35:32.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Mourinho makes Benfica players sleep at training ground",
      "link": "https://www.bbc.com/sport/football/articles/c07xzzn3j39o?at_medium=RSS&at_campaign=rss",
      "summary": "Jose Mourinho takes his players to stay at Benfica's training ground after they lose against Braga in the League Cup semi-final.",
      "publishedAt": "2026-01-08T13:35:04.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ex-Premier League ref David Coote gets suspended sentence over schoolboy video",
      "link": "https://www.theguardian.com/uk-news/2026/jan/08/ex-premier-league-ref-david-coote-gets-suspended-sentence-over-schoolboy-video",
      "summary": "Coote, 43, had previously pleaded guilty to making an indecent moving image of a child The former Premier League referee David Coote has been given a suspended sentence after he was found to have a sexual video of a 15-year-old boy in school uniform on his laptop. Judge Shant said Coote, 43, had a “spectacular fall from grace” after police charged him with making a category A video, the most serious kind, of a 15-year-old schoolboy. The charge refers to activities such as downloading, sharing or saving photos or videos containing abuse. Continue reading...",
      "publishedAt": "2026-01-08T12:24:11.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Coote gets suspended prison sentence over child image offence",
      "link": "https://www.skysports.com/football/news/12040/13481819/david-coote-former-premier-league-referee-given-nine-month-suspended-prison-sentence-after-admitting-child-image-offence",
      "summary": "David Coote has been sentenced to nine months in prison, suspended for two years, after pleading guilty to making an indecent image of a child.",
      "publishedAt": "2026-01-08T10:52:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Chiefs aware of domestic violence allegations directed towards Rice",
      "link": "https://www.skysports.com/nfl/news/12040/13491965/nfl-kansas-city-chiefs-aware-of-domestic-violence-allegations-that-appear-to-be-directed-towards-rashee-rice",
      "summary": "The Kansas City Chiefs said in a statement on Wednesday they were aware of domestic violence allegations made in a series of social media posts by a former girlfriend of wide receiver Rashee Rice and had been in communication with the NFL.",
      "publishedAt": "2026-01-08T10:27:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Captain Romero appears to call out Spurs chiefs in edited social media post",
      "link": "https://www.bbc.com/sport/football/articles/c8d04mz2y34o?at_medium=RSS&at_campaign=rss",
      "summary": "Tottenham captain Cristian Romero appears to take aim at the club's hierarchy, accusing them of telling \"lies\" in a since edited Instagram post.",
      "publishedAt": "2026-01-08T10:15:13.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘The club is in a mess’: Manchester United fans voice feelings before the next interim twist",
      "link": "https://www.theguardian.com/football/2026/jan/08/manchester-united-fans-interim-solskjaer-carrick-fletcher-protest-burnley",
      "summary": "Supporters serenaded Solskjær, Carrick and Fletcher among others at Burnley and staged a brief anti-Ratcliffe protest “Jim can’t fix this,” the sign said. Bright red letters nestled on a white background, a stark contrast in an away end at Turf Moor full of dark-coated figures in front of which they were held aloft. It was small, a couple of square metres of material, maybe. But the message to Sir Jim Ratcliffe was powerful. Remember your lane, Jim? Yeah, stick in it, pal. As Darren Fletcher, in Manchester United blazer and red tie, strolled along the touchline, flanked by tracksuited his former teammate and friend Jonny Evans, the flag flew. And then it was gone. The protest was done. Continue reading...",
      "publishedAt": "2026-01-08T10:06:48.000Z"
    }
  ]
}