{
  "generatedAt": "2026-01-05T08:38:51.491Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Braziliaans doelpuntenkanon dicht bij record na eerste hattrick voor Brentford",
      "link": "https://www.vi.nl/nieuws/braziliaans-doelpuntenkanon-dicht-bij-record-na-eerste-hattrick-voor-brentford",
      "summary": "Igor Thiago is hard op weg om een Braziliaans Premier League-fenomeen te worden. De spits van Brentford leek vorig seizoen volledig te floppen, maar gaat momenteel als een trein. Tegen Everton voltooide Thiago zijn eerste hattrick voor The Bees en die viel voor de Braziliaan op een wel erg gunstig moment.",
      "publishedAt": "2026-01-05T08:26:16.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League: 10 talking points from the weekend’s football",
      "link": "https://www.theguardian.com/football/2026/jan/05/premier-league-10-talking-points-from-the-weekends-football",
      "summary": "Nuno lets a golden opportunity slip, Viktor Gyökeres does everything but score and Benjamin Sesko struggles again Calum McFarlane’s unexpected battle with Pep Guardiola brought back memories of the 2021 League Cup final, when Ryan Mason, Tottenham’s 29-year-old interim coach, faced the significant task of trying to outsmart one of the greatest managers in the game’s history. For Mason there was the added baggage of Spurs’ 13-year trophy drought; for McFarlane, making his senior management debut, it was Chelsea’s astonishingly bad recent record against Manchester City. Four and a half years have passed since Chelsea last beat Guardiola’s side, when Thomas Tuchel’s team triumphed in the Champions League final, and a draw on Sunday took that winless run to 12 matches. But Enzo Fernández’s injury-time equaliser, combining with the midweek upheaval at Stamford Bridge, made it a triumphant point, something Enzo Maresca didn’t achieve against City during his tenure. Taha Hashim Match report: Manchester City 1-1 Chelsea Match report: Fulham 2-2 Liverpool Match report: Bournemouth 2-3 Arsenal Match report: Leeds 1-1 Manchester United Match report: Tottenham 1-1 Sunderland Continue reading...",
      "publishedAt": "2026-01-05T08:00:30.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Africa’s superpowers assemble for Cup of Nations knockout stages",
      "link": "https://www.theguardian.com/football/2026/jan/05/africas-superpowers-assemble-for-cup-of-nations-knockout-stages",
      "summary": "Cameroon and hosts Morocco could soon be joined by Nigeria and Egypt at the business end of the tournament For a decade or more, a familiar theme of Cups of Nations has been how the pyramid of African football has been growing little taller but much broader. African sides came no closer to really challenging at a World Cup, but the range of teams capable of beating the continent’s elite, of getting to the knockout stage of the Cup of Nations, was becoming more diverse. Perhaps, though, a new phase is beginning. It’s dangerous always to read too much into the performance of one side at one tournament, but in Qatar in 2022 Morocco at last broke through the quarter-final barrier and became the first African side to reach a World Cup semi-final. And now, in the Cup of Nations Morocco are hosting, the traditional powers are reasserting themselves. There is yet to be a real surprise in the tournament and, halfway through the round of 16, the prospect is of the highest-powered list of quarter-finalists in history. Continue reading...",
      "publishedAt": "2026-01-05T08:00:30.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Brobbey maakt Sunderland gek: 'Favoriet van de coach en de fans'",
      "link": "https://www.vi.nl/nieuws/brobbey-maakt-sunderland-gek-favoriet-van-de-coach-en-de-fans",
      "summary": "De lokale media in Sunderland zijn lyrisch over Brian Brobbey, die de club zondag een punt bezorgde in het uitduel met Tottenham Hotspur . De ex-spits van Ajax scoorde met een kanonskogel. 'Wat heeft die voetbal je aangedaan, Brian?'",
      "publishedAt": "2026-01-05T07:46:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Farioli zet record neer met FC Porto: 'Het zegt veel over ons'",
      "link": "https://www.vi.nl/nieuws/farioli-zet-record-neer-met-fc-porto-het-zegt-veel-over-ons",
      "summary": "FC Porto begon het jaar uitstekend met een 0-1 overwinning op Santa Clara , die ook nog eens de zestiende in zeventien wedstrijden was. Daarmee heeft de oud-trainer van Ajax een puntenrecord neergezet.",
      "publishedAt": "2026-01-05T07:38:15.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I'm here to be manager, not coach' - but will Amorim survive at Man Utd?",
      "link": "https://www.bbc.com/sport/football/articles/c1m7lmnnev0o?at_medium=RSS&at_campaign=rss",
      "summary": "Ruben Amorim challenges Manchester United's board to let him do his job after Sunday's draw with Leeds, and says he intends to leave in 18 months' time.",
      "publishedAt": "2026-01-05T07:33:15.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Sensatietiener van Bayern doet onhandige uitspraak over Real Madrid",
      "link": "https://www.vi.nl/nieuws/sensatietiener-van-bayern-doet-onhandige-uitspraak-over-real-madrid",
      "summary": "Lennart Karl voetbalde zichzelf razendsnel in het eerste elftal van Bayern München en dat zou voor menig Duits talent een absolute jongensdroom zijn, maar voor de zeventienjarige Karl is er meer. Dit sprak hij bijzonder genoeg uit tijdens een supportersavond van Bayern.",
      "publishedAt": "2026-01-05T07:03:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Analytici zien dat Liverpool klaar is: 'Ze gaan niet meer verrassen'",
      "link": "https://www.vi.nl/nieuws/analytici-zien-dat-liverpool-klaar-is-ze-gaan-niet-meer-verrassen",
      "summary": "In Engeland verwacht men dat Liverpool geen rol van betekenis gaat spelen in de tweede seizoenshelft. Deze uitspraken werden gedaan door analytici na het gelijkspel van het team van Arne Slot tegen Fulham .",
      "publishedAt": "2026-01-05T06:34:31.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior deserves Chelsea chance, says Rooney",
      "link": "https://www.bbc.com/sport/football/articles/cp87nmpk8eko?at_medium=RSS&at_campaign=rss",
      "summary": "Wayne Rooney says Liam Rosenior is as good a coach as he has worked with and deserves the chance to be Chelsea manager.",
      "publishedAt": "2026-01-05T06:09:31.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Steelers beat Ravens for final NFL playoff spot in dramatic finale",
      "link": "https://www.skysports.com/nfl/news/12040/13490552/nfl-pittsburgh-steelers-beat-baltimore-ravens-26-24-to-clinch-afc-north-title-and-final-playoff-place",
      "summary": "Aaron Rodgers threw a go-ahead touchdown pass to Calvin Austin III with 55 seconds left as the Steelers beat the Ravens 26-24 when Baltimore's Tyler Loop missed a 44-yard field goal as time expired, giving Pittsburgh the AFC North title and ending the Ravens' season.",
      "publishedAt": "2026-01-05T06:06:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "NFL playoff picture: Jags, Panthers, Steelers win division titles",
      "link": "https://www.skysports.com/nfl/news/12040/13486008/2025-nfl-playoff-picture-afc-nfc-seedings-schedule-uk-times-and-how-to-watch-on-road-to-super-bowl-lx-at-levis-stadium-in-california",
      "summary": "Which teams have reached the 2025 NFL playoffs? We look at the standings on the road to Super Bowl LX in Santa Clara, California...",
      "publishedAt": "2026-01-05T01:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim’s Manchester United future in balance amid Wilcox transfer tension",
      "link": "https://www.theguardian.com/football/2026/jan/04/ruben-amorim-manchester-united-leeds-premier-league",
      "summary": "Coach believed club would back him in January window Amorim had cast doubt on long-term future at United Ruben Amorim’s future at Manchester United is in the balance, with the head coach’s strained relationship with the director of football, Jason Wilcox, a factor in what is viewed as an unpredictable situation at the club. Amorim believed United were prepared to back him in the January transfer window should a major signing become available but at the moment this has changed, causing him discontent. The 40-year-old is believed to have been informed of this on the authority of Wilcox, who reports to Omar Berrada, the chief executive. Continue reading...",
      "publishedAt": "2026-01-04T23:02:42.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim wants control at Man United, but his outburst could cost him his job",
      "link": "https://www.espn.com/soccer/story/_/id/47499896/amorim-wants-control-man-united-outburst-cost-job",
      "summary": "Manchester United manager Ruben Amorim is frustrated at not being able to choose his transfers himself. But by speaking out, he has put his job in danger.",
      "publishedAt": "2026-01-04T23:02:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "No Maresca, no problem? Chelsea's late draw at Man City a blow for Guardiola & Co.",
      "link": "https://www.espn.com/soccer/story/_/id/47502723/manchester-city-chelsea-premier-league-analysis-reaction-enzo-maresca-enzo-fernandez-calum-mcfarlane",
      "summary": "All signs pointed to a routine Man City win, yet Enzo Fernandez' late goal ensured Chelsea went home happy.",
      "publishedAt": "2026-01-04T23:02:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim hits out: I'm Utd manager, not the coach",
      "link": "https://www.espn.com/soccer/story/_/id/47501012/ruben-amorim-hints-man-united-power-struggle-manager-not-coach",
      "summary": "Ruben Amorim has raised doubts over his future at Manchester United by saying he wants to be the \"manager, not the coach.\"",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior in London, close to Chelsea job",
      "link": "https://www.espn.com/soccer/story/_/id/47503955/liam-rosenior-arrives-london-edges-chelsea-job-enzo-maresca",
      "summary": "Chelsea are moving closer to the appointment of Liam Rosenior as their new head coach after the 41-year-old arrived in London on Sunday, sources have told ESPN.",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "City injuries worry Pep: Gvardiol 'doesn't look good'",
      "link": "https://www.espn.com/soccer/story/_/id/47504035/manchester-city-injuries-concerning-pep",
      "summary": "Pep Guardiola said he has \"concerns\" after a number of defenders suffered injuries in a 1-1 draw with Chelsea in the Premier League on Sunday.",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I don't have a crystal ball' - damaging few days for Man City?",
      "link": "https://www.bbc.com/sport/football/articles/cn9zgd3dqj5o?at_medium=RSS&at_campaign=rss",
      "summary": "Chelsea's stoppage-time equaliser against Manchester City on a freezing Sunday evening at Etihad Stadium felt a monumental moment in the Premier League title race.",
      "publishedAt": "2026-01-04T21:55:35.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liam Rosenior arrives in London to discuss taking over as Chelsea manager",
      "link": "https://www.theguardian.com/football/2026/jan/04/liam-rosenior-arrives-in-london-to-discuss-taking-over-as-chelsea-manager",
      "summary": "Strasbourg manager, 41, to have talks on Monday He could be in place before Wednesday’s game at Fulham Chelsea are closing in on the appointment of Liam Rosenior after the Strasbourg manager flew to London to hold talks over the role. The 41-year-old is due to meet with the west London club on Monday and it is expected that discussions will end with him agreeing to replace Enzo Maresca, who left Stamford Bridge in acrimonious circumstances earlier this. Continue reading...",
      "publishedAt": "2026-01-04T21:27:02.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I was sure it was offside' - why did Wirtz equaliser stand?",
      "link": "https://www.bbc.com/sport/football/articles/cvg173ldgnmo?at_medium=RSS&at_campaign=rss",
      "summary": "Florian Wirtz thought his goal for Liverpool in the 2-2 draw at Fulham was offside - so how did technology allow it to stand?",
      "publishedAt": "2026-01-04T20:26:47.000Z"
    }
  ]
}