{
  "generatedAt": "2026-01-09T20:29:17.192Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Kenneth Taylor vertrekt door de voordeur bij Ajax",
      "link": "https://www.vi.nl/pro/kenneth-taylor-vertrekt-door-de-voordeur-bij-ajax",
      "summary": "Kenneth Taylor vervolgt zijn loopbaan bij Lazio in de Serie A. Het is een moment waar de 23-jarige middenvelder naar uitkeek, maar tegelijkertijd ook tegenop zag: zijn afscheid bij Ajax. Vijftien en een half jaar lang was het zijn thuis en beleefde hij pieken en dalen. Nu wordt alles anders.",
      "publishedAt": "2026-01-09T20:25:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2026-01-09T20:25:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ajax verkoopt Taylor voor miljoenenbedrag aan Lazio",
      "link": "https://www.vi.nl/nieuws/ajax-verkoopt-taylor-voor-miljoenenbedrag-aan-lazio-bevestiging",
      "summary": "Kenneth Taylor lijkt zijn laatste wedstrijd voor Ajax te hebben gespeeld. De 23-jarige middenvelder, wiens contract in 2027 afloopt, heeft zijn jawoord gegeven aan Lazio. Alleen de medische keuring staat een overstap naar de Serie A-club in de weg.",
      "publishedAt": "2026-01-09T20:22:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Iñigo Martínez krijgt lachers op zijn hand na vraag over Barça-terugkeer",
      "link": "https://www.vi.nl/nieuws/i-igo-mart-nez-krijgt-lachers-op-zijn-hand-na-vraag-over-bar-a-terugkeer",
      "summary": "Dat Barcelona sinds het vertrek van Iñigo Martínez zoekt naar een centrale verdediger, is een publiek geheim. In die zoektocht zou zelfs de Spanjaard zelf op de lijstjes van de Catalanen zijn verschenen. Helaas voor de topclub, zit een terugkeer er niet in, aldus de verdediger zelf.",
      "publishedAt": "2026-01-09T20:20:34.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Cameroon v Morocco: Africa Cup of Nations quarter-final – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/09/cameroon-v-morocco-africa-cup-of-nations-quarter-final-live",
      "summary": "⚽ Afcon updates from the game in Rabat, kick-off 7pm GMT ⚽ Live scores | Read Football Daily | And you can mail Niall 1 min: The hosts, playing in all white, kick off to a raucous reception. El Khannouss appeals hopefully for a penalty after his early cross hits Kotto on the shoulder. The anthems ring out around the Prince Moulay Abdellah Stadium, with the entire crowd belting out the Moroccan anthem. It’s go time! Continue reading...",
      "publishedAt": "2026-01-09T20:19:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham v Nottingham Forest: FA Cup third round – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/09/wrexham-v-nottingham-forest-fa-cup-third-round-live",
      "summary": "⚽ FA Cup third-round latest from the 7.30pm GMT kick-off ⚽ Live scores | Follow us over on Bluesky | And email John Big noise from both sets of fans on a chilly night in what used to be known as Clwyd. Sean Dyche, of course, is wearing shorts as he carries out his pre-match duties. Continue reading...",
      "publishedAt": "2026-01-09T20:19:04.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Bove maakt transfer om ruim jaar na hartstilstand rentree te kunnen maken'",
      "link": "https://www.vi.nl/nieuws/bove-maakt-transfer-om-ruim-jaar-na-hartstilstand-rentree-te-kunnen-maken",
      "summary": "Edoardo Bove staat naar verluidt op het punt om een transfer te maken. De 23-jarige Italiaan kreeg dertien maanden geleden een hartstilstand, maar hoopt spoedig zijn rentree te maken. Aangezien dat niet in Italië kan, lijkt dat bij Watford te moeten gebeuren.",
      "publishedAt": "2026-01-09T19:47:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Villa exploring potential Gallagher signing",
      "link": "https://www.skysports.com/football/news/12040/13492585/aston-villa-transfer-news-conor-gallagher-signing-from-atletico-madrid-being-explored",
      "summary": "Aston Villa are exploring the potential to sign Conor Gallagher from Atletico Madrid.",
      "publishedAt": "2026-01-09T19:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Solskjaer set for face-to-face talks with Man Utd chiefs",
      "link": "https://www.bbc.com/sport/football/articles/cx2kg8djv7jo?at_medium=RSS&at_campaign=rss",
      "summary": "Ole Gunnar Solskjaer is set for face-to-face talks with Manchester United chiefs about becoming the club's interim boss.",
      "publishedAt": "2026-01-09T19:33:47.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City confirms Semenyo signing in $84m deal",
      "link": "https://www.espn.com/soccer/story/_/id/47537480/man-city-transfer-antoine-semenyo-bournemouth-64-million-premier-league",
      "summary": "Manchester City have announced the signing of Antoine Semenyo from Bournemouth.",
      "publishedAt": "2026-01-09T19:33:04.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Saka to sign new five-year deal at Arsenal",
      "link": "https://www.espn.com/soccer/story/_/id/47561059/bukayo-saka-sign-new-five-year-deal-arsenal-sources",
      "summary": "Arsenal have agreed the framework of a new long-term contract with Bukayo Saka, sources have told ESPN.",
      "publishedAt": "2026-01-09T19:33:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Interim boss Fletcher in dark over Man Utd plans",
      "link": "https://www.espn.com/soccer/story/_/id/47561062/darren-fletcher-dark-man-united-manager-plans-no-conversations",
      "summary": "Darren Fletcher says he's in the dark over Manchester United's plans for his future as he prepares to take charge of his second game as caretaker boss.",
      "publishedAt": "2026-01-09T19:33:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Viní taunts Simeone: You've lost another knockout",
      "link": "https://www.espn.com/soccer/story/_/id/47558851/vinicius-jr-taunts-diego-simeone-real-madrid-atletico-clash",
      "summary": "Vinícius Júnior taunted Atlético Madrid coach Diego Simeone on social media after their clash at the Spanish Supercopa, commenting \"you've lost another knockout tie.\"",
      "publishedAt": "2026-01-09T19:33:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool sign Senegal U17 WC defender Ndiaye",
      "link": "https://www.espn.com/soccer/story/_/id/47562217/liverpool-sign-senegal-u17-world-cup-defender-mor-ndiaye",
      "summary": "Liverpool have announced the signing of Senegalese defender Mor Talla Ndiaye.",
      "publishedAt": "2026-01-09T19:33:03.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Audi become first team to run 2026 F1 car",
      "link": "https://www.skysports.com/f1/news/12040/13492464/audi-become-first-team-to-run-2026-f1-car-as-new-team-hold-filming-day-in-barcelona-ahead-of-testing",
      "summary": "Audi became the first team to run a 2026 Formula 1 car as they held a filming day in Barcelona on Friday.",
      "publishedAt": "2026-01-09T19:18:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FA Cup third round: Wrexham lead Forest after Luiz goal ruled out for handball LIVE!",
      "link": "https://www.skysports.com/football/wrexham-vs-nottingham-forest/live/550883",
      "summary": "",
      "publishedAt": "2026-01-09T18:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Solskjaer to hold talks with Man Utd on Saturday",
      "link": "https://www.skysports.com/football/news/12040/13492594/man-utd-new-manager-latest-ole-gunnar-solskjaer-to-hold-talks-with-club-on-saturday",
      "summary": "Ole Gunnar Solskjaer is set for his first face-to-face meeting with Man Utd's hierarchy on Saturday about the interim head coach position.",
      "publishedAt": "2026-01-09T18:37:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘Why can’t it be us?’: Weston-super-Mare hope FA Cup dream run can go on",
      "link": "https://www.theguardian.com/football/2026/jan/09/weston-super-mare-fa-cup-grimsby",
      "summary": "National League South side face Grimsby in the third round and those at the club are desperate for the ride to continue Weeks on from the FA Cup third-round draw, inside Weston-super-Mare’s modest clubhouse at their stadium a couple of miles from the holiday haven beachfront, there is still a tinge of incredulity at what might have been. Bridget Bolland, operations manager and one of the mini-army of staff who keep the part-time sixth-tier side ticking, relays how, normally, visiting teams have their post-match meal on a bench beside the skittles alley, sausage and chips usually the offering. The thought of Bruno Fernandes or Erling Haaland tucking in here is yet to fully evaporate. But the draw meant Weston, the promotion-chasing National League South side who have reached this stage of the Cup for the first time, have been preparing for a different challenge: a tie at fourth-tier Grimsby Town, who beat Manchester United in the Carabao Cup in August. “As a United fan, I hated them that night,” says Weston’s manager, Scott Rogers. “I was going mad at the TV. But I’m hoping we can do something similar. There’s always an upset in the Cup: why can’t it be us?” Continue reading...",
      "publishedAt": "2026-01-09T17:00:27.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs captain Romero given additional ban after red card",
      "link": "https://www.bbc.com/sport/football/articles/crlexynz3weo?at_medium=RSS&at_campaign=rss",
      "summary": "Tottenham captain Cristian Romero is given an additional one-match suspension and fined £50,000 for his behaviour during his side's Premier League defeat to Liverpool last month.",
      "publishedAt": "2026-01-09T16:31:10.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | British managers abroad: will Gary O’Neil sink or swim at Strasbourg?",
      "link": "https://www.theguardian.com/football/2026/jan/09/gary-o-neil-strasbourg-football-daily-newsletter",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! Some British managers who have chanced their arm on the continent have won trophies and the adoration of supporters. Others have at least provided the Daily with plenty of content. For every Bobby Robson, there’s a Tony Adams, or to meet somewhere in the middle, Steve McClaren – who can deliver you a league title while still making an arsche of himself in TV interviews. What fate awaits Gary O’Neil, quietly ushered into the vacant hot seat at Ligue 1 Strasbourg after Todd Boehly called up Liam Rosenior for the real job? Like Rosenior, he starts his tenure with a tricky away day in the cup; hours before Chelsea play Charlton, O’Neil will take the reins for a Coupe de France tie at fourth-tier Avranches. Back on a cold December day in 2001, I sat at Hillsborough and watched in despair as Sheffield Wednesday got absolutely shellacked by Norwich City, losing 5-0 at home. A couple of days after the game I sat down and wrote a letter (ask your parents, kids!) to our manager, Terry Yorath. I wasn’t rude, just desperate: I said I thought he ought to know that I’d been watching Wednesday for 17 years and that was the worst I’d ever seen us play. And you know what: he wrote me an actual letter back. He said he was sorry, that the club valued my support, and that he was trying hard to change things. He didn’t really change things (though we escaped relegation to League One by a point), but he did care enough to write to me, and I’ve never forgotten that. A gentleman” – Adam Gutteridge. Continue reading...",
      "publishedAt": "2026-01-09T15:57:38.000Z"
    }
  ]
}