{
  "generatedAt": "2026-01-02T11:21:25.080Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Arsenal in luxepositie op weg naar titel: 'Zitten pas in januari'",
      "link": "https://www.vi.nl/nieuws/arsenal-in-luxepositie-op-weg-naar-titel-zitten-pas-in-januari",
      "summary": "Mikel Arteta (43) is een tevreden manager bij Arsenal. De Spanjaard bouwde een comfortabele voorsprong op in de strijd om de Premier League-titel en zag de concurrentie op nieuwjaarsdag punten morsen. Al wil de oefenmeester zich nog niet rijk rekenen.",
      "publishedAt": "2026-01-02T11:11:49.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Africa Cup of Nations: tie-by-tie analysis of the last-16 matches",
      "link": "https://www.theguardian.com/football/2026/jan/02/africa-cup-of-nations-tie-by-tie-analysis-of-the-last-16-matches",
      "summary": "After a group stage that delivered an average of 3.6 goals a game we look at the match-ups in Morocco that start on Saturday Senegal, winners of the Afcon in 2022, have arguably the best collection of players, including the experience of Sadio Mané and the explosive talent of Nicolas Jackson, and are superior to their east African opponents. But Sudan, who qualified for the tournament despite the tragedy of a horrendous war in their country, certainly match the Lions of Teranga in fortitude. Sudan, coached by the Ghanaian Kwesi Appiah, who led his home country at the 2014 World Cup in Brazil, played all their qualifiers away from home, with the war, which began in April 2023, shutting down a thriving domestic league. The Sudan striker John Mano told the BBC: “Some of them [people in Sudan] cannot watch the matches … They can’t even listen on the radio … We are trying to free our country, through the football way.” An win for Sudan would be one of the fairytales of the tournament. Continue reading...",
      "publishedAt": "2026-01-02T11:07:40.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea manager latest, transfer updates and more: football news – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/02/chelsea-manager-latest-premier-league-buildup-and-more-football-news-live",
      "summary": "⚽ Read Jacob Steinberg on Maresca’s Chelsea departure ⚽ Fixtures | Tables | Follow us on Bluesky | Email Tom Eddie Howe is having none of the idea that Newcastle have no plan B, reports PA Media, and rejected suggestions they were under the cosh in their win at Burnley. Howe bristled at suggestions they had come under an onslaught at Turf Moor and there was nothing they could do about it. He said: “An onslaught? What, against us? Have you seen the stats of the game? You must have been watching a different game then. There was no onslaught. “Yes, we had moments, of course. We had moments the other way. I would never describe it as that. If it was an onslaught, I’d give you my opinion and say, ‘Yes, I thought it was’. Continue reading...",
      "publishedAt": "2026-01-02T11:04:58.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Feyenoord-aanvaller Diarra verlaat Afrika Cup met blessure",
      "link": "https://www.vi.nl/nieuws/feyenoord-aanvaller-diarra-verlaat-afrika-cup-met-blessure",
      "summary": "Voor Feyenoord-aanvaller Gaoussou Diarra zit de Afrika Cup erop. De buitenspeler liep een enkelblessure op de training op en is de rest van het toernooi niet meer inzetbaar voor Mali.",
      "publishedAt": "2026-01-02T10:56:17.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Chelsea wil Hato niet kwijt, Aké gelinkt aan Barcelona'",
      "link": "https://www.vi.nl/nieuws/aston-villa-haalt-braziliaans-talent-voor-12-miljoen-euro",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-02T10:52:08.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham agree deals to buy strikers Castellanos and Pablo for up to £47m",
      "link": "https://www.theguardian.com/football/2026/jan/02/west-ham-taty-castellanos-pablo-felipe-agree-deals-buy-strikers",
      "summary": "Both transfers being driven by Nuno Espírito Santo Sterling rejects West Ham, with Fulham favourites West Ham are poised to boost their attacking options by signing Gil Vicente’s Pablo Felipe and Lazio’s Taty Castellanos at a cost of up to £47m. Both deals have been driven by Nuno Espírito Santo, who is looking to help his struggling side’s fight to stay in the Premier League by adding more firepower. West Ham considered a move for the Wolves striker Jørgen Strand Larsen but decided against making a bid after concluding that his £40m valuation was too high. Continue reading...",
      "publishedAt": "2026-01-02T10:33:39.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie neemt deze acht jeugdspelers mee op trainingskamp in Spanje",
      "link": "https://www.vi.nl/nieuws/van-persie-neemt-deze-acht-jeugdspelers-mee-op-trainingskamp-in-spanje",
      "summary": "Feyenoord begint vrijdag aan de voorbereiding op de tweede seizoenshelft. De Rotterdammers vliegen naar Marbella, waar een trainingskamp belegd wordt. Trainer Robin van Persie neemt acht jeugdspelers mee naar Spanje.",
      "publishedAt": "2026-01-02T10:27:23.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior frontrunner to replace Maresca",
      "link": "https://www.espn.com/soccer/story/_/id/47479925/liam-rosenior-frontrunner-replace-enzo-maresca-chelsea-sources",
      "summary": "Strasbourg boss Liam Rosenior is the leading candidate to succeed Enzo Maresca as Chelsea head coach, sources have told ESPN.",
      "publishedAt": "2026-01-02T10:22:35.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep says Rodri 'changed the game' in City return",
      "link": "https://www.espn.com/soccer/story/_/id/47475444/guardiola-rodri-manchester-city-return",
      "summary": "Pep Guardiola said Rodri showed Manchester City what they have been missing for a year and a half after the Ballon d'Or winner's substitute performance during a goalless draw at Sunderland.",
      "publishedAt": "2026-01-02T10:22:35.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool disappointed as unbeaten run goes to 8",
      "link": "https://www.espn.com/soccer/story/_/id/47474640/liverpool-disappointed-unbeaten-run-8-leeds-draw",
      "summary": "Arne Slot described Liverpool's 0-0 draw with Leeds United as a \"disappointment\" despite his team extending their unbeaten run to eight games in all competitions.",
      "publishedAt": "2026-01-02T10:22:35.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "City lose ground to Arsenal with Sunderland draw",
      "link": "https://www.espn.com/soccer/report/_/gameId/740784",
      "summary": "Sunderland extended their unbeaten Premier League home record to 10 games after holding Manchester City to a goalless draw.",
      "publishedAt": "2026-01-02T10:22:35.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Is Gyokeres struggling to adapt or being misused?",
      "link": "https://www.bbc.com/sport/articles/c8e5ll3r574o?at_medium=RSS&at_campaign=rss",
      "summary": "Viktor Gyokeres joined Arsenal as Europe's most prolific goalscorer - so why have his numbers dropped so drastically?",
      "publishedAt": "2026-01-02T10:15:03.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Waarom AZ het gokje aandurft met Ayoub Oufkir",
      "link": "https://www.vi.nl/pro/dit-is-waarom-az-het-gokje-aandurft-met-ayoub-oufkir",
      "summary": "Terwijl Kees Smit, het huidige pareltje in de AZ-selectie, op de interesse mag rekenen van zowat de gehele wereldtop, hopen de Alkmaarders in 2026 een nieuwe parel te hebben gevonden. Ayoub Oufkir (19), die zich afgelopen zomer nog samen met Smit tot Europees kampioen mocht kronen bij Oranje Onder-19, maakt voor naar verluidt zo'n 5 miljoen euro de overstap van Sparta. VI PRO bekeek daarom alle speelminuten van Oufkir in 2025/26 nogmaals terug, om het spel van de talentvolle linkspoot te beoordelen. Video-analyse van een buitenspeler met geweldige voorwaarden, maar duidelijke verbeterpunten.",
      "publishedAt": "2026-01-02T10:07:59.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Venus Williams, 45, receives wildcard entry for Australian Open",
      "link": "https://www.skysports.com/tennis/news/12040/13489606/australian-open-venus-williams-45-receives-wildcard-entry-for-first-melbourne-grand-slam-appearance-in-five-years",
      "summary": "Venus Williams will return to the Australian ‌Open after receiving a wildcard entry, the tournament's organisers said ​on Friday, marking her first appearance at Melbourne ⁠Park in five years.",
      "publishedAt": "2026-01-02T09:53:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'It's an easy decision' | Did Romero escape a red card?",
      "link": "https://www.skysports.com/watch/video/13489600/brentford-vs-tottenam-hotspur-ref-watch-did-cristian-romero-escape-a-red-card-for-foul-on-igor-thiago",
      "summary": "On Ref Watch, Dermot Gallagher gives his verdict on whether Cristian Romero escaped a red card for a foul on Brentford's' Igor Thiago.",
      "publishedAt": "2026-01-02T09:27:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "WSL latest: London City Lionesses appoint Maestre as head coach",
      "link": "https://www.skysports.com/football/live-blog/12040/13208899/wsl-news-transfers-rumours-gossip-and-womens-football-latest",
      "summary": "",
      "publishedAt": "2026-01-02T09:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McIlroy: Ryder Cup crowd worst I've ever known - 'Bradley could have done more'",
      "link": "https://www.skysports.com/golf/news/12040/13489597/rory-mcilroy-ryder-cup-crowd-at-bethpage-black-worst-ive-experienced-keegan-bradley-could-have-done-more",
      "summary": "Rory McIlroy said the Ryder Cup crowd at Bethpage Black was \"by far the worst\" he has experienced, saying USA captain Keegan Bradley \"could have done more\".",
      "publishedAt": "2026-01-02T09:17:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The Guardian Footballer of the Year Jess Carter: ‘I remember not wanting to go out’",
      "link": "https://www.theguardian.com/football/2026/jan/02/the-guardian-footballer-of-the-year-jess-carter-england-interview",
      "summary": "England defender publicly confronted racist abuse at the Euros and ended 2025 a title winner with club and country The Guardian Footballer of the Year is an award given to a player who has done something remarkable, whether by overcoming adversity, helping others or setting a sporting example by acting with exceptional honesty. Jess Carter has spent her life grappling with when to hold back and when to speak up; wrestling with being naturally herself, embodying the characteristics her parents instilled in her of being open, honest, vocal and confident, and subduing herself because, while society values those traits, in a black woman they can be viewed negatively. Continue reading...",
      "publishedAt": "2026-01-02T08:00:05.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Best bargain' Kamara at heart of Aston Villa success",
      "link": "https://www.bbc.com/sport/football/articles/czdg84m99vvo?at_medium=RSS&at_campaign=rss",
      "summary": "Boubacar Kamara is Aston Villa's unassuming star and has quietly evolved into one of the best midfielders in the Premier League.",
      "publishedAt": "2026-01-02T07:54:37.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We are not happy' - Man City fall behind Arsenal in title race",
      "link": "https://www.bbc.com/sport/football/articles/cm248l1j7jno?at_medium=RSS&at_campaign=rss",
      "summary": "Pep Guardiola questioned whether it was only a two-horse Premier League title race, but his Manchester City side can ill-afford many slip-ups in their quest to hunt down leaders Arsenal.",
      "publishedAt": "2026-01-01T23:33:23.000Z"
    }
  ]
}