{
  "generatedAt": "2026-01-06T18:37:17.537Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PEC Zwolle neemt per direct afscheid van overbodige aanvaller",
      "link": "https://www.vi.nl/nieuws/pec-zwolle-neemt-per-direct-afscheid-van-overbodige-aanvaller",
      "summary": "PEC Zwolle heeft per direct afscheid genomen van Braydon Manu. Het contract van de Duitser met Ghanese roots is ontbonden.",
      "publishedAt": "2026-01-06T18:33:47.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Groningen krijgt flink pak slaag van CL-deelnemer Bodø/Glimt",
      "link": "https://www.vi.nl/nieuws/groningen-krijgt-flink-pak-slaag-van-cl-deelnemer",
      "summary": "FC Groningen heeft in aanloop naar de hervatting van de Eredivisie een pijnlijke oefennederlaag geleden. FC Bodø/Glimt was in Marbella met duidelijke cijfers te sterk. Sparta Rotterdam en Telstar hadden meer succes.",
      "publishedAt": "2026-01-06T18:31:36.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Algeria v DR Congo: Africa Cup of Nations last 16 in extra time – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/06/algeria-v-dr-congo-africa-cup-of-nations-last-16-live",
      "summary": "⚽ Afcon updates from the last 16, 4pm GMT kick-off ⚽ Follow on Bluesky | Get in touch: you can mail Yara 10 min: Algeria win their first corner … Bensebaini takes but it barely clears the first man. Amoura is now down and the replay shows his football boot came clean off during that corner. No foul, which is the right decision I think, and play continues with a DR Congo free-kick. 9 min: Chancel Mbemba is down receiving treatment. Would be a huge miss for DR Congo for their captain to be injured early but he seems to be OK. Continue reading...",
      "publishedAt": "2026-01-06T18:24:02.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo to Man City deal done pending medical",
      "link": "https://www.bbc.com/sport/football/articles/c8j389dd211o?at_medium=RSS&at_campaign=rss",
      "summary": "Bournemouth winger Antoine Semenyo is set to have a medical after his side's game against Tottenham on Wednesday before he makes a move to Manchester City.",
      "publishedAt": "2026-01-06T18:22:02.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Fulham contact PGMOL over 'offside' Wirtz goal",
      "link": "https://www.bbc.com/sport/football/articles/cx2y47ly55zo?at_medium=RSS&at_campaign=rss",
      "summary": "Marco Silva says Fulham have contacted the Professional Game Match Officials Limited over Florian Wirtz's controversial goal for Liverpool on Sunday.",
      "publishedAt": "2026-01-06T18:19:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Twente strikt Ten Hag als nieuwe technisch directeur",
      "link": "https://www.vi.nl/nieuws/fc-twente-strikt-ten-hag-als-nieuwe-technisch-directeur",
      "summary": "FC Twente heeft Erik ten Hag gestrikt als technisch directeur. De 55-jarige Tukker volgt met ingang van komend seizoen Jan Streuer op. Vanaf 1 februari gaat Ten Hag al meewerken in de voetbalorganisatie van Twente.",
      "publishedAt": "2026-01-06T18:15:17.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Terug naar het rijke FC Twente-verleden van Erik ten Hag",
      "link": "https://www.vi.nl/pro/terug-naar-het-rijke-fc-twente-verleden-van-erik-ten-hag-",
      "summary": "Vanavond brengt FC Twente in de Europa League een bezoek aan Old Trafford. De Tukkers nemen het dan op tegen het Manchester United van Erik ten Hag, die zelf in drie periodes voor FC Twente speelde.",
      "publishedAt": "2026-01-06T18:11:38.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ole Gunnar Solskjær could make shock return as Manchester United interim manager",
      "link": "https://www.theguardian.com/football/2026/jan/06/ole-gunnar-solskjaer-shock-return-manchester-united-interim-manager",
      "summary": "Wilcox considers Norwegian a prime candidate for role Senior players would welcome temporary appointment Ole Gunnar Solskjær could make a shock return to Manchester United as interim manager, with Jason Wilcox, the director of football, considering him a prime candidate for the role. Solskjær is thought to be open to taking up the position at a club where he remains a huge fan favourite as a former successful player there. Senior players led by Bruno Fernandes and Harry Maguire would welcome his temporary appointment. Continue reading...",
      "publishedAt": "2026-01-06T18:00:18.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United approach Carrick, Solskjaer",
      "link": "https://www.espn.com/soccer/story/_/id/47527700/man-united-approach-ole-gunnar-solskjaer-michael-carrick-interim-role",
      "summary": "Manchester United have held \"early-stage informal talks\" with several potential interim managers, including Ole Gunnar Solskjaer and Michael Carrick, sources have told ESPN.",
      "publishedAt": "2026-01-06T17:56:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea name Rosenior as coach on 5½-year deal",
      "link": "https://www.espn.com/soccer/story/_/id/47523773/liam-rosenior-chelsea-appointment-strasbourg-exit-premier-league-manager",
      "summary": "Chelsea have announced the appointment of Liam Rosenior as their new head coach on a 5½-year contract.",
      "publishedAt": "2026-01-06T17:56:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Fletcher: Leading Man United an 'amazing honor'",
      "link": "https://www.espn.com/soccer/story/_/id/47528545/darren-fletcher-man-united-coach-interim-amazing-honour",
      "summary": "Darren Fletcher has said it's \"an amazing honour\" to be asked to lead Manchester United in the aftermath of Ruben Amorim's dismissal.",
      "publishedAt": "2026-01-06T17:56:08.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City lose Dias for up to six weeks but book in Semenyo medical",
      "link": "https://www.theguardian.com/football/2026/jan/06/manchester-city-ruben-dias-injury-out-for-up-to-six-weeks",
      "summary": "Bournemouth’s Semenyo due for medical on Thursday Academy graduate Alleyne recalled amid injury crisis Manchester City will be without Rúben Dias for up to six weeks with a hamstring injury, exacerbating Pep Guardiola’s defensive injury crisis. The shortage of centre-backs could force the club into the transfer market, with the Crystal Palace captain, Marc Guéhi, of interest. City are contemplating a bid for Guéhi and are close to completing a move for the forward Antoine Semenyo, who is due for a medical on Thursday after playing a final game for Bournemouth on Wednesday at home against Tottenham. City have agreed to pay Semenyo’s almost £65m release clause. Continue reading...",
      "publishedAt": "2026-01-06T17:55:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McCann backed to keep Kilmarnock up after being named manager",
      "link": "https://www.skysports.com/football/news/12040/13491241/neil-mccann-kilmarnock-appoint-former-rangers-coach-as-manager-alongside-billy-dodds-as-stuart-kettlewells-successor",
      "summary": "Kilmarnock \"have complete faith\" that Neil McCann will keep the club in the Scottish Premiership.",
      "publishedAt": "2026-01-06T17:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Feyenoord laat Andreev het seizoen in Polen afmaken",
      "link": "https://www.vi.nl/nieuws/feyenoord-laat-andreev-het-seizoen-in-polen-afmaken",
      "summary": "Plamen Andreev zal het seizoen op huurbasis afmaken bij Lech Poznan. De 21-jarige doelman van Feyenoord wordt daarmee voor de tweede keer dit seizoen verhuurd.",
      "publishedAt": "2026-01-06T17:29:03.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man Utd hold talks with trio over caretaker role",
      "link": "https://www.bbc.com/sport/football/articles/c931qgk3xgqo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United hold talks with former players Darren Fletcher, Michael Carrick and Ole Gunnar Solskjaer about becoming the club's caretaker manager.",
      "publishedAt": "2026-01-06T17:12:54.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Rosenior to Chelsea: ‘collaboration’ turns the Strasbourg air blue",
      "link": "https://www.theguardian.com/football/2026/jan/06/liam-rosenior-chelsea-strasbourg-football-daily-newsletter",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! While Football Daily spent most of New Year’s Day shivering, sweating and staring at hallucinatory rodents while questioning the wisdom of embarking on our first Dry January since 1989, it didn’t escape our blurred vision that Chelsea chose to ring in 2026 by firing Enzo Maresca. While he may have grown up the son of a humble Italian fisherman, the head coach had gotten a little too big for his waders, eventually being tossed into an ocean of opaque criticism he had levelled at unspecified members of the club hierarchy. Like a frail old man bobbing around the Tyrrhenian Sea while trying to reel in a 500lb bluefin tuna with a spool of dental floss, Maresca had picked a battle he was always going to lose – and on Tuesday Chelsea unveiled the Italian’s replacement. So Chelsea are so confident that Liam Rosenior is the answer that they have given him a contract until 2032. Odds on him still being there in six years’ time? There’s more chance of Accrington Stanley winning the FA Cup (and they got knocked out in the first round). Are football club owners mad or just desperate?” – John Myles. It’s quite sad to see Thomas Frank under increasing pressure at Spurs (for not solving all the problems that have dogged them for the last 40 years at a club that finished 17th last season, one place above relegation). Still, the one thing that should help him in this challenging period is that there isn’t anyone available with extensive experience of being an interim manager at Spurs. Oh. Meanwhile, Martin O’Neill returning as Celtic manager (now they don’t have to play Hearts again obviously), after spending only 37 days as interim and yet somehow outlasting the subsequent full-time manager, is both utterly predictable and yet simultaneously farcical. The skeleton of Jock Stein must be roaming the Scottish countryside in search of a pair of eyeballs to roll …” – Noble Francis. As we emerge into the sunlit uplands of 2026, can any of us honestly say that we had a 3-0 Wolves win, Chelsea, Celtic and Manchester United managerial exits, plus the audacious midnight capturing of a sitting South American president by the winner of Fifa’s peace prize on our festive bingo cards? Thought not. Happy new year! We’re off to a flyer!” – Allastair McGillivray. This is an extract from our daily football email … Football Daily. To get the full version, just visit this page and follow the instructions. Continue reading...",
      "publishedAt": "2026-01-06T15:38:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick, Solskjaer contacted over Man Utd interim role",
      "link": "https://www.skysports.com/football/news/12040/13491195/man-utd-manager-latest-ole-gunnar-solskjaer-michael-carrick-contacted-over-interim-manager-position",
      "summary": "Manchester United have begun talking to external candidates as they look for an interim manager to take charge until the end of the season, with three former Old Trafford favourites in the mix for a possible return after Ruben Amorim's departure.",
      "publishedAt": "2026-01-06T15:03:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Man United sacked Amorim: Tactics, player issues, transfer frustration",
      "link": "https://www.espn.com/soccer/story/_/id/47514917/manchester-united-story-firing-ruben-amorim-analysis-rob-dawson",
      "summary": "Ruben Amorim was seen as a risky choice to lead Man United's rebuild in November 2024. Here's how things broke down publicly and behind closed doors.",
      "publishedAt": "2026-01-06T14:09:56.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Who will be Man United's next manager? 12 top candidates to replace Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47516208/man-united-next-manager-12-candidates-replace-amorim",
      "summary": "Whether Manchester United aim to hire quickly or wait until summer, here are the coaches they could be after.",
      "publishedAt": "2026-01-06T14:09:55.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim 'blow-up' brings Wilcox into the spotlight",
      "link": "https://www.bbc.com/sport/football/articles/cedw8qq9l7po?at_medium=RSS&at_campaign=rss",
      "summary": "Who is Manchester United's director of football Jason Wilcox and how did he become one of the most powerful figures in football?",
      "publishedAt": "2026-01-06T13:10:31.000Z"
    }
  ]
}