{
  "generatedAt": "2026-01-07T13:42:04.042Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Nu moet SC Heerenveen zorgen voor stabiliteit in de resultaten",
      "link": "https://www.vi.nl/pro/nu-nog-zorgen-voor-stabiliteit-in-de-resultaten",
      "summary": "Op een paar uitzonderingen na die juist net in een flow waren geraakt, haalden de Eredivisie-clubs op het tandvlees de winterstop. Veel tijd om weer op adem te komen, hebben ze alleen niet, want dit weekeinde begint het hele circus alweer. In aanloop naar het cruciale deel van het seizoen maken we bij elke club de balans op, waarbij we wat de volgorde betreft uitgaan van de eerste speelronde van 2026. Deze keer: SC Heerenveen.",
      "publishedAt": "2026-01-07T15:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Roma chief: Amorim axe has changed Zirkzee plan",
      "link": "https://www.espn.com/soccer/story/_/id/47537424/ruben-amorim-man-united-sacking-changed-joshua-zirkzee-situation",
      "summary": "Roma sporting director Ricky Massara has hinted that a planned move for Joshua Zirkzee may be on the backburner following Ruben Amorim's Manchester United sacking.",
      "publishedAt": "2026-01-07T13:36:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Glasner: No time for Utd links, Guehi may join City",
      "link": "https://www.espn.com/soccer/story/_/id/47536863/oliver-glasner-man-united-manager-marc-guehi-man-city-transfer-crystal-palace",
      "summary": "Crystal Palace coach Oliver Glasner is unbothered by links with the Manchester United job and admitted that captain Marc Guéhi could join Manchester City.",
      "publishedAt": "2026-01-07T13:36:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "O'Neil replaces Rosenior as new Strasbourg boss",
      "link": "https://www.espn.com/soccer/story/_/id/47537318/gary-oneil-replaces-chelsea-liam-rosenior-new-strasbourg-boss",
      "summary": "Strasbourg have confirmed the appointment of Gary O'Neill as their new head coach following the departure of Liam Rosenior to Chelsea.",
      "publishedAt": "2026-01-07T13:36:32.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Littler, Van Veen and Humphries headline Bahrain and Saudi Arabia Darts Masters",
      "link": "https://www.skysports.com/darts/news/12040/13491526/luke-littler-gian-van-veen-and-luke-humphries-headline-2026-bahrain-and-saudi-arabia-darts-masters",
      "summary": "Luke Littler, Gian van Veen and Luke Humphries will headline this year's Bahrain Darts Masters and Saudi Arabia Darts Masters, as the 2026 World Series of Darts gets under way this month.",
      "publishedAt": "2026-01-07T13:23:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Napoli wil Juventus aftroeven met Chiesa, AC Milan hoopt op Min-Jae Kim'",
      "link": "https://www.vi.nl/nieuws/napoli-wil-juventus-aftroeven-met-chiesa-ac-milan-hoopt-op-min-jae-kim",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-07T13:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2026-01-07T13:11:06.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Slot concedes Liverpool’s approach has grown dull: ‘I would not completely disagree’",
      "link": "https://www.theguardian.com/football/2026/jan/07/arne-slot-liverpool-approach-has-grown-dull-premier-league",
      "summary": "Liverpool manager says team struggling to create ‘My teams always try to play attacking football’ Arne Slot has said it hurts his principles as an attacking coach to hear his Liverpool team described as boring but he could not entirely disagree on current form. Liverpool have stabilised after a damaging sequence of nine defeats in 12 matches, the club’s worst return in 71 years, with a nine-game unbeaten run but are struggling to produce convincing performances. Successive draws against Fulham and Leeds have prompted further criticism of Slot’s style and resulted in the champions falling 14 points behind the leaders, Arsenal, who they face at the Emirates Stadium on Thursday. Continue reading...",
      "publishedAt": "2026-01-07T13:10:35.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Hard to disagree' with fans calling us dull and boring - Slot",
      "link": "https://www.bbc.com/sport/football/articles/cy7mgmp2ymjo?at_medium=RSS&at_campaign=rss",
      "summary": "Arne Slot says it is \"hard to hear\" fans calling his Liverpool side dull and boring and while he does not \"completely disagree\" he insists he wants to play \"attractive football\".",
      "publishedAt": "2026-01-07T12:49:35.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "KNVB gooit ook al het amateurvoetbal voor dit weekend eruit",
      "link": "https://www.vi.nl/nieuws/knvb-gooit-ook-al-het-amateurvoetbal-voor-dit-weekend-eruit",
      "summary": "In navolging van de afgelasting van de vrijdagwedstrijden in het Nederlands betaald voetbal heeft de KNVB ook besloten alle amateurwedstrijden voor dit weekend eruit te gooien. De winterse weersomstandigheden zijn daarvan de oorzaak.",
      "publishedAt": "2026-01-07T12:43:05.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Loting Copa del Rey: Barça treft stuntploeg, Real naar Albacete",
      "link": "https://www.vi.nl/nieuws/loting-copa-del-rey-bar-a-treft-stuntploeg-real-naar-albacete",
      "summary": "De loting voor de achtste finales in de Spaanse Copa del Rey is woensdagmiddag verricht: Barcelona gaat op bezoek bij Racing Santander en Real Madrid neemt het op tegen Albacete. Ook Atlético Madrid wacht een uitwedstrijd.",
      "publishedAt": "2026-01-07T12:40:45.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick and Solskjaer frontrunners for caretaker role",
      "link": "https://www.bbc.com/sport/football/articles/cnvgq2ny2rzo?at_medium=RSS&at_campaign=rss",
      "summary": "Michael Carrick and Ole Gunnar Solskjaer emerge as frontrunners to become Manchester United's caretaker manager until the end of the season.",
      "publishedAt": "2026-01-07T12:33:26.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs head coach Martin Ho: ‘We’re not even 15% of the way to where I want us to be’",
      "link": "https://www.theguardian.com/football/2026/jan/07/spurs-head-coach-martin-ho-wsl-interview",
      "summary": "Leader of resurgent WSL side on what he demands of players, his relationship with the hierarchy and the change that has surprised him Tottenham have as many points in the Women’s Super League this term, at the halfway stage, as they accumulated in the entirety of last season. That sentence will offer some satisfaction to their supporters but the head coach, Martin Ho, demonstrates how serious his intentions are when he says: “We’re not even 15% of the way to where I want us to be.” Ho, appointed in July, uses a specific word four times across the course of the conversation: “Standards.” The former Manchester United assistant coach inherited a team that had finished second from bottom and has Spurs two points off a European place, but he wants them to challenge themselves further. Continue reading...",
      "publishedAt": "2026-01-07T12:30:12.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tennis 2026 schedule, Grand Slam dates and tournament calendar for ATP and WTA Tours",
      "link": "https://www.skysports.com/tennis/news/12040/13491111/tennis-2026-schedule-grand-slam-dates-and-tournament-calendar-for-atp-and-wta-tours",
      "summary": "Keep track of the dates, tournament calendar and latest results for the 2026 ATP and WTA Tours.",
      "publishedAt": "2026-01-07T12:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Future of England cricket' - 'diamond' Bethell delivers on supreme talent",
      "link": "https://www.skysports.com/cricket/news/12040/13491416/the-ashes-jacob-bethell-hailed-as-future-of-england-cricket-after-delivering-on-supreme-talent-with-first-test-century",
      "summary": "Jacob Bethell evoked memories of David Gower with his stylish, yet composed, maiden Test century at No 3 for England in the fifth Ashes Test in Sydney, according to Sky Sports' Nasser Hussain.",
      "publishedAt": "2026-01-07T11:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Morocco and Regragui feel pressure before high-profile Afcon quarter-finals",
      "link": "https://www.theguardian.com/football/2026/jan/07/morocco-and-regragui-feel-pressure-before-high-profile-afcon-quarter-finals",
      "summary": "Seven of the eight nations have won the tournament before while Mali take on the role of stubborn outsiders A comfortable 3-0 victory for the defending champions, Côte d’Ivoire, over Burkina Faso on Tuesday evening completes the highest-powered set of quarter-finalists the Cup of Nations has ever known. Seven of the last eight are former champions; between them they have won 22 Cups of Nations. It is the first time all eight quarter-finalists are in the top 10 African sides in the Fifa rankings. It’s been a strangely predictable tournament so far, at least after Ghana failed to qualify; the nearest to a surprise in the last 16 was Mali’s win over Tunisia and Cameroon’s victory over South Africa. After the lengthy preamble in a format lacking in jeopardy, the tournament needs the giants to deliver the appropriate payoff. Continue reading...",
      "publishedAt": "2026-01-07T10:37:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Potential roles for both Solskjaer and Carrick as Man Utd plan further talks",
      "link": "https://www.skysports.com/football/news/12040/13491414/man-utd-new-manager-latest-potential-roles-for-both-ole-gunnar-solskjaer-and-michael-carrick-as-further-talks-planned",
      "summary": "Manchester United plan to hold further talks with Ole Gunnar Solskjaer and Michael Carrick before deciding on who to make their interim head coach, and Sky Sports News has been told there could be a role for both in the new setup.",
      "publishedAt": "2026-01-07T10:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Palace would sell Guehi at right price - Glasner",
      "link": "https://www.bbc.com/sport/football/articles/c3941prmdzpo?at_medium=RSS&at_campaign=rss",
      "summary": "Crystal Palace manager Oliver Glasner says the club could sell captain Marc Guehi this month if his asking price is met.",
      "publishedAt": "2026-01-07T09:59:01.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Liam Rosenior’s time at Strasbourg was ideal preparation for Chelsea",
      "link": "https://www.theguardian.com/football/2026/jan/07/liam-rosenior-strasbourg-ideal-preparation-chelsea-young-players-demands-owners",
      "summary": "The 41-year-old is at home with young players and, crucially, he is familiar with the demands of Chelsea’s owners By Get French Football News Liam Rosenior looks up at the towering Strasbourg Kop. He shouts and pleads as he points to his players, demanding the fans applaud them. Met with hostility, boos and jeers in the stands, he cuts a lone figure, one at pains to sow unity at a divided club. Strasbourg had just won the game, beating Le Havre 1-0 earlier this season, but the club’s fans were in no mood to celebrate. Behind an image are a thousand words, or three banners in this case. One called for the club president Marc Keller to leave Strasbourg; another criticised the bizarre Ishé Samuels-Smith back-and-forth transfer; and the one to which Rosenior took particular exception concerned his captain, Emmanuel Emegha. It read: “Emegha, pawn of BlueCo, after changing shirts, hand back your armband.” Emegha had agreed a deal to join Chelsea a few days earlier, once again confirming to Strasbourg fans that they were subservient to “big brother” Chelsea in the multi-club hierarchy. Continue reading...",
      "publishedAt": "2026-01-07T08:00:37.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Nobody can get hold of him' - what happened to David Batty?",
      "link": "https://www.bbc.com/sport/football/articles/cp9jn090kv2o?at_medium=RSS&at_campaign=rss",
      "summary": "England midfielder David Batty vowed to have \"nothing to do with the football industry\" after retirement. As his former clubs Newcastle and Leeds prepare to meet, BBC Sport asks: What happened to him?",
      "publishedAt": "2026-01-07T06:47:44.000Z"
    }
  ]
}