{
  "generatedAt": "2026-01-16T19:22:17.736Z",
  "items": [
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'No panic buy' - Guehi would cap £414m rebuild as Man City up title ante",
      "link": "https://www.bbc.com/sport/football/articles/cwywey6yyzlo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City have upped the ante in the Premier League title race by flexing their muscles in the January transfer window.",
      "publishedAt": "2026-01-16T19:06:44.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Met of zonder toverduo, Fortuna gelooft in stunt tegen PSV",
      "link": "https://www.vi.nl/nieuws/fortuna-gokt-tegen-psv-op-geloof-duels-en-tovenaars",
      "summary": "‘Een topaffiche’, noemde PSV-trainer Peter Bosz de komende uitwedstrijd van zijn ploeg. Tikje overdreven wellicht, maar feit is dat een bezoek aan Fortuna Sittard voor geen enkele tegenstander een prettig vooruitzicht is. Trainer Danny Buijs van de Limburgers blikt vooruit.",
      "publishedAt": "2026-01-16T19:05:31.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Oliver Glasner’s inevitable exit compounds one of Crystal Palace’s worst ever weeks | Ed Aarons",
      "link": "https://www.theguardian.com/football/2026/jan/16/oliver-glasner-inevitable-exit-crystal-palace-marc-guehi",
      "summary": "Manager’s decision is no surprise having fought to keep Marc Guéhi in the summer and amid doubts over futures of a host of Palace’s FA Cup-winning stars It was the day Crystal Palace supporters had dreaded but feared was inevitable. Oliver Glasner, having confirmed that the captain Marc Guéhi’s move to Manchester City is poised to go ahead, had another bombshell prepared for his press conference to preview Saturday’s trip to Sunderland. Nearly eight months to the day since the Austrian led the club to their first major trophy by beating Manchester City in the FA Cup final, his announcement that he will leave Selhurst Park at the end of the season came as no surprise. It rounds off one of the worst weeks in the club’s history after the humiliating defeat by non-league Macclesfield that will be for ever an unwanted postscript to their victory. Continue reading...",
      "publishedAt": "2026-01-16T19:00:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Another blow for Palace? Mateta could leave this month",
      "link": "https://www.skysports.com/football/news/12040/13495133/jean-philippe-mateta-transfer-news-crystal-palace-striker-open-to-new-challenge-amid-premier-league-interest",
      "summary": "Crystal Palace face losing another key player with striker Jean-Philippe Mateta open to a new challenge.",
      "publishedAt": "2026-01-16T19:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick shrugs off criticism from ex-United players",
      "link": "https://www.espn.com/soccer/story/_/id/47630083/manchester-united-michael-carrick-roy-keane-criticism",
      "summary": "Michael Carrick has said he is \"not bothered\" by personal criticism made by Roy Keane.",
      "publishedAt": "2026-01-16T18:54:59.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Man City agree deal with Palace for Guéhi",
      "link": "https://www.espn.com/soccer/story/_/id/47630232/marc-guehi-final-stage-crystal-palace-move-man-city-sources",
      "summary": "Manchester City are closing in on the signing of Marc Guéhi from Crystal Palace, sources have told ESPN.",
      "publishedAt": "2026-01-16T18:54:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Transfer request from teen starlet stuns Barça",
      "link": "https://www.espn.com/soccer/story/_/id/47632181/barcelona-stunned-transfer-request-teen-dro-fernandez",
      "summary": "Barcelona have been left stunned after teenager Dro Fernández informed the club of his desire to leave this January by exercising his €6 million ($7m) release clause, sources have told ESPN.",
      "publishedAt": "2026-01-16T18:54:58.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Marokko's vorige prijs: radio's in de medina, een brandend vliegtuig en buiktyfus",
      "link": "https://www.vi.nl/pro/marokko-zindert-krijgen-de-helden-van-1976-eindelijk-hun-opvolgers",
      "summary": "Met ingehouden adem wacht de bevolking van Marokko op de finale van de Afrika Cup in eigen huis. Zondagavond speelt hun land in het nagelnieuwe Stade Prince Moulay Abdellah tegen Senegal. Inzet, voor beide landen: de tweede eindzege ooit. De Senegalezen wonnen het toernooi vrij recent, in 2021. Voor Marokko moeten we op de kop af vijftig jaar terug voor de enige hoofdprijs in de nationale voetbalhistorie. Dit is het bijzondere verhaal van de triomf in Ethiopië.",
      "publishedAt": "2026-01-16T18:52:13.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Penaltykiller De Busser houdt geen rekening met Krul-scenario",
      "link": "https://www.vi.nl/nieuws/penaltykiller-de-busser-houdt-geen-rekening-met-krul-scenario",
      "summary": "Jari De Busser maakt bij Go Ahead Eagles naam als penaltykiller en dat valt ook op in zijn vaderland. De 26-jarige Belg rekent echter niet op een plek in de WK-selectie vanwege zijn specialiteit.",
      "publishedAt": "2026-01-16T18:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League news: Arteta plays down Rice’s tunnel spat with coach, Dyche seeks striker",
      "link": "https://www.theguardian.com/football/2026/jan/16/premier-league-news-arsenal-coach-mikel-arteta",
      "summary": "News from Friday’s press conferences, including updates on Arsenal, Nottingham Forest and West Ham Continue reading...",
      "publishedAt": "2026-01-16T18:34:01.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Franse bond denkt toch alvast aan tijdperk-Zidane: ook assistent is al gecast'",
      "link": "https://www.vi.nl/nieuws/franse-bond-denkt-toch-alvast-aan-tijdperk-zidane-ook-assistent-is-al-gecast",
      "summary": "Het zal niemand verbazen als Zinédine Zidane na het WK van aanstaande zomer verdergaat als bondscoach van Frankrijk. Het is al bekend dat Didier Deschamps ermee ophoudt, en Zidane wordt overal genoemd als opvolger. Officieel wordt er gezwegen, achter de schermen lijken de voorbereidingen toch al in gang.",
      "publishedAt": "2026-01-16T18:32:03.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League team news: predicted lineups for the weekend action",
      "link": "https://www.theguardian.com/football/2026/jan/16/premier-league-team-news-predicted-lineups-for-the-weekend-action",
      "summary": "Michael Carrick faces a baptism of fire as City visit United in the Manchester derby while Tottenham host West Ham Saturday 12.30pm Sky Sports Premier League Venue Old Trafford Continue reading...",
      "publishedAt": "2026-01-16T18:24:30.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Transfer window weekly: Güler to Arsenal? Chelsea squad changes?",
      "link": "https://www.espn.com/soccer/story/_/id/47628046/transfer-window-weekly-arsenal-real-madrid-arda-guler-man-city-marc-guehi",
      "summary": "The winter transfer window is open, but what are our reporters hearing about deals that could be done? Get the latest every Friday.",
      "publishedAt": "2026-01-16T18:23:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Guéhi to complete Man City's new-signing XI, worth almost $580M",
      "link": "https://www.espn.com/soccer/story/_/id/47630847/man-city-new-signing-xi-marc-guehi-transfer-500m",
      "summary": "Marc Guéhi would be Man City's 14th signing since the start of last January.",
      "publishedAt": "2026-01-16T18:23:27.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hwang droomt van Premier League maar is vooral heel dankbaar bij Feyenoord",
      "link": "https://www.vi.nl/nieuws/hwang-droomt-van-premier-league-maar-is-vooral-heel-dankbaar-bij-feyenoord",
      "summary": "In-beom Hwang heeft nog één grote droom in zijn voetbalcarrière: spelen in de Premier League. De Feyenoorder windt er geen doekjes om dat hij ooit nog eens naar Engeland wil verkassen, maar voorlopig is hij vooral heel dankbaar dat hij bij de Rotterdammers mag voetballen.",
      "publishedAt": "2026-01-16T18:15:55.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hamilton's race engineer moved to new role by Ferrari",
      "link": "https://www.skysports.com/f1/news/12040/13495109/lewis-hamilton-ferrari-drivers-race-engineer-riccardo-adami-moved-to-different-position-at-team-ahead-of-2026-f1-season",
      "summary": "Lewis Hamilton's Ferrari race engineer Riccardo Adami has been moved to a different role with the Italian team ahead of the 2026 season.",
      "publishedAt": "2026-01-16T17:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Igor Thiago: ‘The only thing I know how to do in my life is score goals’",
      "link": "https://www.theguardian.com/football/2026/jan/16/igor-thiago-brentford-brazil-world-cup-interview",
      "summary": "Brentford’s record-breaking Brazilian has overcome a torrid childhood, racism and injuries – but is dreaming of Brazil’s No 9 shirt at the World Cup Igor Thiago had dreams that seemed impossible. His impoverished childhood and the early death of his father forced him to grow up fast while still a teenager. To eat, he had to start working as a child. He was a bricklayer’s assistant, a fruit carrier at the market and a car washer … so many jobs that could have prevented him from becoming the Brazilian to make Premier League history with the most goals in a single season. Igor Thiago has 16 goals in 21 games for Brentford. There are still 17 more matches to go, the first against Chelsea on Saturday, but he has already surpassed such Brazilian luminaries as Roberto Firmino, Matheus Cunha and Gabriel Martinelli, all of whom scored 15 league goals in their most prolific season. How to describe this turnaround in his life? Igor Thiago has an easy explanation. “I would describe it as a lot of hard work. I think that everything God has planned for my life, has given me this year at Brentford, is something I hadn’t experienced yet in my career,” he says. Continue reading...",
      "publishedAt": "2026-01-16T17:00:02.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Stand up, if you love Afcon! Caf decision baffling after vintage edition",
      "link": "https://www.theguardian.com/football/2026/jan/16/africa-cup-of-nations-football-daily-newsletter",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! The 2025 Africa Cup of Nations reaches its big finale in 2026 on Sunday, having rolled on through the annual festive time warp, outlasting Enzo Maresca, Ruben Amorim and Ryan Mason Xabi Alonso. Some Premier League teams will have played games in four different competitions by the time they welcome their players home. Wedged into the domestic calendar’s most crowded months, Afcon can get overlooked and more’s the pity, because the 2025-26 tournament has been a vintage edition. The group stage may have lacked big surprises but was still packed with late twists, ridiculous goals and dramatic storylines. Two different coaches named Cameroon squads amid a pre-tournament power struggle; their first opponents, Gabon, were disbanded by their government after going out early (a decision quietly reversed this week). Sudan and Mozambique earned historic victories, bringing light to fans suffering through conflict. We were introduced to Kuka Mboladinga, the sharply-dressed, statuesque DR Congo fan who we all hope will make it to next summer’s Geopolitics World Cup. Re: yesterday’s Football Daily. When will the Football League realise that a one-legged Carling Cup semi-final tie at a neutral (non-Wembley) ground would be mint?” – Francis Fowles. After turning Manchester United into a joke in record time, Big Sir Jim’s now providing moral support for his players (yesterday’s News, Bits and Bobs, full email edition). How about support for the supporters, starting with profuse apologies?” – JJ Zucal. I read Kachilapo Mulongoti’s letter (yesterday’s Football Daily letters) with great interest, complaining about the ‘many jokes’ in the publication. As a long-time subscriber, I fear I’ve been reading a different tea-timely football-related email. There’s a version with jokes? Please sign me up” – Mike Wilner (and 1,056 others). Positioning one letter starting with the word ‘congratulations’ after another signed off from Harry Webb (yesterday’s letters)? And on the day when you’re certain to be bombarded with 1,057 letters asking where the jokes are? Chapeau” – Tim Grey. This is an extract from our daily football email … Football Daily. To get the full version, just visit this page and follow the instructions. Continue reading...",
      "publishedAt": "2026-01-16T16:17:19.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Cadillac debut first F1 car on track at Silverstone",
      "link": "https://www.skysports.com/f1/news/12040/13495087/cadillac-f1-team-hit-track-for-first-time-as-2026-car-given-debut-in-silverstone-shakedown-ahead-of-pre-season-testing",
      "summary": "The new Cadillac team gave its first Formula 1 car a maiden track run in a shakedown at Silverstone on Friday.",
      "publishedAt": "2026-01-16T16:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool keeper gets six-game ban after racism claim",
      "link": "https://www.bbc.com/sport/football/articles/c0jv9xlzldpo?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool goalkeeper Rafaela Borggrafe receives a six-game ban for using discriminatory language towards a team-mate.",
      "publishedAt": "2026-01-16T16:01:35.000Z"
    }
  ]
}