{
  "generatedAt": "2026-01-02T10:26:12.113Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Feyenoord-aanvaller Diarra verlaat Afrika Cup met blessure",
      "link": "https://www.vi.nl/nieuws/feyenoord-aanvaller-diarra-verlaat-afrika-cup-met-blessure",
      "summary": "Voor Feyenoord-aanvaller Gaoussou Diarra zit de Afrika Cup erop. De buitenspeler liep een enkelblessure op de training op en is de rest van het toernooi niet meer inzetbaar voor Mali.",
      "publishedAt": "2026-01-02T10:19:20.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Is Gyokeres struggling to adapt or being misused?",
      "link": "https://www.bbc.com/sport/articles/c8e5ll3r574o?at_medium=RSS&at_campaign=rss",
      "summary": "Viktor Gyokeres joined Arsenal as Europe's most prolific goalscorer - so why have his numbers dropped so drastically?",
      "publishedAt": "2026-01-02T10:15:03.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie neemt deze acht jeugdspelers mee op trainingskamp in Spanje",
      "link": "https://www.vi.nl/nieuws/van-persie-neemt-deze-acht-jeugdspelers-mee-op-trainingskamp-in-spanje",
      "summary": "Feyenoord begint vrijdag aan de voorbereiding op de tweede seizoenshelft. De Rotterdammers vliegen naar Marbella, waar een trainingskamp belegd wordt. Trainer Robin van Persie neemt acht jeugdspelers mee naar Spanje.",
      "publishedAt": "2026-01-02T10:09:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Mazraoui gekozen in beste elftal van groepsfase Afrika Cup",
      "link": "https://www.vi.nl/nieuws/mazraoui-gekozen-in-beste-elftal-van-groepsfase-afrika-cup",
      "summary": "Noussair Mazraoui is gekozen in het beste team van de groepsfase van de Afrika Cup. Samen met Brahim Díaz en Yahia Attiat-Allah El Abdi heeft hij vanuit gastland Marokko een plek gekregen in het elftal, met daarin verder onder anderen Sadio Mané, Riyad Mahrez en Amad Diallo.",
      "publishedAt": "2026-01-02T10:09:12.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea manager latest, transfer updates and more: football news – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/02/chelsea-manager-latest-premier-league-buildup-and-more-football-news-live",
      "summary": "⚽ Read Jacob Steinberg on Maresca’s Chelsea departure ⚽ Fixtures | Tables | Follow us on Bluesky | Email Taha Who was at a game yesterday? Commiserations to those at the Gtech Stadium for that Brentford-Spurs stinker, and Liverpool v Leeds wasn’t exactly a barrel of fun either. Sunderland (and Arsenal) fans will have enjoyed their own stalemate rather more though. Meanwhile Ipswich are coming up on the rails in the Championship promotion race and Bristol City filled their boots in a 5-0 romp against Portsmouth. Here’s some accounts of yesterday’s action: Continue reading...",
      "publishedAt": "2026-01-02T10:08:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Waarom AZ het gokje aandurft met Ayoub Oufkir",
      "link": "https://www.vi.nl/pro/dit-is-waarom-az-het-gokje-aandurft-met-ayoub-oufkir",
      "summary": "Terwijl Kees Smit, het huidige pareltje in de AZ-selectie, op de interesse mag rekenen van zowat de gehele wereldtop, hopen de Alkmaarders in 2026 een nieuwe parel te hebben gevonden. Ayoub Oufkir (19), die zich afgelopen zomer nog samen met Smit tot Europees kampioen mocht kronen bij Oranje Onder-19, maakt voor naar verluidt zo'n 5 miljoen euro de overstap van Sparta. VI PRO bekeek daarom alle speelminuten van Oufkir in 2025/26 nogmaals terug, om het spel van de talentvolle linkspoot te beoordelen. Video-analyse van een buitenspeler met geweldige voorwaarden, maar duidelijke verbeterpunten.",
      "publishedAt": "2026-01-02T10:07:59.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Venus Williams, 45, receives wildcard entry for Australian Open",
      "link": "https://www.skysports.com/tennis/news/12040/13489606/australian-open-venus-williams-45-receives-wildcard-entry-for-first-melbourne-grand-slam-appearance-in-five-years",
      "summary": "Venus Williams will return to the Australian ‌Open after receiving a wildcard entry, the tournament's organisers said ​on Friday, marking her first appearance at Melbourne ⁠Park in five years.",
      "publishedAt": "2026-01-02T09:53:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Mohamed Salah in line for Roma return?",
      "link": "https://www.theguardian.com/football/2026/jan/02/football-transfer-rumour-mill-mohamed-salah-roma-return",
      "summary": "Today’s fluff has a dusty war chest Two days in, and we have our first piece of Mohamed Salah transfer jabber. Reports in Italy suggest Liverpool’s unsettled forward could be Roma-bound. According to La Repubblica, the Giallorossi are keen to bring Salah back to the club he played for in 2015-17 but are unlikely to move for him until the summer. If he does hang around at Anfield for any length of time, Salah could have a new teammate in the form of the Club Brugge central defender Joel Ordóñez. The Mirror suggests Liverpool are set to shell out an initial £35m rising to £43m for the Ecuador international. The Premier League champions have a clearer run at a deal too now that Chelsea have withdrawn their interest. The furiously energetic Conor Gallagher has been kicking his heels of late, having started only four league games for Atlético Madrid this season, and is thus attracting interest from Premier League clubs looking to rev up their midfields. Manchester United were linked with him in the summer and are thought to be still sniffing around, though Tottenham are also said to be keen. Atlético will want at least £26m for the English midfielder, who’s under contract until 2029. Continue reading...",
      "publishedAt": "2026-01-02T09:38:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transferdeadlines Eredivisie en topcompetities: wanneer opent en sluit de markt?",
      "link": "https://www.vi.nl/nieuws/transferdeadlines-eredivisie-en-topcompetities-wanneer-opent-en-sluit-de-markt",
      "summary": "Het seizoen is halverwege en dat houdt in dat clubs de kans krijgen om tussentijds spelers te kopen en/of verkopen. De transferwindow opent begin januari 2026 en duurt een maand. Een overzicht van de transferwindows in de Eredivisie, Premier League, Serie A, La Liga, Bundesliga en Ligue 1.",
      "publishedAt": "2026-01-02T09:32:50.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'It's an easy decision' | Did Romero escape a red card?",
      "link": "https://www.skysports.com/watch/video/13489600/brentford-vs-tottenam-hotspur-ref-watch-did-cristian-romero-escape-a-red-card-for-foul-on-igor-thiago",
      "summary": "On Ref Watch, Dermot Gallagher gives his verdict on whether Cristian Romero escaped a red card for a foul on Brentford's' Igor Thiago.",
      "publishedAt": "2026-01-02T09:27:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "WSL latest: London City Lionesses appoint Maestre as head coach",
      "link": "https://www.skysports.com/football/live-blog/12040/13208899/wsl-news-transfers-rumours-gossip-and-womens-football-latest",
      "summary": "",
      "publishedAt": "2026-01-02T09:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McIlroy: Ryder Cup crowd worst I've ever known - 'Bradley could have done more'",
      "link": "https://www.skysports.com/golf/news/12040/13489597/rory-mcilroy-ryder-cup-crowd-at-bethpage-black-worst-ive-experienced-keegan-bradley-could-have-done-more",
      "summary": "Rory McIlroy said the Ryder Cup crowd at Bethpage Black was \"by far the worst\" he has experienced, saying USA captain Keegan Bradley \"could have done more\".",
      "publishedAt": "2026-01-02T09:17:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'One Arsenal got away with' | Should Merino have been sent off for Rogers foul?",
      "link": "https://www.skysports.com/watch/video/13489593/ref-watch-should-mikel-merino-been-sent-off-for-morgan-rogers-foul",
      "summary": "The Ref Watch panel agree Mikel Merino should have received a second yellow for pulling back Morgan Rogers during Arsenal's win over Aston Villa.",
      "publishedAt": "2026-01-02T09:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The Guardian Footballer of the Year Jess Carter: ‘I remember not wanting to go out’",
      "link": "https://www.theguardian.com/football/2026/jan/02/the-guardian-footballer-of-the-year-jess-carter-england-interview",
      "summary": "England defender publicly confronted racist abuse at the Euros and ended 2025 a title winner with club and country The Guardian Footballer of the Year is an award given to a player who has done something remarkable, whether by overcoming adversity, helping others or setting a sporting example by acting with exceptional honesty. Jess Carter has spent her life grappling with when to hold back and when to speak up; wrestling with being naturally herself, embodying the characteristics her parents instilled in her of being open, honest, vocal and confident, and subduing herself because, while society values those traits, in a black woman they can be viewed negatively. Continue reading...",
      "publishedAt": "2026-01-02T08:00:05.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Retiring from football is difficult – that’s why I want to help players learn from my experiences | David Wheeler",
      "link": "https://www.theguardian.com/football/2026/jan/02/retiring-from-football-david-wheeler",
      "summary": "Football provided direction, belonging, purpose and validation. Letting go of that has meant confronting the void left behind Accepting retirement from professional football has felt like stepping into a landscape shaped by loss and uncertainty. Even when the decision is rational, even when the body is signalling that it’s time, there is something profoundly emotional about acknowledging that an era of your life has ended. To me, it felt very much like grief. The shock, sadness, anger, confusion and numbness mirror the emotional responses that accompany any major loss I’ve experienced. But instead of mourning the loss of a loved one, you are mourning the loss of a part of you – a big part. For years football provided direction, belonging, inspiration, purpose and validation. A sense of being part of something bigger. Continue reading...",
      "publishedAt": "2026-01-02T08:00:04.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Best bargain' Kamara at heart of Aston Villa success",
      "link": "https://www.bbc.com/sport/football/articles/czdg84m99vvo?at_medium=RSS&at_campaign=rss",
      "summary": "Boubacar Kamara is Aston Villa's unassuming star and has quietly evolved into one of the best midfielders in the Premier League.",
      "publishedAt": "2026-01-02T07:54:37.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea confirm Maresca exit amid poor PL run",
      "link": "https://www.espn.com/soccer/story/_/id/47469870/chelsea-confirm-enzo-maresca-exit-amid-poor-premier-league-run-breakdown-relations",
      "summary": "Chelsea confirmed Thursday they have parted ways with manager Enzo Maresca ahead of Sunday's game against Manchester City.",
      "publishedAt": "2026-01-01T23:36:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep says Rodri 'changed the game' in City return",
      "link": "https://www.espn.com/soccer/story/_/id/47475444/guardiola-rodri-manchester-city-return",
      "summary": "Pep Guardiola said Rodri showed Manchester City what they have been missing for a year and a half after the Ballon d'Or winner's substitute performance during a goalless draw at Sunderland.",
      "publishedAt": "2026-01-01T23:36:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool disappointed as unbeaten run goes to 8",
      "link": "https://www.espn.com/soccer/story/_/id/47474640/liverpool-disappointed-unbeaten-run-8-leeds-draw",
      "summary": "Arne Slot described Liverpool's 0-0 draw with Leeds United as a \"disappointment\" despite his team extending their unbeaten run to eight games in all competitions.",
      "publishedAt": "2026-01-01T23:36:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "City lose ground to Arsenal with Sunderland draw",
      "link": "https://www.espn.com/soccer/report/_/gameId/740784",
      "summary": "Sunderland extended their unbeaten Premier League home record to 10 games after holding Manchester City to a goalless draw.",
      "publishedAt": "2026-01-01T23:36:34.000Z"
    }
  ]
}