[
  {
    "id": 1,
    "title": "Spectaculaire topper in de Jupiler Pro League",
    "teaser": "In de topper tussen Club Brugge en Union SG gebeurde er van alles: vijf doelpunten, een rode kaart en een late beslissing.",
    "content": "In de topper tussen Club Brugge en Union SG gebeurde er van alles. In de eerste helft trok Club Brugge het initiatief naar zich toe, maar Union bleef gevaarlijk in de omschakeling. Na de rust viel de wedstrijd helemaal open met drie doelpunten op een kwartier tijd. Een late treffer besliste uiteindelijk de partij in het voordeel van Club Brugge. De drie punten zijn belangrijk in de strijd om de bovenste plaatsen.\n\nBeide trainers waren het erover eens dat het publiek de grote winnaar was na een avond vol intensiteit, kansen en emoties.",
    "competition": "Jupiler Pro League",
    "date": "2025-11-22",
    "image": "jpl_topper_club_union.jpg"
  },
  {
    "id": 2,
    "title": "Stunt in de Eredivisie: promovendus verrast titelkandidaat",
    "teaser": "Een promovendus zorgt voor een verrassing door een van de titelkandidaten in eigen huis te kloppen.",
    "content": "In de Eredivisie heeft een promovendus voor een enorme stunt gezorgd door een titelkandidaat in eigen huis te verslaan. Al vroeg in de wedstrijd kwam de thuisploeg op achterstand na een snelle counter. De favoriet drukte nadien wel, maar vond geen weg voorbij de sterk keepende doelman.\n\nNa de rust verdubbelde de promovendus de score na een perfect uitgespeelde hoekschop. Ondanks een late aansluitingstreffer bleef een gelijkmaker uit. Deze uitslag kan grote gevolgen hebben voor de strijd om de titel en Europese tickets.",
    "competition": "Eredivisie",
    "date": "2025-11-21",
    "image": "eredivisie_stunt_promovendus.jpg"
  },
  {
    "id": 3,
    "title": "Rode Duivels testen nieuwe systeem in oefeninterland",
    "teaser": "De bondscoach probeert een nieuw spelsysteem uit tegen een sterke tegenstander in aanloop naar het volgende toernooi.",
    "content": "De Rode Duivels hebben in een oefeninterland een nieuw spelsysteem getest met drie centrale verdedigers en aanvallende wingbacks. In de beginfase was het zoeken naar de juiste posities, maar gaandeweg kreeg de ploeg meer controle over de wedstrijd.\n\nDe bondscoach toonde zich na afloop tevreden over de progressie, maar benadrukte dat er nog werk aan de winkel is. De komende interlands zullen gebruikt worden om het systeem verder te verfijnen richting het volgende eindtoernooi.",
    "competition": "Rode Duivels",
    "date": "2025-11-19",
    "image": "rode_duivels_oefenmatch.jpg"
  },
  {
    "id": 4,
    "title": "Oranje wint topper in de Nations League",
    "teaser": "Het Nederlands elftal pakt drie belangrijke punten na een volwassen prestatie tegen een topland.",
    "content": "Oranje heeft in de Nations League drie belangrijke punten gepakt na een volwassen prestatie tegen een Europese topploeg. In de eerste helft hield Nederland de ruimtes klein en loerde het op snelle counters. Na de rust durfde de ploeg meer vooruit te voetballen, wat uiteindelijk beloond werd met een knappe treffer net buiten de zestien.\n\nDe zege zorgt voor een sterke uitgangspositie in de groep en geeft vertrouwen richting de volgende interlands.",
    "competition": "Oranje",
    "date": "2025-11-18",
    "image": "oranje_nations_league.jpg"
  },
  {
    "id": 5,
    "title": "Drukke wintermercato: opvallende transfers in Vlaanderen",
    "teaser": "Heel wat clubs in Vlaanderen roeren zich op de wintermercato met gerichte versterkingen.",
    "content": "De wintermercato in Vlaanderen is volop aan de gang en verschillende clubs hebben zich al versterkt. Heel wat teams uit de hoogste amateurreeksen en provinciale afdelingen haalden ervaren spelers binnen om hun ambities kracht bij te zetten.\n\nOok bij de jeugd zien we beweging: jonge talenten maken de overstap naar opleidingsclubs waar de doorstroming naar eerste elftallen centraal staat. De komende weken worden nog meer verschuivingen verwacht.",
    "competition": "Transfernieuws Vlaanderen",
    "date": "2025-11-15",
    "image": "transfer_vlaanderen.jpg"
  },
  {
    "id": 6,
    "title": "Transfergeruchten in Nederland: spits op weg naar topclub",
    "teaser": "In Nederland doen sterke geruchten de ronde over een mogelijke toptransfer van een trefzekere spits.",
    "content": "In Nederland doen sterke geruchten de ronde over een mogelijke toptransfer van een trefzekere spits uit de Keuken Kampioen Divisie naar een club uit de Eredivisie. De speler zelf houdt de lippen stijf op elkaar, maar verschillende media melden dat de onderhandelingen in een vergevorderd stadium zijn.\n\nMocht de transfer rondkomen, dan zou het een belangrijke stap betekenen in de carrière van de aanvaller en een stevige kwaliteitsinjectie voor de aanvallende linie van de topclub.",
    "competition": "Transfernieuws Nederland",
    "date": "2025-11-14",
    "image": "transfer_nederland_spits.jpg"
  },
  {
    "id": 7,
    "title": "Lokaal jeugdtoernooi in Vlaanderen trekt recordaantal ploegen",
    "teaser": "Een regionaal jeugdtornooi in Vlaanderen ontvangt meer ploegen dan ooit tevoren.",
    "content": "Een lokaal jeugdtoernooi in Vlaanderen heeft dit jaar een recordaantal inschrijvingen ontvangen. Teams uit verschillende provincies nemen deel, van U7 tot en met U15. De organisatie legt de nadruk op spelplezier, fair play en beleving voor spelers én ouders.\n\nVerschillende clubs grijpen het tornooi aan om hun jeugdwerking in de kijker te zetten en nieuwe spelers aan te trekken voor het volgende seizoen.",
    "competition": "Lagere klassen Vlaanderen",
    "date": "2025-11-10",
    "image": "jeugdtornooi_vlaanderen.jpg"
  },
  {
    "id": 8,
    "title": "Derby in de lagere klassen van Nederland zorgt voor spektakel",
    "teaser": "In de lagere reeksen van Nederland eindigt een burenderby in een doelpuntenfestijn.",
    "content": "In de lagere klassen van Nederland heeft een burenderby voor spektakel gezorgd. Voor een mooi gevuld sportpark vielen er maar liefst acht doelpunten. Beide ploegen speelden vol op de aanval, waardoor het publiek een doelpuntenfestijn voorgeschoteld kreeg.\n\nOndanks de spanning op het veld bleef de sfeer naast het veld sportief. De derby onderstreept opnieuw het belang en de charme van amateurvoetbal in de regio.",
    "competition": "Lagere klassen Nederland",
    "date": "2025-11-09",
    "image": "derby_lagere_klasse_nl.jpg"
  },
  {
    "id": 9,
    "title": "Belgische en Nederlandse clubs testen gezamenlijke stage",
    "teaser": "Een Vlaamse en een Nederlandse club organiseren samen een voorbereidingsstage met oefenwedstrijden.",
    "content": "Een Vlaamse en een Nederlandse club hebben de handen in elkaar geslagen om een gezamenlijke voorbereidingsstage te organiseren. Tijdens enkele dagen trainen de selecties op hetzelfde complex en worden er onderlinge oefenwedstrijden gespeeld.\n\nDe samenwerking moet zorgen voor extra prikkels voor de spelers en een betere uitwisseling van ideeën tussen trainersstaven. Beide clubs staan open voor herhaling in de toekomst.",
    "competition": "Internationaal clubnieuws",
    "date": "2025-11-07",
    "image": "gezamenlijke_stage_be_nl.jpg"
  },
  {
    "id": 10,
    "title": "Opvallende statistieken: jeugd krijgt meer kansen in eerste elftallen",
    "teaser": "Steeds meer clubs geven minuten aan eigen jeugd in hun eerste elftal, zowel in Vlaanderen als in Nederland.",
    "content": "Uit een analyse van verschillende competities blijkt dat clubs in Vlaanderen en Nederland meer minuten geven aan spelers uit de eigen jeugdopleiding. Zowel in de hoogste afdelingen als in de amateurreeksen zien we jonge spelers doorstromen naar de eerste ploeg.\n\nTrainers geven aan dat de combinatie van doorstroming, financiële realiteit en identiteit van de club een belangrijke rol speelt. Voor jongeren is het een extra motivatie om hard te blijven werken in de jeugdopleiding.",
    "competition": "Jeugd & ontwikkeling",
    "date": "2025-11-05",
    "image": "jeugd_krijgt_kansen.jpg"
  }
]
