{
  "generatedAt": "2026-01-14T14:29:30.266Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Erik ten Hag komt met gevoel en vooral ambitie thuis: 'Ik leef mijn eigen leven'",
      "link": "https://www.vi.nl/pro/erik-ten-hag-komt-met-gevoel-en-vooral-ambitie-thuis-ik-leef-mijn-eigen-leven",
      "summary": "Vol trots presenteerde FC Twente woensdagochtend Erik ten Hag als nieuwe technisch directeur. Het zorgde voor een vleugje romantiek over het verleden, maar vooral voor een ambitieuze blik naar de toekomst. En met een intrigerende wending: ‘Als Erik bondscoach zou willen worden, gaan we kijken hoe we dat mogelijk kunnen maken.’",
      "publishedAt": "2026-01-14T14:22:13.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Delay in disallowed Semenyo goal an 'edge case'",
      "link": "https://www.espn.com/soccer/story/_/id/47607499/delay-disallowed-antoine-semenyo-goal-due-lack-offside-technology",
      "summary": "The delay in ruling out a Manchester City goal for offside in Tuesday's Carabao Cup win at Newcastle was extended because semi-automated offside technology could not be used in the incident.",
      "publishedAt": "2026-01-14T14:15:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City sign USWNT's Coffey from Thorns",
      "link": "https://www.espn.com/soccer/story/_/id/47608248/man-city-sign-uswnt-sam-coffey-portland-thorns",
      "summary": "Manchester City have announced the signing of United States midfielder Sam Coffey from NWSL side Portland Thorns.",
      "publishedAt": "2026-01-14T14:15:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Police on ban of Maccabi fans: AI was to blame",
      "link": "https://www.espn.com/soccer/story/_/id/47607667/police-chief-apologises-ai-error-helped-form-maccabi-tel-aviv-fan-ban-decision",
      "summary": "West Midlands Police's chief constable has apologised to MPs for giving them an error in evidence over the decision to ban Maccabi Tel Aviv fans.",
      "publishedAt": "2026-01-14T14:15:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Barcelona's Flick: Alonso has great future ahead",
      "link": "https://www.espn.com/soccer/story/_/id/47608316/barcelona-hansi-flick-backs-xabi-alonso-land-new-role",
      "summary": "Barcelona coach Hansi Flick said Xabi Alonso will land a new job quickly, backing the outgoing Real Madrid coach to have a great career in management.",
      "publishedAt": "2026-01-14T14:15:41.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Malen zegt 'ja' tegen AS Roma, mogelijk debuut tegen Torino",
      "link": "https://www.vi.nl/nieuws/malen-zegt-ja-tegen-as-roma-mogelijk-debuut-tegen-torino",
      "summary": "De transfer van Donyell Malen naar AS Roma nadert zijn voltooiing. Na het akkoord met Aston Villa hebben de Italianen ook groen licht gekregen van de 26-jarige aanvaller. Het wachten is nog op de medische keuring.",
      "publishedAt": "2026-01-14T14:12:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The Coupe de France was short of magic – and then Paris FC beat PSG",
      "link": "https://www.theguardian.com/football/2026/jan/14/coupe-de-france-magic-paris-fc-beat-psg-favourites-holders-underdogs",
      "summary": "In a weekend where most favourites triumphed, Paris FC beating the holders was a welcome win for the underdogs By Get French Football News This year’s Coupe de France was in need of a spark and Paris FC were on hand to provide it. Their league match against Paris Saint-Germain last weekend – the first derby between the clubs in 43 years – was somewhat anticlimactic. The rivalry between is tepid, bordering on amicable, and the difference in quality was stark as PSG ran out fairly comfortable 2-1 winners. Stéphane Gilli’s men are a long way off challenging the reigning European champions over a full season but, on Monday night, that was irrelevant. Paris FC returned to the Parc des Princes and won 1-0, progressing to the last 16 of the Coupe de France at their neighbour’s expense. It was a derby once again lacking in derby feel. Jonathan Ikoné scored the winner but did not celebrate against the club from whose academy he graduated. Luis Enrique even wished Paris FC “all the best for the rest of the competition” after the match – all very cordial. The PSG manager was left ruing his side’s wastefulness as he succumbed to his first defeat in the competition since arriving in France in 2023. As far as the cup is concerned, though, PSG’s slip-up was a welcome one. Continue reading...",
      "publishedAt": "2026-01-14T14:04:55.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Paratici talks of ‘need to be based’ in Italy as move from Spurs to Fiorentina confirmed",
      "link": "https://www.theguardian.com/football/2026/jan/14/fabio-paratici-spurs-to-fiorentina-confirmed-sporting-director-january-transfer-window",
      "summary": "Co-sporting director to go after January transfer window Paratici returned full-time to Spurs in mid-October Fabio Paratici will leave his post as Tottenham’s joint sporting director after the closure of the January transfer window to take up a similar recruitment job at Fiorentina. The Italian came back to Spurs on a full-time basis in mid-October to work alongside Johan Lange, who was promoted from his role of technical director. Paratici had been Spurs’s managing director of football between 2021 and 2023 before resigning after a Fifa ban for alleged financial malpractice during his time at Juventus. After an appeal, he was allowed to act for Spurs on a consultancy basis. Continue reading...",
      "publishedAt": "2026-01-14T13:57:14.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Het plan dat Ajax heeft voor Ibrahimovic Junior",
      "link": "https://www.vi.nl/pro/het-plan-dat-ajax-heeft-voor-ibrahimovic-junior",
      "summary": "Ruim 21 jaar na het vertrek van Zlatan heeft Ajax weer een Ibrahimovic in de gelederen. Maximilian Ibrahimovic (19) komt op huurbasis over van AC Milan, met de kans om een meerjarig contract te verdienen in Amsterdam. Wat kunnen beide partijen van elkaar verwachten?",
      "publishedAt": "2026-01-14T13:49:45.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League's top 50 transfers of all time: Who is No. 1?",
      "link": "https://www.espn.com/soccer/story/_/id/47600750/premier-league-top-transfers-all-bill-connelly",
      "summary": "What makes a great signing? Is it trophies won, goals scored, a long run of dominance ... or all of the above? Bill Connelly breaks down the best 50 Premier League moves since it began in 1992-93.",
      "publishedAt": "2026-01-14T13:43:01.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Bankzaken: toekomst Vitesse blijft vaag en onzeker",
      "link": "https://www.vi.nl/pro/fc-bankzaken-toekomst-vitesse-blijft-vaag-en-onzeker",
      "summary": "In de serie FC Bankzaken bespreekt Tom Knipping samen met presentator Bart Frouws de financiën in het binnen- en buitenlandse voetbal. In deze aflevering gaan de heren dieper in op de financiële situatie van Vitesse.",
      "publishedAt": "2026-01-14T13:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs sporting director Paratici to join Fiorentina",
      "link": "https://www.skysports.com/football/news/12040/13494214/fabio-paratici-tottenham-sporting-director-to-leave-club-just-three-months-after-returning",
      "summary": "Tottenham's joint sporting director Fabio Paratici is to leave the club and join Fiorentina following the end of the January transfer window, three months after returning to the club.",
      "publishedAt": "2026-01-14T13:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Olympique Marseille ziet komst El Karouani wel zitten'",
      "link": "https://www.vi.nl/nieuws/kees-smit-houdt-regie-over-eigen-carri-re",
      "summary": "De winterse transfermarkt is geopend. In dit blog vind je alle speculaties en bevestigde transfers in Nederland. Bekijk hier ons blog voor de transferperikelen in het buitenland.",
      "publishedAt": "2026-01-14T13:13:07.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Palace latest: Eagles in talks to sign Ligue 1 forward",
      "link": "https://www.skysports.com/football/live-blog/12040/13279298/crystal-palace-transfers-latest-news-rumours-and-gossip-live-updates-goals-and-highlights",
      "summary": "",
      "publishedAt": "2026-01-14T13:04:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City sign USA midfielder Coffey",
      "link": "https://www.bbc.com/sport/football/articles/c0mkw481p8vo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City have signed United States midfielder Sam Coffey from Portland Thorns on a three-and-a-half-year contract.",
      "publishedAt": "2026-01-14T13:03:44.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Fleetwood determined to close the gap on McIlroy and Scheffler",
      "link": "https://www.skysports.com/golf/news/12040/13494202/tommy-fleetwood-an-honour-to-be-next-best-to-scottie-scheffler-and-rory-mcilroy-but-have-some-catching-up-to-do",
      "summary": "Dubai Invitational defending champion, Tommy Fleetwood, revealed what it is like to be next-best to two of the Tour's greatest players after a year of consistency paid off and he moved up the rankings to third.",
      "publishedAt": "2026-01-14T12:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Woods: Koepka's return to PGA Tour from LIV a 'win for everyone'",
      "link": "https://www.skysports.com/golf/news/12040/13494188/tiger-woods-brooks-koepkas-return-to-pga-tour-from-liv-golf-a-win-for-everyone",
      "summary": "Tiger Woods said Brooks Koepka's return to the PGA Tour makes it \"a better place to play\" and is a \"win for everyone\".",
      "publishedAt": "2026-01-14T12:07:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rangers agree loan for Wolfsburg winger Skov Olsen",
      "link": "https://www.skysports.com/football/news/12040/13494156/andreas-skov-olsen-rangers-agree-loan-deal-for-wolfsburg-winger-which-includes-option-to-buy-in-summer",
      "summary": "Rangers have agreed a loan deal for Wolfsburg winger Andreas Skov Olsen.",
      "publishedAt": "2026-01-14T11:16:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We're really stretched' - Livramento blow adds to Newcastle defence concerns",
      "link": "https://www.bbc.com/sport/football/articles/c78e49x5j0do?at_medium=RSS&at_campaign=rss",
      "summary": "Head coach Eddie Howe admits Newcastle United are \"really stretched\" after Tino Livramento is ruled out for up to two months with a hamstring injury.",
      "publishedAt": "2026-01-14T10:14:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Pro Licence admission barriers allow women’s coaching opportunities to go ‘down the drain’",
      "link": "https://www.theguardian.com/football/2026/jan/14/womens-football-coaching-pro-license-uefa",
      "summary": "Uefa’s limitations have set hurdles for women keen to take the next step in coaching despite the increasing demand Mariana Cabral has a coaching CV to be proud of. Born on the small Azores island of São Miguel, she has been in charge of the women’s teams at clubs including Benfica and Sporting, but the 38-year-old is frustrated. “We want more women coaches,” she says. “Who won the Euros? Who won the Champions League? Women – but we are losing so many.” Cabral has her A Licence but is stuck in limbo. Unable to get on a Pro Licence course that would clear a path to more senior head coach roles in an era when women’s teams are increasingly demanding that qualification, she stepped back to become a No 2 in the US. But after one NWSL season with Utah Royals, she left in December in the hope that expanding her experience at another club would help to open a Pro Licence door. Continue reading...",
      "publishedAt": "2026-01-14T10:05:17.000Z"
    }
  ]
}