{
  "generatedAt": "2026-01-07T09:32:13.616Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hoelang blijft Ten Hag een technisch directeur?",
      "link": "https://www.vi.nl/video/hoelang-blijft-ten-hag-een-technisch-directeur",
      "summary": "In de nieuwe VI ZSM gaan Sander Janssen en Jarno Verweij dieper in op de aanstelling van Erik ten Hag als technisch directeur van FC Twente. Verder bespreken de heren ook een aantal wintertransfers en de opmerkelijke speelwijze van Liam Rosenior, de nieuwe manager van Chelsea.",
      "publishedAt": "2026-01-07T09:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Kassa voor voetbalmakelaars: 2025 was een uiterst lucratief jaar",
      "link": "https://www.vi.nl/nieuws/kassa-voor-voetbalmakelaars-2025-was-een-uiterst-lucratief-jaar",
      "summary": "2025 was een recordjaar voor declarerende zaakwaarnemers. Dat heeft de FIFA becijferd. Clubs betaalde 1,16 miljard euro aan tussenpersonen die bemiddelen bij transfers. Dat was een toename van negentig procent ten opzichte van 2024.",
      "publishedAt": "2026-01-07T09:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Groningen: een enorm compliment en een belangrijk verbeterpunt",
      "link": "https://www.vi.nl/pro/fc-groningen-een-enorm-compliment-en-een-belangrijk-verbeterpunt",
      "summary": "Na een relatief korte winterstop gaat vrijdag de Eredivisie weer verder. Tot diep in maart is er elk weekeinde een speelronde. Met andere woorden: het cruciale deel van het seizoen gaat beginnen. In deze serie maken we bij elke club de balans op, waarbij we wat betreft de volgorde uitgaan van de eerste speelronde van 2026. Deze keer: FC Groningen.",
      "publishedAt": "2026-01-07T09:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Jones continues winning streak with incredible comeback win in Auckland",
      "link": "https://www.skysports.com/tennis/news/12040/13491392/fran-jones-follows-up-her-career-best-win-by-battling-through-to-asb-classic-quarter-finals-in-auckland",
      "summary": "Fran Jones followed up her career-best win over Emma Navarro by reaching the quarter-finals of the ASB Classic in Auckland.",
      "publishedAt": "2026-01-07T08:57:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Glasner: No time for Utd links, Guehi may join City",
      "link": "https://www.espn.com/soccer/story/_/id/47536863/oliver-glasner-man-united-manager-marc-guehi-man-city-transfer-crystal-palace",
      "summary": "Crystal Palace coach Oliver Glasner is unbothered by links with the Manchester United job and admitted that captain Marc Guéhi could join Manchester City.",
      "publishedAt": "2026-01-07T08:55:54.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United approach Carrick, Solskjaer",
      "link": "https://www.espn.com/soccer/story/_/id/47527700/man-united-approach-ole-gunnar-solskjaer-michael-carrick-interim-role",
      "summary": "Manchester United have held \"early-stage informal talks\" with several potential interim managers, including Ole Gunnar Solskjaer and Michael Carrick, sources have told ESPN.",
      "publishedAt": "2026-01-07T08:55:09.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea name Rosenior as coach on 5½-year deal",
      "link": "https://www.espn.com/soccer/story/_/id/47523773/liam-rosenior-chelsea-appointment-strasbourg-exit-premier-league-manager",
      "summary": "Chelsea have announced the appointment of Liam Rosenior as their new head coach on a 5½-year contract.",
      "publishedAt": "2026-01-07T08:55:09.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Messi deelt toekomstplannen: 'Ik zie mezelf niet als een trainer'",
      "link": "https://www.vi.nl/nieuws/messi-deelt-toekomstplannen-ik-zie-mezelf-niet-als-een-trainer",
      "summary": "Lionel Messi (38) verwacht niet dat hij na zijn actieve carrière het trainersvak in zal gaan. De achtvoudig Ballon d'Or-winnaar, die bij Inter Miami nog een contract heeft tot medio 2028, ziet meer heil in een rol als clubeigenaar.",
      "publishedAt": "2026-01-07T08:41:48.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Dit is het schema van de kwartfinale van de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/dit-is-het-schema-van-de-kwartfinale-van-de-afrika-cup",
      "summary": "De achtste finales van de Afrika Cup zitten erop, wat betekent dat het tijd is voor de kwartfinales. Na twee rustdagen gaat het toernooi vrijdag verder. We zetten de wedstrijden op een rij.",
      "publishedAt": "2026-01-07T08:29:26.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "England’s Katie Robinson poised for shock move from Aston Villa to Bristol City",
      "link": "https://www.theguardian.com/football/2026/jan/07/katie-robinson-shock-move-aston-villa-bristol-city-lioness-transfer-window",
      "summary": "WSL2 side beat off competition for winger’s signature She started career at City and has been on loan at Everton The England winger Katie Robinson is poised to complete a shock move from Aston Villa to Bristol City, the Guardian understands, as the Women’s Super League 2 club make a significant signal of their ambition. The 23-year-old, who made her England debut in 2022, has – according to sources – completed a medical to return to the club where she started her career before establishing herself at Brighton. Robinson has five caps and was the youngest member of England’s squad at the 2023 World Cup, where they reached the final. Bristol City have fought off competition for her signature. Continue reading...",
      "publishedAt": "2026-01-07T08:18:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Liam Rosenior’s time at Strasbourg was ideal preparation for Chelsea",
      "link": "https://www.theguardian.com/football/2026/jan/07/liam-rosenior-strasbourg-ideal-preparation-chelsea-young-players-demands-owners",
      "summary": "The 41-year-old is at home with young players and, crucially, he is familiar with the demands of Chelsea’s owners By Get French Football News Liam Rosenior looks up at the towering Strasbourg Kop. He shouts and pleads as he points to his players, demanding the fans applaud them. Met with hostility, boos and jeers in the stands, he cuts a lone figure, one at pains to sow unity at a divided club. Strasbourg had just won the game, beating Le Havre 1-0 earlier this season, but the club’s fans were in no mood to celebrate. Behind an image are a thousand words, or three banners in this case. One called for the club president Marc Keller to leave Strasbourg; another criticised the bizarre Ishé Samuels-Smith back-and-forth transfer; and the one to which Rosenior took particular exception concerned his captain, Emmanuel Emegha. It read: “Emegha, pawn of BlueCo, after changing shirts, hand back your armband.” Emegha had agreed a deal to join Chelsea a few days earlier, once again confirming to Strasbourg fans that they were subservient to “big brother” Chelsea in the multi-club hierarchy. Continue reading...",
      "publishedAt": "2026-01-07T08:00:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No games, no league and now no City Football Group: Indian football faces up to ‘global embarrassment’",
      "link": "https://www.theguardian.com/football/2026/jan/07/no-games-no-league-city-football-group-indian-football-global-embarrassment-mumbai-city-manchester",
      "summary": "CFG have ditched Mumbai City and losing the glamour will hurt the game in the world’s most populated nation The world’s biggest multiclub network shrank from 13 to 12 in the last week of 2025 but few blame the City Football Group for walking away from Mumbai City and India after six years. The reason for divesting their shares which gave them 65% ownership was addressed, not that anyone needed enlightening in a statement. “CFG has made this decision after a comprehensive commercial review and in light of the ongoing uncertainty surrounding the future of the Indian Super League (ISL).” Uncertainty is an underestimation. The 2025-26 ISL season was supposed to kick off in September. However, with a 15-year Masters Right Agreement between the All India Football Federation (AIFF) and its commercial partner ending in December and no new agreement or partner in place, it never started. Most assumed that it would be a short-lived delay but here we are, in 2026, and there is still no football. A meeting took place in Delhi on Tuesday and produced a start date of 14 February, just six weeks short of a year since Mumbai’s last ISL game. How it works, if it works, remains to be seen. Continue reading...",
      "publishedAt": "2026-01-07T08:00:36.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "TGL golf: Horschel delivers winning putt to keep Atlanta undefeated",
      "link": "https://www.skysports.com/golf/news/12040/13491367/tgl-golf-billy-horschel-delivers-winning-putt-to-keep-atlanta-undefeated-as-league-announce-formation-of-wtgl",
      "summary": "Billy Horschel drained the decisive putt to give Atlanta Drive GC their seventh consecutive victory in a 7-4 win over The Bay Golf Club on Tuesday.",
      "publishedAt": "2026-01-07T07:14:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Nasser: England will regret not starting series with 'exceptional' Bethell",
      "link": "https://www.skysports.com/watch/video/13491375/ashes-nasser-hussain-believes-england-will-regret-not-starting-the-series-with-exceptional-jacob-bethell",
      "summary": "Nasser Hussain believes England will regret not starting the series with Jacob Bethell.",
      "publishedAt": "2026-01-07T07:13:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bethell hits sublime maiden Test ton to give England slim hope in Sydney",
      "link": "https://www.skysports.com/cricket/news/12040/13491358/the-ashes-jacob-bethell-hits-maiden-test-hundred-to-give-slim-hope-to-england-fightback-in-fifth-test-in-sydney",
      "summary": "Jacob Bethell scored a sublime maiden first-class century to give hope to an England fightback in the fifth Ashes Test in Sydney before a late wobble on the fourth evening left the tourists eight wickets down and with a lead of 119.",
      "publishedAt": "2026-01-07T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Fletcher on 'surreal' week, unbelievable Bruno and bringing positivity back to Man Utd",
      "link": "https://www.skysports.com/football/news/12040/13491294/darren-fletcher-man-utd-interim-boss-on-surreal-week-unbelievable-bruno-fernandes-and-bringing-positivity-back",
      "summary": "\"I best speak to Sir Alex.\"",
      "publishedAt": "2026-01-07T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Nobody can get hold of him' - what happened to David Batty?",
      "link": "https://www.bbc.com/sport/football/articles/cp9jn090kv2o?at_medium=RSS&at_campaign=rss",
      "summary": "England midfielder David Batty vowed to have \"nothing to do with the football industry\" after retirement. As his former clubs Newcastle and Leeds prepare to meet, BBC Sport asks: What happened to him?",
      "publishedAt": "2026-01-07T06:47:44.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Why Fletcher could be what Man Utd fans have been waiting for'",
      "link": "https://www.bbc.com/sport/football/articles/czdqllp9639o?at_medium=RSS&at_campaign=rss",
      "summary": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains why Manchester United's interim manager Darren Fletcher would be the perfect choice to take the job on a longer-term basis.",
      "publishedAt": "2026-01-07T06:28:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Who will be Man United's next manager? 12 top candidates to replace Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47516208/man-united-next-manager-12-candidates-replace-amorim",
      "summary": "Whether Manchester United aim to hire quickly or wait until summer, here are the coaches they could be after.",
      "publishedAt": "2026-01-07T04:00:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Man United sacked Amorim: Tactics, player issues, transfer frustration",
      "link": "https://www.espn.com/soccer/story/_/id/47514917/manchester-united-story-firing-ruben-amorim-analysis-rob-dawson",
      "summary": "Ruben Amorim was seen as a risky choice to lead Man United's rebuild. Here's how things broke down.",
      "publishedAt": "2026-01-07T04:00:52.000Z"
    }
  ]
}