{
  "generatedAt": "2026-01-09T06:39:45.000Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Martinelli zegt sorry na verhit en veelbesproken moment met geblesseerde Bradley",
      "link": "https://www.vi.nl/nieuws/martinelli-zegt-sorry-na-verhit-en-veelbesproken-moment-met-geblesseerde-bradley",
      "summary": "Gabriel Martinelli heeft zijn excuses aangeboden aan Liverpool-speler Conor Bradley na een incident in de slotfase van de wedstrijd. De Braziliaan van Arsenal betichtte Bradley van tijdrekken, maar had niet door dat de rechtsback daadwerkelijk geblesseerd was. Martinelli werd eerder al gesteund door de managers van Arsenal en Liverpool.",
      "publishedAt": "2026-01-09T06:28:09.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Rel tussen Simeone en Vinícius: 'Onthoud dit, Florentino gaat je ontslaan!'",
      "link": "https://www.vi.nl/nieuws/spanje-in-de-ban-van-vurige-woordenwisseling-tussen-vin-cius-en-simeone",
      "summary": "Real Madrid kwam donderdagavond als winnaar uit de strijd in de halve finale van de Spaanse Super Copa tegen Atlético Madrid ( 1-2 ), maar na afloop is Spanje vooral in de ban van de randzaken. Diego Simeone en Vinícius Júnior vochten eerst op en daarna buiten het veld een relletje uit.",
      "publishedAt": "2026-01-09T06:10:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Sepp en Rav van den Berg: broertjes, collega's en beste vrienden",
      "link": "https://www.vi.nl/pro/sepp-en-rav-van-den-berg-broertjes-collega-s-en-beste-vrienden",
      "summary": "Sepp en Rav van den Berg, 24 en 21 jaar, werken afzonderlijk en ­tegelijkertijd gezamenlijk aan hun voetbaldroom. De oudste voetbalt bij Brentford, de jongste bij 1. FC Köln. Hoe is het om als twee broers uit Zwolle door te breken in het buitenland? En hoe help je elkaar?",
      "publishedAt": "2026-01-09T06:09:24.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Luis Enrique na nieuwe prijs met PSG: 'Ik moet De Zerbi feliciteren'",
      "link": "https://www.vi.nl/nieuws/luis-enrique-na-nieuwe-prijs-met-psg-ik-moet-de-zerbi-feliciteren",
      "summary": "Het was Paris Saint-Germain dat donderdagavond beslag legde op de Trophée des Champions, maar na afloop feliciteerde de winnende trainer Luis Enrique de verliezende trainer Roberto De Zerbi. 'Hij is een zeer goede coach.'",
      "publishedAt": "2026-01-09T06:06:44.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Keep McCullum? Cook as assistant? - Questions for England after Ashes defeat",
      "link": "https://www.skysports.com/cricket/news/12040/13492183/the-ashes-questions-for-england-after-australia-defeat-should-brendon-mccullum-and-ben-stokes-stay-on-and-who-comes-into-test-team",
      "summary": "With England left to lick their wounds after yet another Ashes drubbing in Australia, we look at the most pressing questions facing the team as they address the fallout from their 4-1 series defeat...",
      "publishedAt": "2026-01-09T06:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Xabi slams Simeone shouts at Vini: 'Didn't like it'",
      "link": "https://www.espn.com/soccer/story/_/id/47552638/real-madrid-xabi-slams-simeone-comments-vinicius",
      "summary": "Xabi Alonso slammed Diego Simeone for his clash with Vinícius Júnior during Real Madrid's 2-1 Supercopa semifinal win over Atlético Madrid on Thursday, saying \"not anything goes.\"",
      "publishedAt": "2026-01-09T05:12:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool criticize Martinelli, fear for Bradley injury",
      "link": "https://www.espn.com/soccer/story/_/id/47553636/liverpool-unhappy-martinelli-fear-bradley",
      "summary": "Liverpool manager Arne Slot said Gabriel Martinelli's push on an injured Conor Bradley in his side's 0-0 draw with Arsenal on Thursday \"doesn't look great,\" adding that he feared for the extent of Bradley's injury.",
      "publishedAt": "2026-01-09T05:12:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Martinelli 'deeply sorry' for shoving injured Bradley",
      "link": "https://www.espn.com/soccer/story/_/id/47556803/gabriel-martinelli-issues-direct-apology-conor-bradley-incident",
      "summary": "Arsenal winger Gabriel Martinelli revealed he reached out to Conor Bradley to apologize for shoving the badly injured Liverpool defender off the pitch late in Thursday's 0-0 draw",
      "publishedAt": "2026-01-09T05:12:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Mourinho on shock loss: I hope players don't sleep",
      "link": "https://www.espn.com/soccer/story/_/id/47548211/jose-mourinho-hopes-benfica-players-sleep-braga-loss",
      "summary": "An angry Benfica coach Jose Mourinho hopes his players had a sleepless night after their shock defeat to Braga in the Portuguese Allianz Cup semifinal on Wednesday.",
      "publishedAt": "2026-01-09T05:12:49.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Idiot' or 'understandable'? Martinelli apologises for pushing Bradley",
      "link": "https://www.bbc.com/sport/football/articles/c5yv2j19q23o?at_medium=RSS&at_campaign=rss",
      "summary": "Arsenal's Gabriel Martinelli is criticised for pushing Conor Bradley while he was down injured - but Liverpool boss Arne Slot defends him.",
      "publishedAt": "2026-01-09T00:50:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal still in control of title race; Liverpool show they need to improve",
      "link": "https://www.espn.com/soccer/story/_/id/47553557/arsenal-control-title-race-liverpool-need-improvements",
      "summary": "Both Arsenal and Liverpool settled for a point in a scoreless draw, but it was a missed opportunity for the Gunners to extend their lead in the Premier League.",
      "publishedAt": "2026-01-09T00:10:22.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FA Cup third round: 10 things to look out for this weekend",
      "link": "https://www.theguardian.com/football/2026/jan/09/fa-cup-third-round-10-things-to-look-out-for-this-weekend",
      "summary": "Macclesfield and Weston-super-Mare carry the non-league hopes while fringe players need to seize their chances Silly goals conceded, chances missed, a lead surrendered and points squandered against relegation fodder. On the face of things, Manchester United have changed manager but nothing else. The reality is different. They started slowly at Burnley, settling into a 4-2-3-1 formation that suits them – and pretty much every other team – far better than Ruben Amorim’s 3-4-2-1 before, midway through the first half, they started to play. The deployment of Bruno Fernandes close to the opposition goal, along with a wide player, Patrick Dorgu, playing on his natural side, meant Benjamin Sesko was, for the first time, provided with decent service. Then, following Jaidon Anthony’s equaliser, Darren Fletcher’s side risked defeat by going all out for the win – one nearly achieved through the timely introduction of Shea Lacey, a richly talented 18-year-old. Brighton will present far stiffer opposition but, for the first time in a long time, United are doing what United are meant to do. Daniel Harris Manchester United v Brighton, Sunday 4.30pm (all GMT) Macclesfield v Crystal Palace, Saturday 12.15pm Grimsby v Weston-super-Mare, Saturday 5.45pm Manchester City v Exeter, Saturday 3pm Continue reading...",
      "publishedAt": "2026-01-09T00:00:21.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool stop 'bleeding' but miss their old cutting edge",
      "link": "https://www.bbc.com/sport/football/articles/cr4k2qgnlk2o?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool have stopped bleeding but must now find some cutting edge in front of goal, writes Aadam Patel.",
      "publishedAt": "2026-01-08T23:54:30.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Kyrgios not ready to play singles at Australian Open",
      "link": "https://www.skysports.com/tennis/news/12040/13492134/nick-kyrgios-admits-he-is-not-ready-to-play-singles-at-the-australian-open-and-will-instead-focus-on-doubles-alongside-thanasi-kokkinakis",
      "summary": "Nick Kyrgios admits he is not ready to play singles at the Australian Open and will instead focus on the doubles event alongside his partner Thanasi Kokkinakis.",
      "publishedAt": "2026-01-08T23:53:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal spurn chance to go eight clear as Liverpool battle to draw",
      "link": "https://www.skysports.com/football/arsenal-vs-liverpool/report/531329",
      "summary": "Arsenal missed the opportunity to go eight points clear at the top of the Premier League as Liverpool battled to a goalless draw at the Emirates Stadium.",
      "publishedAt": "2026-01-08T23:25:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slot vreest voor zware knieblessure Bradley: 'Het ziet er niet best uit'",
      "link": "https://www.vi.nl/nieuws/slot-vreest-voor-zware-knieblessure-bradley-het-ziet-er-niet-best-uit",
      "summary": "Conor Bradley wordt al het hele seizoen geplaagd door kleine blessures, maar lijkt zich nu op te kunnen maken voor een lang revalidatieproject. De Noord-Ier verstapte zich in de blessuretijd van het duel met Arsenal ( 0-0 ) en greep naar zijn knie. Liverpool-manager Arne Slot sprak na afloop zijn zorgen uit en reageerde bovendien op het gedrag van Arsenal-aanvaller Gabriel Martinelli.",
      "publishedAt": "2026-01-08T22:55:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Valverde and Rodrygo on target as Real Madrid hold off Atlético in Super Cup",
      "link": "https://www.theguardian.com/football/2026/jan/08/valverde-and-rodrygo-on-target-as-real-madrid-hold-off-atletico-in-super-cup",
      "summary": "Atlético Madrid 1-2 Real Madrid Sørloth 58; Valverde 2, Rodrygo 55 Real Madrid hold on and so does Xabi Alonso, all the way to the final. Judgment was due to come in Jeddah but it will be put off for another day at least, and instead of the sack there may be a medal waiting at the end of a month spent on edge after Real defeated Atlético 2-1. Goals from Fede Valverde and Rodrygo set up another Super Cup meeting with Barcelona on Sunday night, opportunity and obligation in one. On a night when Madrid scored after 77 seconds, Atlético’s last opportunity to get a result they probably deserved and force a penalty shootout slipped agonisingly away with only 10 more seconds remaining. Julián Alvarez had it, Antoine Griezmann almost did, but, in at last, a shot from the former just evaded the latter. As the ball bounced past the post, it took Atlético’s hopes with it. Continue reading...",
      "publishedAt": "2026-01-08T22:34:48.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal fail to take advantage of City slip as Liverpool hold leaders to draw",
      "link": "https://www.theguardian.com/football/2026/jan/08/arsenal-liverpool-premier-league-match-report",
      "summary": "Point proven? Well, not exactly. Just when Arsenal looked ready to lay down a real marker for their title aspirations, a rejuvenated Liverpool side that has been through the wringer since they were crowned champions last season showed the Gunners remain fallible. It could have been even worse for Mikel Arteta’s side if Liverpool had been awarded one of two potential penalties or if Conor Bradley’s brilliant chip had not struck the crossbar in the first half. Continue reading...",
      "publishedAt": "2026-01-08T22:05:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bournemouth latest: Semenyo sale boosts club earnings to £266m!",
      "link": "https://www.skysports.com/football/live-blog/12040/13279286/bournemouth-transfers-latest-news-rumours-and-gossip-live-updates-goals-and-highlights",
      "summary": "",
      "publishedAt": "2026-01-08T21:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester United fan group seeks to oust ‘incompetent clown’ Jim Ratcliffe",
      "link": "https://www.theguardian.com/football/2026/jan/08/manchester-united-fan-group-the-1958-seek-to-oust-incompetent-clown-jim-ratcliffe",
      "summary": "The 1958 says club has become a ‘laughing stock’ Protest planned at Old Trafford in early February Manchester United supporters group The 1958 has called for a vote of no confidence in the club’s ownership model, calling Sir Jim Ratcliffe “an incompetent clown”. The organisation will also hold a protest at the home match against Fulham on 1 February to make their voices heard at Old Trafford. The group wants the removal of the Glazer family and Ratcliffe from the club. Concerns were also expressed in relation to the work of the chief executive, Omar Berrada, and the director of football, Jason Wilcox, in the aftermath of Ruben Amorim’s sacking, which will lead to an interim replacement. Continue reading...",
      "publishedAt": "2026-01-08T20:24:40.000Z"
    }
  ]
}