{
  "generatedAt": "2025-12-22T18:36:12.297Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Kafka in Kameroen: bondscoach Brys niet ontslagen, maar ook niet op de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/kafka-in-kameroen-bondscoach-brys-niet-ontslagen-maar-ook-niet-op-de-afrika-cup",
      "summary": "Kameroen is onder leiding van trainer David Pagou afgereisd naar Marokko, waar de ploeg woensdag aan de Afrika Cup begint. De soap met bondscoach Marc Brys gaat tegelijkertijd onverminderd verder: de Vlaming stelt dat hij nog altijd geen communicatie heeft gehad waaruit blijkt dat hij niet langer de keuzeheer is.",
      "publishedAt": "2025-12-22T18:29:24.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Genk stelt na afzegging Hoefkens nieuwe hoofdtrainer aan",
      "link": "https://www.vi.nl/nieuws/genk-stelt-na-afzegging-hoefkens-nieuwe-hoofdtrainer-aan",
      "summary": "RC Genk heeft een nieuwe hoofdtrainer gevonden. De Belgische club, die eerder zonder succes een lijntje uitwierp naar NAC-coach Carl Hoefkens, maakt via de officiële website melding van de komst van Nicky Hayen.",
      "publishedAt": "2025-12-22T18:15:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Christmas Day NBA on Sky Sports: LeBron, Curry, Wembanyama and more!",
      "link": "https://www.skysports.com/nba/news/12040/13486802/christmas-day-nba-on-sky-sports-og-anunoby-shai-gilgeous-alexander-vs-victor-wembanyama-lebron-james-steph-curry-nikola-jokic-and-more",
      "summary": "The NBA's Christmas Day game has been a tradition since 1947 and continues to showcase some of the league's biggest teams and superstars.",
      "publishedAt": "2025-12-22T18:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Saudi Prince threatened Sheff Utd with wind-up order",
      "link": "https://www.skysports.com/football/news/12040/13486739/sheffield-united-saudi-prince-threatened-new-blades-owners-with-liquidation-over-10m-debt",
      "summary": "Former Sheffield United owner Prince Abdullah of Saudi Arabia was poised to issue a winding-up order on the club over a £10m debt owed to him by new owners COH Sports.",
      "publishedAt": "2025-12-22T18:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Livin' la vida LOCA: de onvoorstelbare reis van Jürgen Locadia",
      "link": "https://www.vi.nl/pro/livin-la-vida-loca-de-onvoorstelbare-reis-van-j-rgen-locadia",
      "summary": "Jürgen Locadia debuteerde met een hattrick in de Eredivisie, stond te boek als groot talent bij PSV en maakte voor zeventien miljoen euro een transfer naar de Premier League. De afgelopen jaren nam zijn carrière een andere wending. Hij voetbalde in Amerika, vluchtte uit Iran en keek zijn ogen uit in China. Op zijn 32ste lonkt nu het WK.",
      "publishedAt": "2025-12-22T18:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Buijs hamert op noodzaak van versterking voor Fortuna: 'In elke linie één'",
      "link": "https://www.vi.nl/nieuws/buijs-hamert-op-noodzaak-van-versterking-voor-fortuna-in-elke-linie-n",
      "summary": "Danny Buijs is van mening dat de selectie van Fortuna Sittard in januari een kwaliteitsimpuls nodig heeft, om in de tweede seizoenshelft de huidige lijn te kunnen voortzetten. In de ogen van de trainer loopt zijn huidige spelersgroep op het tandvlees.",
      "publishedAt": "2025-12-22T17:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Dalot: Fernandes injury 'massive' blow to Utd",
      "link": "https://www.espn.com/soccer/story/_/id/47388137/bruno-fernandes-injury-massive-blow-man-united-diogo-dalot",
      "summary": "Diogo Dalot called Bruno Fernandes' injury a \"massive\" blow as Manchester United wait to find out the severity of the skipper's setback.",
      "publishedAt": "2025-12-22T17:25:17.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Serie A now scraps plan for match in Australia",
      "link": "https://www.espn.com/soccer/story/_/id/47390073/serie-abandons-plans-ac-milan-como-match-australia",
      "summary": "Plans to play a Serie A match between AC Milan and Como in Australia next month have been abandoned.",
      "publishedAt": "2025-12-22T17:25:17.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Kane smashes Arjen Robben record in Bayern rout",
      "link": "https://www.espn.com/soccer/report/_/gameId/746846",
      "summary": "Harry Kane scored his 30th club goal of the season as Bayern Munich shrugged off an injury and illness crisis to sweep past Heidenheim 4-0 on Sunday and go into the Bundesliga's winter break with a nine-point lead.",
      "publishedAt": "2025-12-22T17:25:16.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Alves buys Portuguese club, may play",
      "link": "https://www.espn.com/soccer/story/_/id/47388411/dani-alves-buys-portuguese-club-mulls-return-42-sources",
      "summary": "Former Barcelona and Brazil defender Dani Alves has finalised details to acquire Portuguese third division club Sporting Clube de São João de Ver, sources told ESPN Brazil's Bruno Andrade.",
      "publishedAt": "2025-12-22T17:25:16.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Box-office' Evans dumps out seventh seed Wade in Ally Pally classic",
      "link": "https://www.skysports.com/darts/news/12040/13486654/world-darts-championship-rapid-ricky-evans-dumps-out-seventh-seed-james-wade-in-alexandra-palace-classic",
      "summary": "'Rapid' Ricky Evans produced a \"box-office\" display as he dumped out seventh seed James Wade in a World Championship classic at Alexandra Palace on Monday.",
      "publishedAt": "2025-12-22T17:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Milan’s Serie A match in Australia called off after ‘unacceptable requests’",
      "link": "https://www.theguardian.com/football/2025/dec/22/milans-serie-a-match-in-australia-called-off-after-unacceptable-requests",
      "summary": "Milan-Como was intended for Perth on 8 February Asian Football Confederation wanted to impose conditions The proposal to play a Serie A match between Milan and Como in Perth, Australia, has been cancelled due to football sanctions and conditions imposed by the Asian Football Confederation (AFC). The game was set to become the first major European domestic league fixture to be played outside its home country but will now not go ahead because of the financial risks and last-minute complications. Continue reading...",
      "publishedAt": "2025-12-22T17:07:35.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Just reach out' - Man Utd's Bennett on his father's suicide",
      "link": "https://www.bbc.com/sport/football/articles/cx2e5jn466go?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United defender Rhys Bennett discusses his father's death in October to help raise awareness of mental health issues.",
      "publishedAt": "2025-12-22T17:03:55.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Rav van den Berg kent zijn straf voor zeer opmerkelijke rode kaart",
      "link": "https://www.vi.nl/nieuws/rav-van-den-berg-kent-zijn-straf-voor-zeer-opmerkelijke-rode-kaart",
      "summary": "Rav van den Berg kan FC Köln de komende twee wedstrijden niet helpen. De Zwollenaar kreeg zaterdag in de wedstrijd tegen Union Berlin een opmerkelijke rode kaart, maandag werd zijn straf bekend.",
      "publishedAt": "2025-12-22T17:00:46.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wolves’ freefall leaves even Derby’s misery within reach",
      "link": "https://www.theguardian.com/football/2025/dec/22/wolves-premier-league-freefall-derby-county-record",
      "summary": "A side that once looked resilient has collapsed into historic futility, with Wolves now facing the grim task of avoiding the worst season English league football has ever seen Saturday’s defeat at home to Brentford means Wolves have taken just two points for 17 games. No side in the entire history of English league football, in any division, has ever made a worse start than that. To reach 11 points, the record low for a Premier League season set by Derby County in 2007-08, would require a significant improvement. How can this have happened? Wolves finished 16th last season, recovering after a dismal start. When Vitor Pereira took over on 19 December last year, they were second bottom on nine points from 16 games. They picked up 23 points from the final 22 games of the season and effectively ended any prospect of relegation with a run of six successive victories in the spring. How can a team go from averaging near enough a point a game to a tenth of that? The drop-off is extraordinary. This is an extract from Soccer with Jonathan Wilson, a weekly look from the Guardian US at the game in Europe and beyond. Subscribe for free here. Have a question for Jonathan? Email soccerwithjw@theguardian.com, and he’ll answer the best in a future edition. Continue reading...",
      "publishedAt": "2025-12-22T16:53:33.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Patson Daka’s diving header earns Zambia dramatic late Afcon draw with Mali",
      "link": "https://www.theguardian.com/football/live/2025/dec/22/mali-v-zambia-africa-cup-of-nations-live",
      "summary": "Patson Daka’s injury-time equaliser earned Zambia a 1-1 draw with Mali in Group A at the Africa Cup of Nations She’s offered £36k under asking price. Surely she has no chance. We are the business end of A Place in the Sun on 4Seven before the football starts. Will they make an offer on a property? The tension is palpable!. Continue reading...",
      "publishedAt": "2025-12-22T16:17:41.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "How could Man Utd replace injured Fernandes?",
      "link": "https://www.bbc.com/sport/football/articles/c1dz1exq616o?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United are still evaluating the extent of Bruno Fernandes' injury, but who are the contenders to replace him if he is ruled out?",
      "publishedAt": "2025-12-22T15:56:54.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Milan agree loan deal for Niclas Füllkrug as West Ham look to sign new striker",
      "link": "https://www.theguardian.com/football/2025/dec/22/milan-agree-loan-deal-for-niclas-fullkrug-as-west-ham-look-to-sign-new-striker",
      "summary": "Milan have option to buy German at end of season West Ham interested in Wolves’s Jørgen Strand Larsen Milan have agreed to sign West Ham’s Niclas Füllkrug on loan with an option to buy at the end of the season. The Germany striker has toiled since moving to the London Stadium from Borussia Dortmund for £27.5m in the summer of 2024 and it is hoped that his exit will free up funds for Nuno Espírito Santo to boost his side’s fight against relegation by bringing in a new forward during next month’s transfer window. West Ham are interested in Wolves’s Jørgen Strand Larsen but are reluctant to meet his valuation. It is believed that Wolves, who are bottom of the Premier League, want £40m for the Norwegian. West Ham’s budget is limited and they feel that the package for Strand Larsen, who has scored once in the league this season, is too expensive. Continue reading...",
      "publishedAt": "2025-12-22T15:12:02.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hearts' games vs Dundee Utd, St Mirren & Rangers live on Sky Sports",
      "link": "https://www.skysports.com/football/news/12040/13486675/scottish-premiership-celtic-rangers-hearts-aberdeen-motherwell-dundee-utd-st-mirren-kilmarnock-live-on-sky-sports",
      "summary": "Hearts' games away to Dundee United, St Mirren and Rangers are among the latest Scottish Premiership games to be added to the Sky Sports schedule.",
      "publishedAt": "2025-12-22T15:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Glasner critical of EFL's Conference League stance",
      "link": "https://www.bbc.com/sport/football/articles/c5yqre2yd14o?at_medium=RSS&at_campaign=rss",
      "summary": "Crystal Palace manager Oliver Glasner accuses the EFL of a lack of respect towards the Uefa Conference League amid his side's fixture congestion.",
      "publishedAt": "2025-12-22T14:57:22.000Z"
    }
  ]
}