{
  "generatedAt": "2026-01-15T13:42:50.865Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Willem II kan linksbuiten slijten in Ingolstadt",
      "link": "https://www.vi.nl/nieuws/willem-ii-kan-linksbuiten-slijten-in-ingolstadt",
      "summary": "Emilio Kehrer kan Willem II op korte termijn verlaten. De linksbuiten geniet concrete interesse van FC Ingolstadt 04. Dat bevestigen ingewijden.",
      "publishedAt": "2026-01-15T13:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham will sell Lucas Paquetá … if Flamengo agree to loan him back",
      "link": "https://www.theguardian.com/football/2026/jan/15/west-ham-paqueta-flamengo-loan-back-brazilian-transfer-football",
      "summary": "Londoners have rejected €35m bid for midfielder Facundo Buonanotte is also set for Leeds move West Ham will sell Lucas Paquetá this month if the deal includes an agreement for Flamengo to loan the midfielder back for the rest of the season. Flamengo had an opening bid of €35m rejected for the Brazilian and are prepared to raise their offer to about €40m. Paquetá has made clear to West Ham that he wants to return to Brazil and there are signs that the transfer will go ahead. Continue reading...",
      "publishedAt": "2026-01-15T13:28:48.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Volendam moet revelatie enkele weken missen door knieblessure",
      "link": "https://www.vi.nl/nieuws/fc-volendam-moet-revelatie-enkele-weken-missen-door-knieblessure",
      "summary": "Het nieuwe jaar is met een tegenvaller begonnen voor Gibson Yah. De 22-jarige middenvelder viel in de eerste seizoenshelft in positieve zin op bij FC Volendam, maar staat nu enkele weken aan de kant met een knieblessure.",
      "publishedAt": "2026-01-15T13:22:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Standbeeld voor Correia? 'We zijn lekker bezig'",
      "link": "https://www.vi.nl/video/standbeeld-voor-correia-we-zijn-lekker-bezig",
      "summary": "Anthony Correia schreef met Telstar geschiedenis door de kwartfinale van de Eurojackpot KNVB Beker te bereiken. Na afloop stond de gevierde trainer voor de camera van Voetbal International.",
      "publishedAt": "2026-01-15T13:15:23.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No VAR error over Wirtz 'offside' goal, panel says",
      "link": "https://www.bbc.com/sport/football/articles/c0kezxl4z40o?at_medium=RSS&at_campaign=rss",
      "summary": "The VAR was correct to intervene and give Florian Wirtz's goal at Fulham despite the Liverpool player appearing to be offside, a panel says.",
      "publishedAt": "2026-01-15T13:13:55.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Offside or not? Man City, Arsenal and VAR inconsistencies",
      "link": "https://www.bbc.com/sport/football/articles/c7v0lz7q7q2o?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City had their goal disallowed, while Arsenal's was allowed to stand. But the VAR should not look to be consistent with a previous bad decision.",
      "publishedAt": "2026-01-15T13:09:09.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hearts gaat steeds meer in Schots titelsprookje geloven",
      "link": "https://www.vi.nl/nieuws/hearts-gaat-steeds-meer-in-schots-titelsprookje-geloven",
      "summary": "Het geloof om Schotse voetbalgeschiedenis te schrijven groeit met de week bij Hearts. Niet grootmachten Celtic en Rangers, maar de nummer zeven van vorig seizoen ligt op dit moment op pole position om voor het eerst sinds 1959/60 kampioen van Schotland te worden. In vier dagen tijd boekten The Jambos twee overwinningen met tien man.",
      "publishedAt": "2026-01-15T13:03:18.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Vervolgstap De Busser: 'Je zou Ajax kunnen noemen'",
      "link": "https://www.vi.nl/video/waar-ligt-het-plafond-van-jari-de-busser",
      "summary": "In Rondje Eurojackpot KNVB Beker blikken Tim Reedijk, Lentin Goodijk en Inta Janssen terug op de penaltyreeks bij de wedstrijd tussen Go Ahead Eagles en Heracles Almelo, waarin wie anders dan Jari De Busser weer uitblonk.",
      "publishedAt": "2026-01-15T12:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Arbeloa: Madrid Copa exit to 2nd-tier side 'painful'",
      "link": "https://www.espn.com/soccer/story/_/id/47613216/arbeloa-real-madrid-copa-exit-2nd-tier-side",
      "summary": "New Real Madrid coach Álvaro Arbeloa took responsibility for the team's \"painful\" 3-2 Copa del Rey defeat to second-tier Albacete on Wednesday, defending his decision to rest a number of senior players.",
      "publishedAt": "2026-01-15T12:16:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea's Rosenior: Blame me for Sánchez errors",
      "link": "https://www.espn.com/soccer/story/_/id/47613217/chelsea-liam-rosenior-robert-sanchez-carabao-cup-arsenal",
      "summary": "Liam Rosenior has urged Chelsea fans to blame him for Robert Sánchez's two mistakes which helped Arsenal to a 3-2 victory in Wednesday's Carabao Cup semifinal, first leg at Stamford Bridge.",
      "publishedAt": "2026-01-15T12:16:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "FIFA requests for World Cup tickets passes 500M",
      "link": "https://www.espn.com/soccer/story/_/id/47613387/fifa-requests-2026-world-cup-tickets-passes-500m-mark",
      "summary": "FIFA said Wednesday it has received more than 500 million ticket requests for this year's World Cup.",
      "publishedAt": "2026-01-15T12:16:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Eto'o banned over alleged AFCON misbehavior",
      "link": "https://www.espn.com/soccer/story/_/id/47612784/samuel-etoo-banned-4-games-alleged-afcon-misbehaviour",
      "summary": "Cameroonian Football Federation president Samuel Eto'o has been suspended for four games for alleged misbehavior during his team's loss to Morocco at the Africa Cup of Nations.",
      "publishedAt": "2026-01-15T12:16:27.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Robertson keen to stay at Liverpool but 'wants to play football'",
      "link": "https://www.bbc.com/sport/football/articles/ce8gzemlv5ro?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool's Andy Robertson on contract talks, a \"stressful summer\" and why he \"wants to play\" rather than sit on the bench.",
      "publishedAt": "2026-01-15T12:00:26.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘A group of people decided to kill me’: Michel Platini on Fifa, Uefa and the fight to clear his name",
      "link": "https://www.theguardian.com/football/2026/jan/15/michel-platini-big-interview-fifa-gianni-infantino-uefa-sepp-blatter",
      "summary": "Former Uefa president – caught between moving on and settling scores – talks candidly about his downfall, Infantino and the snakepit of the game’s governance “There are millions and millions of romantics in football,” Michel Platini says. He has been asked whether, after a decade frozen out of the game, its lustre has vanished for him. “Millions who share the ideas that I have. But in the end, it’s big business.” It is an industry whose peaks Platini scaled before, in one of football’s biggest falls from grace, it spat him out. He maintains he would have become Fifa president if he had not been banned from football over an alleged unlawful payment made to him in 2011, when he was running Uefa, by Sepp Blatter. The scandal led to a criminal case but both men were acquitted for a second time, definitively so, by a Swiss appeals court last year. Nothing hangs over Platini any more, bar a conviction that he was cheated. Continue reading...",
      "publishedAt": "2026-01-15T12:00:19.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Andy Robertson admits Liverpool future unclear with contract expiring in summer",
      "link": "https://www.theguardian.com/football/2026/jan/15/andy-robertson-liverpool-future-contract",
      "summary": "Defender frustrated by lack of playing time this season ‘We need to see option to stay or if there’s options to go’ Andy Robertson has said his Liverpool future remains unresolved despite his contract expiring in five months and admitted this season’s limited playing time has been a frustration. Liverpool have held talks over extending their vice-captain’s outstanding Anfield career but, with no firm offer on the table, Robertson’s next step is uncertain beyond competing in Scotland’s first World Cup for 28 years. The left-back, who turns 32 in March, turned down Atlético Madrid last summer and is likely to have several options should he become a free agent. Continue reading...",
      "publishedAt": "2026-01-15T12:00:17.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Which way will Championship promotion pendulum swing next?",
      "link": "https://www.skysports.com/football/news/12040/13492413/which-way-will-championship-promotion-pendulum-swing-next",
      "summary": "Is it now a three-horse race for the two promotion spots in the Championship?",
      "publishedAt": "2026-01-15T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Winter Olympics 2026: Key info, GB medal hopes and more",
      "link": "https://www.skysports.com/winter-olympics/news/12040/13492002/winter-olympics-2026-schedule-dates-sports-team-gb-medal-hopes-and-more-for-milano-cortina-games",
      "summary": "All of the key information you need to know ahead of the 25th Winter Olympic Games in Italy.",
      "publishedAt": "2026-01-15T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ratcliffe and Glazer family visit Manchester United training ground to support Carrick",
      "link": "https://www.theguardian.com/football/2026/jan/15/jim-ratcliffe-glazer-family-visit-manchester-united-training-ground-to-support-michael-carrick",
      "summary": "Executive meeting moved to meet with interim manager Martínez ‘didn’t want to play any more’ after knee injury Sir Jim Ratcliffe and at least one of the Glazer family are at Manchester United’s training base on Thursday to support the interim manager, Michael Carrick, before Saturday’s derby with Manchester City. United were due to hold an executive committee meeting of senior management at a different location but this was moved to Carrington so that they could speak to Carrick before the first game of his second caretaker tenure. Continue reading...",
      "publishedAt": "2026-01-15T11:32:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Brave Köln push Bayern but will it be enough to bring calm to Effzeh? | Andy Brassell",
      "link": "https://www.theguardian.com/football/2026/jan/15/brave-koln-push-bayern-munich-effzeh-bundesliga",
      "summary": "Amid grumbles, a winless run and negative banners, there are signs of life for Köln after a narrow loss to the champions We didn’t see this coming, and not only because of the fog of pyro lingering over the RheinEnergieSTADION field that furnished us with 11 minutes of first-half stoppage time. In October’s equivalent fixture in the DFB Pokal, Köln had really rattled Bayern Munich in the first half and even taken the lead through Ragnar Ache – and still ended up on the wrong end of a 4-1 scoreline. The world around Geißbockheim has not been a particularly happy place since. Effzeh came into this Englische Woche on a run of seven games without a win, which was even harder to swallow after an extremely promising start. Worse still, head coach Lukas Kwasniok – who started this season embracing the city and the club’s spirit with his wearing of replica shirts on the touchline – was recently targeted by Köln fans in Saturday’s draw at Heidenheim, with a banner reading “Kwasni Yok” (“yok” being no in Turkish), credited to the Wilde Horde ultras group. Continue reading...",
      "publishedAt": "2026-01-15T11:13:47.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Buttler backs England to become world's No 1 Test team after Ashes flop",
      "link": "https://www.skysports.com/cricket/news/12040/13494577/jos-buttler-backs-ben-stokes-england-to-become-no-1-test-team-in-world-despite-ashes-failure-in-australia",
      "summary": "Jos Buttler has backed Ben Stokes to lead England to the top of the Test rankings despite the side's 4-1 Ashes failure in Australia this winter.",
      "publishedAt": "2026-01-15T11:09:00.000Z"
    }
  ]
}