{
  "generatedAt": "2026-01-10T11:19:40.031Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Balotelli lachend op weg naar Saoedi-Arabië voor nieuw avontuur",
      "link": "https://www.vi.nl/nieuws/balotelli-lachend-op-weg-naar-saoedi-arabi-voor-nieuw-avontuur",
      "summary": "Mario Balotelli heeft Italië verlaten om een nieuwe weg in te slaan in zijn carrière. De 35-jarige Italiaan wordt bij Al-Ettifaq ploeggenoot van Georginio Wijnaldum, als de laatste formaliteiten zijn afgerond. 'Daar is het warm en hier is het koud', zei Balotelli grappend bij zijn vertrek vanuit Bergamo.",
      "publishedAt": "2026-01-10T11:14:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Macclesfield v Crystal Palace: FA Cup third round – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/10/macclesfield-v-crystal-palace-fa-cup-third-round-live",
      "summary": "⚽ Updates from the 12.15pm GMT kick-off at Moss Rose ⚽ Latest scores | Read Football Daily | Mail John Hello all. FA Cup third-round Saturday kicks off with a proper bit of Cup romance – the lowest-ranked team left in the competition, Macclesfield from the National League North, where they sit 14th, sandwiched between Chester and Telford, against the holders, Premier League behemoths (in this context at least) Crystal Palace. The Silkmen took Sheffield Wednesday to a replay on their last trip to the third round, in 2013-14, but they were a Conference side back then, only a year or two out of the Football League (and they’ve been wound up and phoenixed since then). Continue reading...",
      "publishedAt": "2026-01-10T11:13:57.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FA Cup third round, Rosenior’s bow, Stanway to leave Bayern, Afcon and more – matchday live",
      "link": "https://www.theguardian.com/football/live/2026/jan/10/fa-cup-third-round-buildup-afcon-latest-and-more-matchday-live",
      "summary": "⚽ All the latest ahead of Saturday’s football action ⚽ Ten things to look out for | Fixtures | Mail us The big transfer news has already begun today as England international and two-time Euros winner Georgia Stanway has announced she is leaving Bayern Munich at the end of the season. In her announcement on social media she said it was a difficult decision to leave Bayern and thanked the club and fans. Continue reading...",
      "publishedAt": "2026-01-10T11:12:53.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal lead hunt for Georgia Stanway with England midfielder to leave Bayern in summer",
      "link": "https://www.theguardian.com/football/2026/jan/10/arsenal-lead-hunt-for-georgia-stanway-with-england-midfielder-to-leave-bayern-in-summer",
      "summary": "Lioness will leave German club at end of season Gunners targeting world-class midfielder Arsenal are among the leading candidates to sign Georgia Stanway this summer after Bayern Munich confirmed the England midfielder will leave the German club when her contract expires. According to sources, the north London club are understood to be one of a number of teams interested in acquiring the 27-year-old on a free transfer, but Renée Slegers’ team are leading the running having tracked Stanway’s progress and are eager to add a world-class midfielder to their squad. Stanway helped England win back-to-back European titles as well as being part of a Bayern Munich team that has won three consecutive Frauen Bundesliga titles since she arrived in the summer of 2022. Bayern’s director of women’s football, Bianca Rech, praised her “commitment and character”, adding in a statement on Saturday: “As the first English player at FC Bayern Women, Georgia Stanway not only made history but also stole our hearts. We talked a lot and openly about her future, and when she told us that she now wanted to try something new, her reasons were completely understandable.” Stanway posted on social media that she has made lifelong friends at the German club,: “I will give everything for the club and its sporting success until my very last day, just as I have for the past three and a half years. And I want to say goodbye to the club and the fans at the end of the season with as many titles as possible.” Continue reading...",
      "publishedAt": "2026-01-10T11:09:18.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Mbappé maakt zich op voor rentree bij Real in Spaanse Super Cup-finale",
      "link": "https://www.vi.nl/nieuws/mbapp-maakt-zich-op-voor-rentree-bij-real-in-spaanse-super-cup-finale",
      "summary": "Real Madrid kan zondag tijdens de finale van de Spaanse Super Cup weer beschikken over Kylian Mbappé. Het is volgens trainer Xabi Alonso nog alleen de vraag of de Fransman in de basis of op de bank zal starten. Mbappé kampte de afgelopen weken met een knieblessure, maar wil Real Madrid graag aan een prijs helpen.",
      "publishedAt": "2026-01-10T11:08:01.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal interested in Stanway with midfielder to leave Bayern this summer",
      "link": "https://www.skysports.com/football/news/12040/13492741/georgia-stanway-transfer-news-arsenal-interested-in-midfielder-after-bayern-munich-summer-exit-confirmed",
      "summary": "Arsenal are interested in signing Georgia Stanway, with the England international to leave Bayern Munich this summer upon the expiry of her contract.",
      "publishedAt": "2026-01-10T11:05:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Alcaraz beats big rival Sinner in exhibition ahead of Australian Open",
      "link": "https://www.skysports.com/tennis/news/12040/13492734/carlos-alcaraz-beats-jannik-sinner-in-exhibition-ahead-of-australian-open-as-rivalry-resumes-between-tennis-top-two",
      "summary": "Carlos Alcaraz won his first clash with Jannik Sinner in 2026 as the top two players in the men's game met in a hardcourt exhibition.",
      "publishedAt": "2026-01-10T10:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ayew moet NAC aan broodnodige doelpunten helpen",
      "link": "https://www.vi.nl/video/ayew-moet-nac-aan-broodnodige-doelpunten-helpen",
      "summary": "NAC Breda is in de zoektocht naar doelpunten aangekomen bij routinier André Ayew. Cijferman Bart Frouws schetst de situatie in Breda in Scorebordjournalistiek.",
      "publishedAt": "2026-01-10T10:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Keane over Sir Alex Ferguson: 'Een vieze geur die rond Man Utd hangt'",
      "link": "https://www.vi.nl/nieuws/keane-over-sir-alex-ferguson-een-vieze-geur-die-rond-man-utd-hangt",
      "summary": "Voormalig topvoetballer Roy Keane is niet te spreken over het huidige beleid bij zijn oude club Manchester United. Volgens de Ier hebben een paar mensen, waaronder clubicoon Sir Alex Ferguson, nog altijd een hoop zeggenschap binnen de club, terwijl zij feitelijk geen functie meer hebben. Keane vergeleek zijn oude manager met 'een hardnekkige stank'.",
      "publishedAt": "2026-01-10T10:13:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Veerman laat dit seizoen zien dat hij alles kan'",
      "link": "https://www.vi.nl/video/veerman-laat-dit-seizoen-zien-dat-hij-alles-kan",
      "summary": "Cijferman Bart Frouws vertelt je in Scorebordjournalistiek wat er opvalt richting speelronde 18 van de Eredivisie. Samen met Sjoerd Keizer bespreekt hij onder meer PSV en in het bijzonder Joey Veerman.",
      "publishedAt": "2026-01-10T09:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "England's Stanway to leave Bayern in summer",
      "link": "https://www.bbc.com/sport/football/articles/cpv7ryppx1vo?at_medium=RSS&at_campaign=rss",
      "summary": "England international Georgia Stanway will leave Bayern Munich upon the expiry of her contract at the end of the season.",
      "publishedAt": "2026-01-10T09:12:08.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leeds forward McDonnell to move to NRL at end of 2026 season",
      "link": "https://www.skysports.com/rugby-league/news/12040/13492707/james-mcdonnell-leeds-rhinos-forward-to-leave-super-league-club-for-nrl-at-end-of-2026-season-joining-harry-newman-in-southern-hemisphere",
      "summary": "Leeds Rhinos forward James McDonnell will leave the club at the end of the 2026 Super League season and move to the NRL, joining current team-mate Harry Newman in the southern hemisphere.",
      "publishedAt": "2026-01-10T08:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Koepka reapplies for PGA Tour membership after leaving LIV Golf",
      "link": "https://www.skysports.com/golf/news/12040/13492699/brooks-koepka-reapplies-for-pga-tour-membership-after-leaving-liv-golf",
      "summary": "Five-time major champion Brooks Koepka has reapplied for his PGA Tour membership after opting to step away from LIV Golf.",
      "publishedAt": "2026-01-10T07:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hearn: Grieving Joshua needs time before deciding on boxing future",
      "link": "https://www.skysports.com/boxing/news/12040/13492688/anthony-joshua-needs-time-to-process-friends-deaths-before-decision-on-boxing-future-says-eddie-hearn",
      "summary": "Eddie Hearn says Anthony Joshua needs time to grieve before he makes a decision on his boxing future - but does think the former heavyweight champion will return to the ring.",
      "publishedAt": "2026-01-10T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League rights may end up at Netflix despite reluctant football romance",
      "link": "https://www.theguardian.com/football/2026/jan/10/premier-league-netflix-paramount-skydance-wbd-media",
      "summary": "As Netflix and Paramount Skydance clash over WBD, football rights once considered peripheral could become central to the future of UK streaming Netflix has spent years politely rebuffing Premier League and Uefa entreaties to bid for their TV rights, so it would be ironic if it picked them up by default. That intriguing outcome is a possibility as a result of the $100bn-plus takeover battle for Warner Bros Discovery (WBD) between Netflix and its streaming rival Paramount Skydance which will shape the future not only of Hollywood but global news. Much-hyped sports rights are a footnote in a deal of such magnitude that it will require signoff from the US government, but the implications for football will be profound, even if Donald Trump is more concerned about who owns (and presents on) CNN than which platform shows Bournemouth v Brighton at Saturday lunchtime next season. Continue reading...",
      "publishedAt": "2026-01-10T06:00:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham hail 'special' cup win in front of Reynolds",
      "link": "https://www.espn.com/soccer/story/_/id/47564201/wrexham-fa-cup-ryan-reynolds-nottingham-forest",
      "summary": "Wrexham manager Phil Parkinson hailed their \"special\" FA Cup giant-killing triumph over the Premier League's Nottingham Forest and expressed his delight that the Welsh club's movie star owner Ryan Reynolds was there to see it.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "San Diego working on exit of Mexico star Lozano",
      "link": "https://www.espn.com/soccer/story/_/id/47562938/san-diego-fc-hirving-chucky-lozano-transfer-mexico",
      "summary": "San Diego FC said Friday they were working on the exit of Mexico international Hirving Lozano.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior: Chelsea can equal United's 'class of 92'",
      "link": "https://www.espn.com/soccer/story/_/id/47562611/liam-rosenior-chelsea-emulate-man-united-class-92",
      "summary": "Liam Rosenior believes Chelsea can emulate Manchester United's fabled 'Class of '92' as they pursue a policy of targeting silverware with young players.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Interim boss Fletcher in dark over Man Utd plans",
      "link": "https://www.espn.com/soccer/story/_/id/47561062/darren-fletcher-dark-man-united-manager-plans-no-conversations",
      "summary": "Darren Fletcher says he's in the dark over Manchester United's plans for his future as he prepares to take charge of his second game as caretaker boss.",
      "publishedAt": "2026-01-10T00:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham's story 'written in the stars, literally'",
      "link": "https://www.bbc.com/sport/football/articles/cj0nz85nplpo?at_medium=RSS&at_campaign=rss",
      "summary": "Wrexham's remarkable rise continues as they knock Premier League side Nottingham Forest out of the FA Cup in dramatic fashion.",
      "publishedAt": "2026-01-10T00:03:16.000Z"
    }
  ]
}