{
  "generatedAt": "2026-01-08T20:29:56.634Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Penaltykiller Chevalier helpt PSG aan twaalfde Super Cup in dertien jaar",
      "link": "https://www.vi.nl/nieuws/penaltykiller-chevalier-helpt-psg-aan-twaalfde-super-cup-in-dertien-jaar",
      "summary": "INTRO",
      "publishedAt": "2026-01-08T20:26:30.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transfers Ajax: Taylor met Lazio-sjaal op Romeins vliegveld",
      "link": "https://www.vi.nl/nieuws/transfers-ajax-vila-op-weg-naar-argentini",
      "summary": "Ook buiten de transferperiode om volgt VI het transfernieuws bij Ajax op de voet, ook omdat het sneller dan je denkt alweer januari is. De doelwitten van de Amsterdammers, duiding van de clubwatcher, of aandacht in buitenlandse media. We verzamelen alles hier.",
      "publishedAt": "2026-01-08T20:18:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal v Liverpool: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/08/arsenal-v-liverpool-premier-league-live",
      "summary": "⚽ Premier League updates from the 8pm GMT kick-off ⚽ Live scores | Table | Football Daily | Follow us on Bluesky “Arsenal have been annoyingly composed and consistent over the winter holidays and into the new year,” writes Peter Oh, “but I’m an optimist and haven’t given up hope of an imminent ‘Oh Arsenal!’ extended dip in form. “Preferably starting today.” Commentating on the Brugge v Arsenal game, Martin Keown reckoned that Arsenal were benefitting from having three quarters of the Spanish midfield with Merino and Zubimendi, which immediately impressed on me the importance of ruthless precision and accidental comedy for those hoping to make it at the business end of the #punditry game. Niche, but somehow I thought you’d appreciate it. If you’re explaining, etc. Continue reading...",
      "publishedAt": "2026-01-08T20:15:32.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Arsenal en Liverpool van start met vijf Nederlanders op het veld",
      "link": "https://www.vi.nl/nieuws/vi-live-arsenal-en-liverpool-van-start-met-vijf-nederlanders-op-het-veld",
      "summary": "Voetballiefhebbers kunnen hun vingers donderdag weer aflikken. Zo speelt het Liverpool van Arne Slot in de Premier League tegen koploper Arsenal, staan Atlético en Real Madrid tegenover elkaar in de halve finale van de Spaanse Supercopa en strijden Paris Saint-Germain en Olympique Marseille om de Franse Supercup. Volg alles in de VI Live.",
      "publishedAt": "2026-01-08T20:10:13.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Sneijder gaat na de transferperiode opnieuw op gesprek bij Ajax",
      "link": "https://www.vi.nl/nieuws/sneijder-gaat-na-de-transferperiode-opnieuw-op-gesprek-bij-ajax",
      "summary": "Het gesprek van Wesley Sneijder met Menno Geelen krijgt een vervolg. De gewezen middenvelder zegt over een paar weken opnieuw te worden uitgenodigd door Ajax.",
      "publishedAt": "2026-01-08T19:57:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Mourinho on shock loss: I hope players don't sleep",
      "link": "https://www.espn.com/soccer/story/_/id/47548211/jose-mourinho-hopes-benfica-players-sleep-braga-loss",
      "summary": "An angry Benfica coach Jose Mourinho hopes his players had a sleepless night after their shock defeat to Braga in the Portuguese Allianz Cup semifinal on Wednesday.",
      "publishedAt": "2026-01-08T19:51:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs boss backs Romero after IG post 'mistake'",
      "link": "https://www.espn.com/soccer/story/_/id/47549498/tottenham-thomas-frank-defends-cristian-romero-social-media-mistake",
      "summary": "Tottenham Hotspur manager Thomas Frank has defended captain Cristian Romero after a social media post where he accused people at the club of telling \"lies.\"",
      "publishedAt": "2026-01-08T19:51:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Trinity Rodman headlines USWNT Jan. camp roster",
      "link": "https://www.espn.com/soccer/story/_/id/47550378/rodman-headlines-usa-jan-camp-roster-paraguay-chile",
      "summary": "Forward Trinity Rodman, who is out of contract with a club, will join the United States women's national team in training camp later this month for the first time since April 2025.",
      "publishedAt": "2026-01-08T19:51:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Source: Minnesota boss Ramsay set for West Brom",
      "link": "https://www.espn.com/soccer/story/_/id/47551227/minnesota-united-coach-eric-ramsay-west-brom-manager",
      "summary": "Minnesota United head coach Eric Ramsay is set to join English Championship side West Bromwich Albion, a source has confirmed to ESPN.",
      "publishedAt": "2026-01-08T19:51:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "St. Clair: Miami move, Messi can boost WC hopes",
      "link": "https://www.espn.com/soccer/story/_/id/47551683/dayne-st-clair-inter-miami-lionel-messi-canada-world-cup",
      "summary": "Canada goalkeeper Dayne St. Clair cited Inter Miami's global profile and ambitions as well as the chance to play and train alongside a star-studded roster led by Lionel Messi as the key motivations to join the club ahead of the 2026 World Cup.",
      "publishedAt": "2026-01-08T19:51:31.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ronaldo stapje dichter bij de duizend, maar Al-Nassr koopt er niets voor",
      "link": "https://www.vi.nl/nieuws/ronaldo-stapje-dichter-bij-de-duizend-maar-al-nassr-koopt-er-niets-voor",
      "summary": "Cristiano Ronaldo is weer één doelpunt dichter bij de duizend officiële goals in zijn imposante voetbalcarrière. Helaas kocht zijn club Al-Nassr er donderdagavond niets voor tegen Al-Qadisiya.",
      "publishedAt": "2026-01-08T19:40:39.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leeds receive permission to redevelop and lift capacity of Elland Road",
      "link": "https://www.theguardian.com/football/2026/jan/08/leeds-receive-permission-to-redevelop-and-lift-capacity-of-elland-road",
      "summary": "Capacity will increase from 37,645 to about 53,000 Proposals were approved by city council on Thursday Leeds have received planning permission to redevelop Elland Road and lift the stadium’s capacity from 37,645 to about 53,000. There had been fears that a delay to the long-mooted introduction of a tram network in the surrounding area until the late 2030s might impact the club’s plans to expand the ground but the proposals were approved by the city council on Thursday. Continue reading...",
      "publishedAt": "2026-01-08T19:34:50.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Scot Prem latest: Celtic make Kyogo enquiry",
      "link": "https://www.skysports.com/football/live-blog/12040/13176154/scottish-premiership-news-transfers-rumours-gossip-and-more",
      "summary": "",
      "publishedAt": "2026-01-08T19:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We're a laughing stock' - Man Utd fans to protest",
      "link": "https://www.bbc.com/sport/football/articles/c99kn4nge5lo?at_medium=RSS&at_campaign=rss",
      "summary": "An influential Manchester United fan group is planning a protest against the ownership, which it accuses of \"turning the club into a circus\".",
      "publishedAt": "2026-01-08T19:24:44.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "USA midfielder Sam Coffey in talks to join Manchester City from Portland Thorns",
      "link": "https://www.theguardian.com/football/2026/jan/08/sam-coffey-manchester-city-portland-thorns-transfer-talks-uswnt-midfielder",
      "summary": "Midfielder given permission to fly to England Transfer talks behind her omission from USA squad Manchester City are in advanced talks to sign the United States midfielder Sam Coffey from Portland Thorns, the Guardian understands. The 27-year-old has been granted permission to fly to Manchester to try to finalise the move, which multiple sources have said is close to completion, and could give City a big boost in their quest to win a first Women’s Super League title since 2016. Continue reading...",
      "publishedAt": "2026-01-08T18:19:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Beaton in prime position for PDC Tour Card after quarter-final run at Q-School",
      "link": "https://www.skysports.com/darts/news/12040/13492119/steve-beaton-in-prime-position-to-regain-pdc-tour-card-after-quarter-final-run-at-q-school",
      "summary": "Steve 'The Adonis' Beaton is in prime position to regain his PDC Tour Card following a superb run to quarter-finals at UK Q-School on Thursday.",
      "publishedAt": "2026-01-08T18:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool 'on the ropes' at Arsenal LIVE! & highlights",
      "link": "https://www.skysports.com/football/arsenal-vs-liverpool/live/531329",
      "summary": "",
      "publishedAt": "2026-01-08T18:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sutton's FA Cup third-round predictions v DJ and producer Shadow Child",
      "link": "https://www.bbc.com/sport/football/articles/cvg5ldyz606o?at_medium=RSS&at_campaign=rss",
      "summary": "BBC Sport football expert Chris Sutton takes on DJ and producer Shadow Child - and AI - with his predictions for all 32 FA Cup third-round ties.",
      "publishedAt": "2026-01-08T17:55:15.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘I hope they don’t sleep’: José Mourinho turns on Benfica players after cup loss",
      "link": "https://www.theguardian.com/football/2026/jan/08/jose-mourinho-benfica-braga-league-cup-seixal",
      "summary": "Players will stay at club’s Seixal training ground Benfica lost 3-1 to Braga in League Cup semi-finals José Mourinho has turned on his Benfica players after the team’s 3-1 defeat by Braga in the Portuguese League Cup semi-finals, suggesting that the squad would be staying at the club’s Seixal training base until further notice. “The players will sleep in Seixal, and on Thursday there is training, and the day after there will be training,” Mourinho said at his post-match press conference. “When we arrive in Seixal, everyone will go to their rooms.” Continue reading...",
      "publishedAt": "2026-01-08T17:39:16.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Celebrating the Premier League’s unbridled wildness and joyous puerility",
      "link": "https://www.theguardian.com/football/2026/jan/08/football-daily-newsletter-premier-league-drama",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! There’s been much talk in recent years about moving Premier League games to various parts of the world that do not boast Premier League teams – Sheffield, Miami and so on – with the stated aim of spreading the gospel, had the gospel been stolen from Jesus and the Four Evangelists, to be bastardised and defiled, to be converted into folding green and then into geopolitical power and influence. By way of total non-sequitur, this year’s Geopolitics World Cup will be held in Donald Trump’s America. There was, of course, much anger at this ludicrous plan for many righteous reasons, then we all got back to enjoying the football as the ignoramiti knew we would, the game too chaotically, joyously puerile and affirming for its own and our own good. How can we possibly excise it from our souls when it bestows upon us the unbridled wildness of Wednesday’s behaviour, as it also did during the last round of midweek fixtures? The campaign for a fully night-time Premier League begins here. Continue reading...",
      "publishedAt": "2026-01-08T16:49:36.000Z"
    }
  ]
}