{
  "generatedAt": "2026-01-01T12:51:14.114Z",
  "items": [
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maresca leaves Chelsea after turbulent end to 2025",
      "link": "https://www.bbc.com/sport/football/articles/c8exj6w3y41o?at_medium=RSS&at_campaign=rss",
      "summary": "Chelsea boss Enzo Maresca leaves his role with the club fifth in the Premier League - 15 points adrift of leaders Arsenal.",
      "publishedAt": "2026-01-01T12:44:28.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Chelsea start 2026 met ruzie en neemt afscheid van Maresca",
      "link": "https://www.vi.nl/nieuws/chelsea-start-2026-met-ruzie-en-neemt-afscheid-van-maresca",
      "summary": "Enzo Maresca (45) is niet langer de manager van Chelsea. Het nieuws dat zich rond de jaarwisseling al aandiende , is inmiddels bevestigd.",
      "publishedAt": "2026-01-01T12:39:32.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Smit wordt gevolgd door alle top-5-clubs van alle topcompetities, dat is extreem'",
      "link": "https://www.vi.nl/nieuws/huiberts-onder-de-indruk-van-belangstelling-voor-smit-nog-nooit-meegemaakt",
      "summary": "Het lijkt een kwestie van tijd voordat Kees Smit een stap naar de Europese top maakt. De middenvelder wordt een enorme potentie toegedicht en ook bij AZ begint het ze soms te duizelen als ze alle hectiek rondom Smit meemaken.",
      "publishedAt": "2026-01-01T12:35:59.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Twente verhuurt Bas Kuipers aan Arouca in Portugal",
      "link": "https://www.vi.nl/nieuws/fc-twente-verhuurt-bas-kuipers-aan-arouca-in-portugal",
      "summary": "Bas Kuipers gaat FC Twente tijdelijk verlaten. De 31-jarige linksback stapt tijdelijk over naar het Portugese Arouca. In die huurdeal is geen optie tot koop opgenomen.",
      "publishedAt": "2026-01-01T12:35:07.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea confirm Enzo Maresca exit amid poor Premier League run",
      "link": "https://www.espn.com/soccer/story/_/id/47469870/chelsea-confirm-enzo-maresca-exit-amid-poor-premier-league-run",
      "summary": "Chelsea have confirmed they have parted ways with manager Enzo Maresca ahead of Sunday's game against Manchester City.",
      "publishedAt": "2026-01-01T12:29:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Met dit statement zwaait Chelsea Maresca uit op nieuwjaarsdag",
      "link": "https://www.vi.nl/nieuws/maresca-steeds-meer-onder-druk-bij-chelsea",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-01T12:28:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Madrid's Mbappé (knee) doubtful for Supercopa",
      "link": "https://www.espn.com/soccer/story/_/id/47462555/kylian-mbappe-sidelined-knee-injury-doubt-supercopa-sources",
      "summary": "Kylian Mbappé will miss Real Madrid's LaLiga game with Real Betis and is a doubt for next week's Spanish Supercopa, sources have told ESPN, due to a knee injury.",
      "publishedAt": "2026-01-01T12:26:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Holders Ivory Coast rally to win group at AFCON",
      "link": "https://www.espn.com/soccer/story/_/id/47465955/defending-champs-ivory-coast-rally-top-afcon-group",
      "summary": "Defending Africa Cup of Nations champions Ivory Coast came from two goals down to defeat Gabon 3-2 in their final Group F fixture in Marrakesh on Wednesday, qualifying them as group winners to set up a round of 16 showdown with Burkina Faso.",
      "publishedAt": "2026-01-01T12:26:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Modric: Mourinho at Madrid 'made Ronaldo cry'",
      "link": "https://www.espn.com/soccer/story/_/id/47462411/luka-modric-mourinho-once-made-cristiano-ronaldo-cry",
      "summary": "Croatia and AC Milan midfielder Luka Modric said on Wednesday that Jose Mourinho was such a tough manager during their time at Real Madrid that he once reduced star player Cristiano Ronaldo to tears.",
      "publishedAt": "2026-01-01T12:26:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Madrid great Roberto Carlos has heart surgery",
      "link": "https://www.espn.com/soccer/story/_/id/47462746/real-madrid-great-roberto-carlos-preventive-heart-surgery",
      "summary": "Brazil and Real Madrid legend Roberto Carlos confirmed on Wednesday that he underwent a \"preventive\" heart procedure, but clarified that he did not suffer a heart attack and that he is \"doing well\" while recovering in a hospital in São Paulo.",
      "publishedAt": "2026-01-01T12:26:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Enzo Maresca leaves Chelsea after dramatic breakdown in relations",
      "link": "https://www.theguardian.com/football/2026/jan/01/enzo-maresca-leaves-chelsea-breakdown-relations",
      "summary": "Italian departs Stamford Bridge role after 18 months Tensions behind the scenes damaged relationships Enzo Maresca has left his job as Chelsea’s head coach. Maresca’s relationship with the club’s board has broken down and the split has led to a parting of the ways. It had seemed Chelsea would give the Italian time to turn around his side’s form but events have moved quickly during the past 24 hours. There was deep dissatisfaction with the 45-year-old’s decisions during games but the bigger issue was his conduct away from the pitch. The situation has been volatile ever since Maresca made cryptic comments about experiencing his “worst 48 hours” at the club after the win over Everton on 13 December. Continue reading...",
      "publishedAt": "2026-01-01T12:21:12.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship quarter-finals LIVE! Searle vs Clayton and Anderson vs Hood",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2026-01-01T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maresca leaves Chelsea after 18 months in charge",
      "link": "https://www.skysports.com/football/news/12040/13489078/enzo-maresca-chelsea-head-coach-leaves-premier-league-club",
      "summary": "Enzo Maresca has left his role as Chelsea head coach after 18 months in charge at Stamford Bridge.",
      "publishedAt": "2026-01-01T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham lead Blackburn | All EFL on New Year's Day LIVE ON SKY!",
      "link": "https://www.skysports.com/football/live-blog/12040/13487078/championship-live-scores-match-updates-and-free-highlights-plus-efl-latest-from-league-one-and-league-two",
      "summary": "",
      "publishedAt": "2026-01-01T11:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Telstar bouwt door en wil stadion verder ontwikkelen",
      "link": "https://www.vi.nl/nieuws/telstar-bouwt-door-en-wil-stadion-verder-ontwikkelen",
      "summary": "Telstar kijkt naar de opties om het stadion verder te ontwikkelen. Hoewel het na de promotie al volop werd verbouwd, moet er ook nog het nodige gebeuren in Velsen-Zuid.",
      "publishedAt": "2026-01-01T11:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "From Sehitler to Armstrong: 10 female footballers set for breakthrough in 2026",
      "link": "https://www.theguardian.com/football/2026/jan/01/from-sehitler-to-armstrong-10-female-footballers-set-for-breakthrough-in-2026",
      "summary": "Today’s newsletter looks at 10 superlative talents who are ready to take the next step in the coming 12 months Alara Sehitler, Bayern Munich and Germany (19): Sehitler’s transition into Bayern Munich’s first team has come as little surprise and the creative midfielder has established herself as a strong impact player for José Barcala’s side. She has three Frauen Bundesliga goals this season and sparked Bayern’s comeback against Arsenal in the Champions League. After making her senior debut for Germany in November 2024, she will be looking to establish herself as a regular for their upcoming 2027 World Cup qualifiers. Giulia Galli, Roma and Italy (17): Galli is widely regarded as one of the best young Italian talents to emerge for a long time and became Roma’s youngest player to make her Serie A debut in May 2024, aged 16 and one month. Establishing herself in the senior squad this season, she scored her first club goal in September and has featured in the Champions League. After starring in Italy’s sensational run to the semi-finals of last summer’s Under-17 Euros, the talented forward played a significant role at the subsequent Under-17 World Cup, picking up the bronze boot. She will surely feature at this autumn’s Under-20 World Cup. Continue reading...",
      "publishedAt": "2026-01-01T11:30:37.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Johnson to hold talks with Palace boss Glasner",
      "link": "https://www.bbc.com/sport/football/articles/c0kej88zvplo?at_medium=RSS&at_campaign=rss",
      "summary": "Brennan Johnson will meet Crystal Palace manager Oliver Glasner on Thursday before making a final decision on whether to complete a £35m move from Tottenham.",
      "publishedAt": "2026-01-01T11:24:26.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Brazil legend Roberto Carlos recovering in hospital",
      "link": "https://www.bbc.com/sport/football/articles/cqxyrj9dv5go?at_medium=RSS&at_campaign=rss",
      "summary": "Brazil and Real Madrid legend Roberto Carlos is \"recovering well\" after undergoing what he describes as \"a preventative medical procedure\".",
      "publishedAt": "2026-01-01T08:12:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "What I have learned from watching all 20 Premier League teams this season | John Brewin",
      "link": "https://www.theguardian.com/football/2026/jan/01/what-i-have-learned-from-watching-all-20-premier-league-teams-this-season",
      "summary": "Set pieces on the rise, fans transformed to customers and conspiracies seen in every decision – is football losing its fun? English football has always mirrored the passions, conflicts, identities and inequalities of the age. After the golden 1960s, the decay of the 1970s and ensuing disasters of the 1980s came the cap-sleeved, rebounding self-confidence of the 1990s. The 21st century so far has taken in globalisation and wanton commercialism. After that rabid, often reckless push for continued growth, society and the game alight on the uncertainties that encapsulated 2025. To catch the 20 Premier League clubs in live action this season, and this writer completed the full set on Tuesday witnessing Arsenal’s second-half demolition of Aston Villa, has been a study in that uncertainty. From the grumbling of fans, to the ever-fragile egos of managers, to players slugging through the gristle of 90 minutes of hard-pressing slog, a leading question comes to mind: is anyone actually still enjoying this? Continue reading...",
      "publishedAt": "2026-01-01T08:00:36.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rodman’s future and Liverpool in need to buy – welcome to the women’s transfer window",
      "link": "https://www.theguardian.com/football/2026/jan/01/trinity-rodman-liverpool-women-football-transfer-window",
      "summary": "With an unusually high number of elite-level players out of contract in 2026 it promises to be an intriguing January Transfer fees in women’s football have been rising at a rate of inflation that would cause anguish at the Bank of England. Last January alone, $5.8m (£4.3m) was spent in the women’s game globally and then a record $12.3m (£9.1m) was splashed in the 2025 summer transfer window, which was nearly twice as much as 12 months earlier and a four-fold increase on 2023. What can January 2026 possibly have in store? The upcoming winter window – which opens for English women’s clubs on 2 January and closes on 3 February – has already got off to a blockbuster start even before officially opening. The Germany striker Lea Schüller and Norway’s attacking midfielder Signe Gaupset are among those to have already signed for Women’s Super League clubs, but this is set to be a unique window for a different reason than merely the usual clamour for reinforcements. Continue reading...",
      "publishedAt": "2026-01-01T08:00:33.000Z"
    }
  ]
}