{
  "generatedAt": "2026-01-14T09:33:22.315Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Blijkbaar zaten Jans en sommige spelers niet op dezelfde pagina'",
      "link": "https://www.vi.nl/video/blijkbaar-zaten-jans-en-sommige-spelers-niet-op-dezelfde-pagina",
      "summary": "Ron Jans was hevig teleurgesteld na de bekeruitschakeling tegen FC Twente, maar de vraag is of de selectie van FC Utrecht dezelfde urgentie had om door te stoten tot de kwartfinale. Twee spelers waren namelijk te laat en werden uit de basis gehouden door de afzwaaiende trainer van de Domstedelingen.",
      "publishedAt": "2026-01-14T09:25:02.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PSV schakelt AI in om gezondheid van spelers te voorspellen",
      "link": "https://www.vi.nl/nieuws/psv-schakelt-ai-in-om-gezondheid-van-spelers-te-voorspellen",
      "summary": "PSV gaat als eerste Nederlandse voetbalclub geavanceerde AI-technologie inzetten om aankomende overbelasting en infecties bij spelers te voorspellen. Dat doet de koploper van de Eredivisie in samenwerking met Philips.",
      "publishedAt": "2026-01-14T09:22:01.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Osimhen has become 'king of Nigerian football'",
      "link": "https://www.bbc.com/sport/football/articles/ce9yxjr98pgo?at_medium=RSS&at_campaign=rss",
      "summary": "Nigeria face a huge semi-final against Africa Cup of Nations hosts and favourites Morocco on Wednesday.",
      "publishedAt": "2026-01-14T08:52:51.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Geprezen Semenyo na droomstart bij City: 'Ik geniet van elk moment'",
      "link": "https://www.vi.nl/nieuws/geprezen-semenyo-na-droomstart-bij-city-ik-geniet-van-elk-moment",
      "summary": "Antoine Semenyo kent een vliegende start bij Manchester City en bewees ook in zijn tweede wedstrijd voor The Citizens weer zijn waarde. De Ghanees wordt geprezen na zijn optreden in de League Cup tegen Newcastle United en geeft zelf aan te genieten van zijn nieuwe omgeving.",
      "publishedAt": "2026-01-14T08:50:04.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Afrika Cup op tv: hier worden duels Marokko en Egypte uitgezonden",
      "link": "https://www.vi.nl/nieuws/afrika-cup-op-tv-hier-worden-duels-marokko-en-egypte-uitgezonden",
      "summary": "Woensdag vinden de twee duels in de halve finale van de Afrika Cup plaats. Marokko neemt het op tegen Nigeria en Senegal staat tegenover Egypte. Voetbal International zet uiteen waar die duels worden uitgezonden op televisie.",
      "publishedAt": "2026-01-14T08:45:04.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Maximilian Ibrahimovic over 'erfenis': 'Ben heel anders dan mijn vader'",
      "link": "https://www.vi.nl/nieuws/maximilian-ibrahimovic-over-erfenis-ben-heel-anders-dan-mijn-vader",
      "summary": "Maximilian Ibrahimovic heeft woensdag zijn overstap van AC Milan naar Ajax afgerond en begrijpt dat de verwachtingen rond hem hoog zijn, als zoon van voormalig Ajacied Zlatan Ibrahimovic. Voor de jonge aanvaller voelen de prestaties van zijn vader niet als een last op zijn schouders.",
      "publishedAt": "2026-01-14T08:37:21.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Utd not planning Jan. transfers for Carrick",
      "link": "https://www.espn.com/soccer/story/_/id/47606619/man-united-not-planning-january-transfers-michael-carrick-sources",
      "summary": "Michael Carrick will work with the squad he has inherited as Man United boss with the club having no plans to make new signings, sources have told ESPN.",
      "publishedAt": "2026-01-14T08:26:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep rants over VAR on disallowed Semenyo goal",
      "link": "https://www.espn.com/soccer/story/_/id/47603386/pep-rants-var-disallowed-semenyo-goal-man-city",
      "summary": "Pep Guardiola said he expects an explanation from referees' chief Howard Webb during a post-match rant after Antoine Semenyo's disallowed goal during a Manchester City win over Newcastle United on Tuesday.",
      "publishedAt": "2026-01-14T08:26:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior plans talks with Chelsea exile Sterling",
      "link": "https://www.espn.com/soccer/story/_/id/47603026/chelsea-liam-rosenior-raheem-sterling-axel-disasi",
      "summary": "\\Chelsea boss Liam Rosenior said he intends to hold talks with Raheem Sterling and Axel Disasi over their futures Stamford Bridge.",
      "publishedAt": "2026-01-14T08:26:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Klopp: Xabi's Madrid exit 'nothing to do with me'",
      "link": "https://www.espn.com/soccer/story/_/id/47598753/xabi-alonso-real-madrid-exit-do-me",
      "summary": "Jürgen Klopp has stated that he has not received any calls from Real Madrid following the exit of Xabi Alonso, and affirmed that the decision has nothing to do with him.",
      "publishedAt": "2026-01-14T08:26:58.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Could Arsenal win Premier League without a regular goalscorer?",
      "link": "https://www.bbc.com/sport/football/articles/cn56k7dpw7ko?at_medium=RSS&at_campaign=rss",
      "summary": "No team has ever won the Premier League title without having a player in the top 10 goalscorers, but could Arsenal change that?",
      "publishedAt": "2026-01-14T08:25:07.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The Knowledge | Which football teams have scored after being reduced to eight players?",
      "link": "https://www.theguardian.com/football/2026/jan/14/which-football-teams-have-scored-after-being-reduced-to-eight-players-the-knowledge",
      "summary": "Plus: high-ranking nations where Ballon d’Or winners have never played and an own-goal scoring hat-trick hero Mail us with your questions and answers “Last month, Lazio scored a late winner (in the 82nd minute) against Parma despite having two players sent off earlier in the game,” writes Bogdan Kotarlic. “I wonder if any team has scored a goal (or maybe more) with eight players and with three players receiving red cards before that?” There’s only one place to start: Boghead Park, Dumbarton. “In August 1991, Premier Division Airdrieonians played Dumbarton in the Scottish League Cup,” writes Bill Hall. “What looked like an innocuous tie was anything but - especially for Dumbarton’s Colin McNair, Stephen Gow and Jimmy Gilmour, who were shown red cards in what must have been a bad-tempered affair (I was there but it was 34 years ago, and I was in the pub beforehand, so memories are a bit vague). Continue reading...",
      "publishedAt": "2026-01-14T08:00:19.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maye vs the monster - why the Texans can shock the NFL",
      "link": "https://www.skysports.com/nfl/news/12040/13493697/the-houston-texans-can-win-the-super-bowl-but-the-nfls-best-defense-needs-cj-stroud-to-fire",
      "summary": "Modern NFL defenses tend to like a scalpel. The Houston Texans prefer a sledgehammer.",
      "publishedAt": "2026-01-14T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Panic Attack returns for another Newbury prize",
      "link": "https://www.skysports.com/racing/news/12040/13493513/today-on-sky-sports-racing-lingfield-newbury-and-happy-valley",
      "summary": "We have a busy day’s racing on Wednesday with action from Lingfield, Newbury and Happy Valley, live on Sky Sports Racing...",
      "publishedAt": "2026-01-14T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why has no English boss won Premier League - and who could be first?",
      "link": "https://www.bbc.com/sport/football/articles/cp37k9ql449o?at_medium=RSS&at_campaign=rss",
      "summary": "Why has an English manager not won the Premier League? Chief football writer Phil McNulty explores who could make history.",
      "publishedAt": "2026-01-14T06:39:45.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Raducanu fights back in Hobart to win first match since September",
      "link": "https://www.skysports.com/tennis/news/12040/13494022/emma-raducanu-british-no-1-fights-back-in-hobart-to-win-first-match-since-september-beating-camila-osorio",
      "summary": "Emma Raducanu earned her first victory since September after fighting back to beat Camila Osorio in straight sets in the first round of the Hobart International.",
      "publishedAt": "2026-01-14T05:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo scores again - who are winners and losers of his arrival?",
      "link": "https://www.bbc.com/sport/football/articles/c5y200qgp11o?at_medium=RSS&at_campaign=rss",
      "summary": "Antoine Semenyo has taken to life seamlessly at Manchester City by hitting the ground running and is already beginning to repay the £62.5m fee Pep Guardiola handed to Bournemouth to sign him.",
      "publishedAt": "2026-01-14T00:02:01.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The three ages of Michael Carrick … and what they say about Manchester United",
      "link": "https://www.theguardian.com/football/2026/jan/14/the-three-ages-of-michael-carrick-and-what-they-say-about-manchester-united",
      "summary": "From his competitive debut to his first spell as interim, the former midfielder has seen much at Old Trafford over the past two decades 23 August 2006, Charlton 0-3 Manchester United The 25‑year‑old new signing was eased into United’s midfield as a second-half substitute in the second game of the season, having picked up a small injury on the pre‑season tour. With Wayne Rooney and Paul Scholes suspended, Sir Alex Ferguson started with John O’Shea and Darren Fletcher in central midfield, with the Scot (sporting a mullet) opening the scoring after Ryan Giggs and Cristiano Ronaldo had hit the woodwork. Carrick was one of four future United managers in the side, alongside Fletcher, Giggs and Ole Gunnar Solskjær, who rounded off the win with a late goal after Louis Saha had doubled United’s lead. Solskjær’s goal was his first in the league in three injury-hit years, and the Norwegian, also a substitute, should have had another when Carrick squared a perfect pass to the striker, only for Charlton’s Scott Carson to make an outstanding save. With Carrick an instant success at United that season, the club roared to the title in May 2007, their first in four years. Continue reading...",
      "publishedAt": "2026-01-14T00:00:08.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘VAR delay made us stronger’: Guardiola hails City after disallowed Semenyo goal",
      "link": "https://www.theguardian.com/football/2026/jan/13/pep-guardiola-newcastle-manchester-city-carabao-cup-semi-final-first-leg-antoine-semenyo-var",
      "summary": "‘I think my players were angry. The spirit was there’ Newcastle beaten 2-0 in Carabao Cup semi-final first-leg Pep Guardiola’s evident delight at Manchester City’s 2-0 win at Newcastle in the first leg of their Carabao Cup semi-final was tempered by the lengthy video assistant referee delay that disallowed what would have been Antoine Semenyo’s second goal of the game. It prompted Manchester City’s manager to launch into an epic, and often incomprehensible, rant about VAR and its perceived failings or, more pertinently, non-involvements during City’s 2-1 defeat at Newcastle in November and last season’s FA Cup final defeat to Crystal Palace. Continue reading...",
      "publishedAt": "2026-01-13T23:58:53.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'The game has gone' - a bad night for VAR in semi-final",
      "link": "https://www.bbc.com/sport/football/articles/czdqvydez71o?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City's 2-0 win over Newcastle in the first leg of the Carabao Cup semi-final was overshadowed by a contentious decision to disallow a goal from Antoine Semenyo in the second half.",
      "publishedAt": "2026-01-13T23:45:04.000Z"
    }
  ]
}