{
  "generatedAt": "2026-01-06T17:26:22.096Z",
  "items": [
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Algeria v DR Congo: Africa Cup of Nations last 16 – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/06/algeria-v-dr-congo-africa-cup-of-nations-last-16-live",
      "summary": "⚽ Afcon updates from the last 16, 4pm GMT kick-off ⚽ Follow on Bluesky | Get in touch: you can mail Yara 10 min: Algeria win their first corner … Bensebaini takes but it barely clears the first man. Amoura is now down and the replay shows his football boot came clean off during that corner. No foul, which is the right decision I think, and play continues with a DR Congo free-kick. 9 min: Chancel Mbemba is down receiving treatment. Would be a huge miss for DR Congo for their captain to be injured early but he seems to be OK. Continue reading...",
      "publishedAt": "2026-01-06T17:23:26.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Feyenoord laat Andreev het seizoen in Polen afmaken",
      "link": "https://www.vi.nl/nieuws/feyenoord-laat-andreev-het-seizoen-in-polen-afmaken",
      "summary": "Plamen Andreev zal het seizoen op huurbasis afmaken bij Lech Poznan. De 21-jarige doelman van Feyenoord wordt daarmee voor de tweede keer dit seizoen verhuurd.",
      "publishedAt": "2026-01-06T17:22:37.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2026-01-06T17:20:38.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man Utd hold talks with trio over caretaker role",
      "link": "https://www.bbc.com/sport/football/articles/c931qgk3xgqo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United hold talks with former players Darren Fletcher, Michael Carrick and Ole Gunnar Solskjaer about becoming the club's caretaker manager.",
      "publishedAt": "2026-01-06T17:12:54.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United approach Carrick, Solskjaer",
      "link": "https://www.espn.com/soccer/story/_/id/47527700/man-united-approach-ole-gunnar-solskjaer-michael-carrick-interim-role",
      "summary": "Manchester United have held \"early-stage informal talks\" with several potential interim managers, including Ole Gunnar Solskjaer and Michael Carrick, sources have told ESPN.",
      "publishedAt": "2026-01-06T17:10:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea name Rosenior as coach on 5½-year deal",
      "link": "https://www.espn.com/soccer/story/_/id/47523773/liam-rosenior-chelsea-appointment-strasbourg-exit-premier-league-manager",
      "summary": "Chelsea have announced the appointment of Liam Rosenior as their new head coach on a 5½-year contract.",
      "publishedAt": "2026-01-06T17:10:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Canada's Marsch: Davies back, poised for WC",
      "link": "https://www.espn.com/soccer/story/_/id/47524993/canada-jesse-marsch-alphonso-davies-ready-world-cup-excited-playing-again",
      "summary": "Canada manager Jesse Marsch said star player Alphonso Davies is regenerated and excited to play a key role in the 2026 World Cup",
      "publishedAt": "2026-01-06T17:10:08.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Strasbourg vindt opvolger Rosenior, Van Nistelrooij ook kandidaat bij United'",
      "link": "https://www.vi.nl/nieuws/ook-van-nistelrooij-in-beeld-bij-united-transfer-semenyo-nadert-afronding",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-06T17:08:36.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Heerenveen vindt oplossing om terug te keren naar Nederland na geannuleerde vlucht",
      "link": "https://www.vi.nl/nieuws/heerenveen-vindt-oplossing-om-terug-te-keren-naar-nederland-na-geannuleerde-vlucht",
      "summary": "Het trainingskamp van SC Heerenveen heeft een vervelende wending gekregen. De Friese club zou woensdag terugvliegen naar Nederland, maar de luchtvaartmaatschappij heeft de vlucht wegens de winterse weeromstandigheden gecanceld. Tot overmaat van ramp heeft TSG Hoffenheim ook nog de stekker uit het op dinsdag geplande oefenduel getrokken.",
      "publishedAt": "2026-01-06T17:01:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Het AZ van Maarten Martens maakt hoge verwachtingen niet waar",
      "link": "https://www.vi.nl/pro/az-maakt-hoge-verwachtingen-niet-waar",
      "summary": "Stand van zaken",
      "publishedAt": "2026-01-06T17:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Rosenior to Chelsea: ‘collaboration’ turns the Strasbourg air blue",
      "link": "https://www.theguardian.com/football/2026/jan/06/liam-rosenior-chelsea-strasbourg-football-daily-newsletter",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! While Football Daily spent most of New Year’s Day shivering, sweating and staring at hallucinatory rodents while questioning the wisdom of embarking on our first Dry January since 1989, it didn’t escape our blurred vision that Chelsea chose to ring in 2026 by firing Enzo Maresca. While he may have grown up the son of a humble Italian fisherman, the head coach had gotten a little too big for his waders, eventually being tossed into an ocean of opaque criticism he had levelled at unspecified members of the club hierarchy. Like a frail old man bobbing around the Tyrrhenian Sea while trying to reel in a 500lb bluefin tuna with a spool of dental floss, Maresca had picked a battle he was always going to lose – and on Tuesday Chelsea unveiled the Italian’s replacement. So Chelsea are so confident that Liam Rosenior is the answer that they have given him a contract until 2032. Odds on him still being there in six years’ time? There’s more chance of Accrington Stanley winning the FA Cup (and they got knocked out in the first round). Are football club owners mad or just desperate?” – John Myles. It’s quite sad to see Thomas Frank under increasing pressure at Spurs (for not solving all the problems that have dogged them for the last 40 years at a club that finished 17th last season, one place above relegation). Still, the one thing that should help him in this challenging period is that there isn’t anyone available with extensive experience of being an interim manager at Spurs. Oh. Meanwhile, Martin O’Neill returning as Celtic manager (now they don’t have to play Hearts again obviously), after spending only 37 days as interim and yet somehow outlasting the subsequent full-time manager, is both utterly predictable and yet simultaneously farcical. The skeleton of Jock Stein must be roaming the Scottish countryside in search of a pair of eyeballs to roll …” – Noble Francis. As we emerge into the sunlit uplands of 2026, can any of us honestly say that we had a 3-0 Wolves win, Chelsea, Celtic and Manchester United managerial exits, plus the audacious midnight capturing of a sitting South American president by the winner of Fifa’s peace prize on our festive bingo cards? Thought not. Happy new year! We’re off to a flyer!” – Allastair McGillivray. This is an extract from our daily football email … Football Daily. To get the full version, just visit this page and follow the instructions. Continue reading...",
      "publishedAt": "2026-01-06T15:38:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick, Solskjaer contacted over Man Utd interim role",
      "link": "https://www.skysports.com/football/news/12040/13491195/man-utd-manager-latest-ole-gunnar-solskjaer-michael-carrick-contacted-over-interim-manager-position",
      "summary": "Manchester United have begun talking to external candidates as they look for an interim manager to take charge until the end of the season, with three former Old Trafford favourites in the mix for a possible return after Ruben Amorim's departure.",
      "publishedAt": "2026-01-06T15:03:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Inothewayurthinkin and Galopin Des Champs among entries for Gold Cup",
      "link": "https://www.skysports.com/racing/news/12040/13491154/cheltenham-festival-inothewayurthinkin-and-galopin-des-champs-feature-in-gold-cup-shakeup",
      "summary": "Last year’s hero Inothewayurthinkin, two-time winner Galopin Des Champs and Harry Redknapp’s The Jukebox Man are among 33 entries for the Boodles Cheltenham Gold Cup.",
      "publishedAt": "2026-01-06T15:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wardley 'extremely keen' to defend world title vs Fury",
      "link": "https://www.skysports.com/boxing/news/12040/13491187/fabio-wardley-extremely-keen-to-fight-tyson-fury-and-defend-wbo-title-against-former-heavyweight-champion",
      "summary": "Fabio Wardley has told Sky Sports he would be \"extremely keen\" to defend his WBO world title against Tyson Fury, following the latter's decision to come out of retirement.",
      "publishedAt": "2026-01-06T14:44:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham in talks to terminate Wilson's contract",
      "link": "https://www.bbc.com/sport/football/articles/czejpg4jw8ko?at_medium=RSS&at_campaign=rss",
      "summary": "West Ham are close to an agreement with striker Callum Wilson to terminate his contract at the club.",
      "publishedAt": "2026-01-06T14:23:25.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ole Gunnar Solskjær could make shock return as Manchester United interim manager",
      "link": "https://www.theguardian.com/football/2026/jan/06/ole-gunnar-solskjaer-shock-return-manchester-united-interim-manager",
      "summary": "Wilcox considers Norwegian a prime candidate for role Senior players would welcome temporary appointment Ole Gunnar Solskjær could make a shock return to Manchester United as interim manager, with Jason Wilcox, the director of football, considering him a prime candidate for the role. Solskjær is thought to be open to taking up the position at a club where he remains a huge fan favourite as a former successful player there. Senior players led by Bruno Fernandes and Harry Maguire would welcome his temporary appointment. Continue reading...",
      "publishedAt": "2026-01-06T14:17:25.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Man United sacked Amorim: Tactics, player issues, transfer frustration",
      "link": "https://www.espn.com/soccer/story/_/id/47514917/manchester-united-story-firing-ruben-amorim-analysis-rob-dawson",
      "summary": "Ruben Amorim was seen as a risky choice to lead Man United's rebuild in November 2024. Here's how things broke down publicly and behind closed doors.",
      "publishedAt": "2026-01-06T14:09:56.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Who will be Man United's next manager? 12 top candidates to replace Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47516208/man-united-next-manager-12-candidates-replace-amorim",
      "summary": "Whether Manchester United aim to hire quickly or wait until summer, here are the coaches they could be after.",
      "publishedAt": "2026-01-06T14:09:55.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World No 1 Sabalenka: Battle of the Sexes brought eyes on tennis",
      "link": "https://www.skysports.com/tennis/news/12040/13491060/battle-of-the-sexes-aryna-sabalenka-says-her-match-with-nick-kyrgios-brought-eyes-on-tennis",
      "summary": "Aryna Sabalenka has defended her 'Battle of the Sexes' match with Nick Kyrgios, saying it \"brought eyes on tennis.\"",
      "publishedAt": "2026-01-06T13:52:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City lose Rúben Dias for up to six weeks in latest defensive injury blow",
      "link": "https://www.theguardian.com/football/2026/jan/06/manchester-city-ruben-dias-injury-out-for-up-to-six-weeks",
      "summary": "Gvardiol likely out for season and Stones also injured Guéhi of interest and forward Semenyo close to joining Manchester City will be without Rúben Dias for up to six weeks with a hamstring injury, exacerbating Pep Guardiola’s defensive injury crisis. The shortage of centre-backs could force the club into the transfer market, with the Crystal Palace captain, Marc Guéhi, of interest. Dias and Josko Gvardiol, who has a broken shinbone, were forced off in Sunday’s draw with Chelsea, leaving City with 13 fit senior outfield players for Brighton’s visit on Wednesday. The academy graduate Max Alleyne has been recalled from a loan at Watford to bolster central defensive options in the short term. Continue reading...",
      "publishedAt": "2026-01-06T13:48:18.000Z"
    }
  ]
}