{
  "generatedAt": "2026-01-16T17:27:19.327Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "NEC raakt Shiogai voor miljoenen kwijt aan Wolfsburg",
      "link": "https://www.vi.nl/nieuws/nec-raakt-shiogai-voor-miljoenen-kwijt-aan-wolfsburg",
      "summary": "NEC ziet Kento Shiogai op korte termijn vertrekken. De Nijmeegse club wilde deze winter eigenlijk niet meewerken aan een transfer van de twintigjarige spits, maar VfL Wolfsburg activeert een clausule in het contract van de Japanner. Voor een gelimiteerde afkoopsom van tien miljoen euro kan Shiogai overstappen naar de Bundesliga-club.",
      "publishedAt": "2026-01-16T17:12:58.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Ter Stegen maakt het seizoen af bij Girona'",
      "link": "https://www.vi.nl/nieuws/ter-stegen-maakt-het-seizoen-af-bij-girona",
      "summary": "Marc-André ter Stegen maakt het seizoen af bij Girona. Dat melden vooraanstaande transferjournalisten vrijdagavond. De doelman wordt voor de rest van het seizoen gehuurd van streekgenoot Barcelona.",
      "publishedAt": "2026-01-16T17:11:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Igor Thiago: ‘The only thing I know how to do in my life is score goals’",
      "link": "https://www.theguardian.com/football/2026/jan/16/igor-thiago-brentford-brazil-world-cup-interview",
      "summary": "Brentford’s record-breaking Brazilian has overcome a torrid childhood, racism and injuries – but is dreaming of Brazil’s No 9 shirt at the World Cup Igor Thiago had dreams that seemed impossible. His impoverished childhood and the early death of his father forced him to grow up fast while still a teenager. To eat, he had to start working as a child. He was a bricklayer’s assistant, a fruit carrier at the market and a car washer … so many jobs that could have prevented him from becoming the Brazilian to make Premier League history with the most goals in a single season. Igor Thiago has 16 goals in 21 games for Brentford. There are still 17 more matches to go, the first against Chelsea on Saturday, but he has already surpassed such Brazilian luminaries as Roberto Firmino, Matheus Cunha and Gabriel Martinelli, all of whom scored 15 league goals in their most prolific season. How to describe this turnaround in his life? Igor Thiago has an easy explanation. “I would describe it as a lot of hard work. I think that everything God has planned for my life, has given me this year at Brentford, is something I hadn’t experienced yet in my career,” he says. Continue reading...",
      "publishedAt": "2026-01-16T17:00:02.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PSV in de beker tegen Heerenveen, kraker in Alkmaar",
      "link": "https://www.vi.nl/nieuws/psv-in-de-beker-tegen-heerenveen-kraker-in-alkmaar",
      "summary": "Vrijdag is er geloot voor de kwartfinale van de beker. Op het eerste gezicht is AZ - FC Twente het mooiste affiche. Kampioen PSV krijgt SC Heerenveen op bezoek, titelverdediger Go Ahead Eagles moet naar Telstar.",
      "publishedAt": "2026-01-16T16:54:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester United’s Michael Carrick brushes off Keane’s pre-derby jibe",
      "link": "https://www.theguardian.com/football/2026/jan/16/manchester-united-michael-carrick-roy-keane-city-derby",
      "summary": "Irishman fell out with Lisa Carrick after 2014 criticism ‘It is the way of the world,’ says new interim head coach Michael Carrick has shrugged off Roy Keane’s jibe regarding his wife “probably doing the team talk” at Manchester United by claiming it does not bother him. Keane made the comment about Lisa Carrick after the 44-year-old’s appointment as United head coach until the end of the season. Speaking on the Stick to Football podcast, the Irishman was responding to Jamie Carragher’s comment that United should not have employed Carrick in the role. “Well, his wife can always come in because she’s got a bit of a big mouth sometimes. She’s probably doing the team talk,” Keane said. Continue reading...",
      "publishedAt": "2026-01-16T16:35:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Weekend preview: Madrid seek redemption, Manchester derby, AFCON final",
      "link": "https://www.espn.com/soccer/story/_/id/47622724/manchester-united-manchester-city-real-madrid-afcon-final-julien-laurens-weekend-preview",
      "summary": "It's Friday and another full weekend of action awaits across the soccer calendar as Julien Laurens picks out the best games to watch in Europe.",
      "publishedAt": "2026-01-16T16:34:15.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Passmonster Bassey topt de lijstjes op de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/passmonster-bassey-topt-de-lijstjes-op-de-afrika-cup",
      "summary": "Zaterdag eindigt voor Nigeria de Afrika Cup. In de strijd om plek drie nemen The Super Eagles het op tegen Egypte. Daarin heeft bondscoach Éric Chelle in ieder geval één troef in handen: passmonster Calvin Bassey.",
      "publishedAt": "2026-01-16T16:15:12.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Man City agree deal with Palace for Guéhi",
      "link": "https://www.espn.com/soccer/story/_/id/47630232/marc-guehi-final-stage-crystal-palace-move-man-city-sources",
      "summary": "Manchester City are closing in on the signing of Marc Guéhi from Crystal Palace, sources have told ESPN.",
      "publishedAt": "2026-01-16T16:05:09.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick shrugs off criticism from ex-United players",
      "link": "https://www.espn.com/soccer/story/_/id/47630083/manchester-united-michael-carrick-roy-keane-criticism",
      "summary": "Michael Carrick has said he is \"not bothered\" by personal criticism made by Roy Keane.",
      "publishedAt": "2026-01-16T16:05:09.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rose Lavelle named U.S. women's player of year",
      "link": "https://www.espn.com/soccer/story/_/id/47629534/gotham-rose-lavelle-named-us-women-player-year",
      "summary": "Gotham FC and United States women's national team midfielder Rose Lavelle has been voted U.S. Soccer's Female Player of the Year for 2025.",
      "publishedAt": "2026-01-16T16:05:09.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pulisic stays on bench as Rabiot inspires Milan win",
      "link": "https://www.espn.com/soccer/report/_/gameId/736935",
      "summary": "AC Milan won 3-1 at in-form Como on Thursday, with Adrien Rabiot winning a penalty and then scoring two goals.",
      "publishedAt": "2026-01-16T16:05:08.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool keeper gets six-game ban after racism claim",
      "link": "https://www.bbc.com/sport/football/articles/c0jv9xlzldpo?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool goalkeeper Rafaela Borggrafe receives a six-game ban for using discriminatory language towards a team-mate.",
      "publishedAt": "2026-01-16T16:01:35.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hier kijk je vrijdag live naar de loting voor de kwartfinale van de KNVB Beker",
      "link": "https://www.vi.nl/nieuws/hier-kijk-je-vrijdag-live-naar-de-loting-voor-de-kwartfinale-van-de-knvb-beker",
      "summary": "Zeven van de acht kwartfinalisten in de Eurojackpot KNVB Beker zijn bekend. De laatste kwartfinalist komt uit het duel tussen De Treffers en NEC. Hieronder lees je wanneer de loting plaatsvindt, welke ploegen er in de koker gaan en waar de loting wordt uitgezonden.",
      "publishedAt": "2026-01-16T16:00:38.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Former Man Utd players' comments 'irrelevant' - Carrick",
      "link": "https://www.bbc.com/sport/football/articles/c5yv019g5nwo?at_medium=RSS&at_campaign=rss",
      "summary": "Michael Carrick brands the noise generated around Manchester United by former players \"irrelevant\" and says Roy Keane's personal comments did not bother him.",
      "publishedAt": "2026-01-16T15:40:02.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bahrain Darts Masters LIVE! Humphries in action after Littler demolished in quarter-finals",
      "link": "https://www.skysports.com/darts/live-blog/12040/13494617/bahrain-darts-masters-live-scores-results-commentary-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2026-01-16T15:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool’s Rafaela Borggräfe given six-game ban after FA finds she made racist remark",
      "link": "https://www.theguardian.com/football/2026/jan/16/liverpool-rafaela-borggrafe-given-six-game-ban-fa-finds-racist-remark",
      "summary": "Goalkeeper has served five matches of the suspension Reference to skin colour overheard by club colleagues The Liverpool goalkeeper Rafaela Borggräfe was given a six-game ban by the Football Association after being found to have made a racist comment that involved reference to skin colour. Borggräfe has served five matches of that suspension. She accepted the sanction and was also ordered to enrol on an education programme after an FA investigation into the language, which was overheard by some staff and teammates. Continue reading...",
      "publishedAt": "2026-01-16T15:22:38.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Palace manager Glasner to leave at end of season",
      "link": "https://www.bbc.com/sport/football/articles/crlezygrpe6o?at_medium=RSS&at_campaign=rss",
      "summary": "Crystal Palace manager Oliver Glasner confirms he will leave the club when his contract expires at the end of the season.",
      "publishedAt": "2026-01-16T15:00:40.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City agree £20m deal to sign Palace captain Guehi",
      "link": "https://www.bbc.com/sport/football/articles/c99kmd7z5yxo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City agree a deal in principle to sign Crystal Palace and England centre-back Marc Guehi in January for £20m.",
      "publishedAt": "2026-01-16T14:51:04.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Boots from Easter Bunny and teenage parties - Glasner tells his story",
      "link": "https://www.bbc.com/sport/football/articles/c9vxdy2np80o?at_medium=RSS&at_campaign=rss",
      "summary": "Crystal Palace boss Oliver Glasner sits down with Kelly Somers to talk about his background and career in football.",
      "publishedAt": "2026-01-16T14:48:01.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Oliver Glasner confirms he will leave Crystal Palace role in summer",
      "link": "https://www.theguardian.com/football/2026/jan/16/oliver-glasner-confirms-he-will-leave-crystal-palace-role-in-summer",
      "summary": "Austrian has been linked with Manchester United job Manchester City close on deal to sign Guéhi from Palace Oliver Glasner has confirmed he will leave Crystal Palace at the end of this season, having informed the chair, Steve Parish, in October that he wanted a new challenge, and said the captain, Marc Guéhi, is on the verge of joining Manchester City. The Austrian, who led Palace to their first major trophy when they won the FA Cup last season, is out of contract in the summer and has been linked with Manchester United in recent weeks. Glasner said last week he was planning further talks with Parish to resolve his future but revealed in the buildup to Palace’s game at Sunderland on Saturday that he would be leaving the club. Continue reading...",
      "publishedAt": "2026-01-16T14:03:36.000Z"
    }
  ]
}