{
  "generatedAt": "2026-01-03T08:31:50.082Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Arteta over bankzitter Eze: 'Heeft meer minuten gespeeld dan ooit'",
      "link": "https://www.vi.nl/video/arteta-over-bankzitter-eze-heeft-meer-minuten-gespeeld-dan-ooit",
      "summary": "Arsenal-manager Mikel Arteta verbaasde zich op de persconferentie over de vragen rondom Eberechi Eze. De jonge middenvelder bleef de afgelopen twee wedstrijden steeds negentig minuten op de bank zitten, maar volgens de Spanjaard speelt Eze meer minuten dan hij ooit op het hoogste niveau heeft gedaan.",
      "publishedAt": "2026-01-03T08:25:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League buildup, La Liga, Afcon last 16 and Celtic v Rangers – matchday live",
      "link": "https://www.theguardian.com/football/live/2026/jan/03/premier-league-buildup-la-liga-afcon-last-16-and-celtic-v-rangers-matchday-live",
      "summary": "⚽ News, discussion and previews before the day’s action ⚽ Fixtures | Tables | Follow us on Bluesky | Get in touch Hello. It’s … (checks diary) … Saturday. After the festive confusion, it’s now day three in the 2026 house although just four Premier League fixtures today suggests a routine hasn’t yet been established. Still, for many out there, this is the final weekend of the holiday so a chance to head to the match. That quartet of Premier League offerings includes Aston Villa v Nottingham Forest at 12.30pm while, kicking off at the same time, we have the little matter of an Old Firm derby. One with particular intrigue given the current chaos at Celtic. Continue reading...",
      "publishedAt": "2026-01-03T08:15:58.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Van Hanegem en Mansveld waren bikkelhard, maar absolute wereldtop'",
      "link": "https://www.vi.nl/nieuws/dollen-in-europese-finale-ik-zei-tegen-van-hanegem-dat-ik-vast-terugliep",
      "summary": "Lex Schoenmaker (78) is nog altijd Europees topscorer van Feyenoord. De Haagse spits van weleer won met de club de UEFA Cup en maakte uiteindelijk negentien doelpunten in Europees verband. Met dank aan zijn grote vriend Willem van Hanegem.",
      "publishedAt": "2026-01-03T08:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Graduates reunited: Chelsea’s former Manchester City talents return",
      "link": "https://www.theguardian.com/football/2026/jan/03/manchester-city-chelsea-premier-league-enzo-maresca-calum-mcfarlane",
      "summary": "Palmer and Delap are among five academy players who learnt their trade at City, as links between the clubs grow Chelsea’s visit to Manchester City on Sunday will be a homecoming for members of the travelling party. Five Chelsea players were nurtured at the academy that sits a few hundred yards from the Etihad Stadium, on the other side of a bridge. The London club’s recent recruitment has been heavily influenced by City’s teaching of players and coaches. Tosin Adarabioyo, Cole Palmer, Liam Delap, Jamie Gittens and Roméo Lavia were members of City’s youth ranks, most working there under Enzo Maresca. If one thread was unpicked this week when Maresca dramatically departed Chelsea, the link remains strong because Sunday’s caretaker, Calum McFarlane, was formerly the under-18s assistant manager at City. Continue reading...",
      "publishedAt": "2026-01-03T08:00:31.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Toney komt met dubbelslag in spoor van Wijnaldum en Ronaldo",
      "link": "https://www.vi.nl/video/toney-komt-met-dubbelslag-in-spoor-van-wijnaldum-en-ronaldo",
      "summary": "Ivan Toney heeft zich met twee doelpunten tegen het Al-Nassr van Cristiano Ronaldo gemeld in de Saoedische topscorersstrijd. De Engelsman staat dit seizoen op acht doelpunten, eentje minder dan Georginio Wijnaldum en vijf minder dan Ronaldo en João Felix. Toney hielp zijn ploeg Al-Ahli bovendien aan een zege op de koploper .",
      "publishedAt": "2026-01-03T07:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Liverpool wil contract van Gravenberch openbreken'",
      "link": "https://www.vi.nl/nieuws/west-ham-united-legt-23-miljoen-euro-op-tafel-voor-nieuwe-spits",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-03T07:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Darts' new rivalry? Why Littler vs Veen final tonight is unmissable",
      "link": "https://www.skysports.com/darts/news/12040/13489777/luke-littler-vs-gian-van-veen-new-rivalry-takes-centre-stage-at-world-darts-championship-final-at-alexandra-palace",
      "summary": "Just over two years ago, Luke Littler and Gian van Veen went head-to-head in the World Youth Championship final in a match that perhaps marked the start of a long, thrilling rivalry.",
      "publishedAt": "2026-01-03T07:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: de dag van de Old Firm en de Catalaanse derby",
      "link": "https://www.vi.nl/nieuws/vi-live-de-dag-van-de-old-firm-en-de-catalaanse-derby",
      "summary": "In deze VI Live volgen we de hoogtepunten in verschillende competities. Met onder meer aandacht voor Celtic - Rangers FC, AFC Bournemouth - Arsenal en Espanyol - Barcelona.",
      "publishedAt": "2026-01-03T07:01:30.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Today on Sky Sports Racing: Westcombe looks to complete hat-trick at Lingfield",
      "link": "https://www.skysports.com/racing/news/12040/13489479/today-on-sky-sports-racing-lingfield-newcastle-and-southwell-feature-live-on-saturday",
      "summary": "We have a busy day’s racing on Saturday with action from Lingfield, Newcastle and Southwell live on Sky Sports Racing...",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'No coasting' and no selfishness from England in 'huge' final Ashes Test",
      "link": "https://www.skysports.com/cricket/news/12040/13489832/the-ashes-england-captain-ben-stokes-says-final-test-vs-australia-in-sydney-is-huge-despite-series-already-being-lost",
      "summary": "England captain Ben Stokes vowed there will be let up from his side in a \"huge\" final Ashes Test in Sydney as they aim to leave Australia with a narrow 3-2 defeat.",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Will Steelers vs Ravens be Rodgers' final game in the NFL?",
      "link": "https://www.skysports.com/nfl/news/12040/13489655/aaron-rodgers-retirement-decision-looms-as-pittsburgh-steelers-face-baltimore-ravens-in-nfl-playoff-decider",
      "summary": "Aaron Rodgers has often alluded to being on the 'back nine' of his NFL career in recent years. There is a sense he could be strolling up the fairway to putt at the 18th this weekend.",
      "publishedAt": "2026-01-03T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Blackburn to Barcelona - Dolan's 'unbelievable' journey",
      "link": "https://www.bbc.com/sport/football/articles/cwy1wn866y5o?at_medium=RSS&at_campaign=rss",
      "summary": "Five years ago, Tyrhys Dolan was playing for Clitheroe - now he is preparing to face Barcelona in the Catalan derby.",
      "publishedAt": "2026-01-03T06:46:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "I’m the ‘miracle’ woken from a coma by Kenny Dalglish after Hillsborough. And now I’ve met him again",
      "link": "https://www.theguardian.com/football/2026/jan/03/36-years-on-miracle-hillsborough-disaster-survivor-meets-kenny-dalglish-liverpool",
      "summary": "It’s said that you should never meet your heroes, but 36 years after the Liverpool manager sat by my hospital bed, I got to thank our greatest ally Born to a son of Anfield in a Warwickshire village, I grew up geographically remote from my spiritual football home. Emotionally, though, the pull of the boys in red was ever-present: from my first game at Anfield in 1974 to FA Cup final defeat at Wembley in ’77, to witnessing the first of Liverpool’s six European Cups, in Rome, when my first hero, Kevin Keegan, ran Berti Vogts ragged. I cried when Keegan left, but soon a new king was born in my imagination: Kenny Dalglish, that wily, tough, insanely skilful Scot. I travelled the country to follow my team through the peaks and troughs that culminated in the lowest possible low, on 15 April 1989, the day of the FA Cup semi-final between Liverpool and Nottingham Forest. There are many things I remember about Hillsborough, some of which returned to me years, even decades, later. My dad saying: “If it’s a nice day tomorrow, we’ll go.” Ian St John on the end of my hospital bed. My best mate laughing as I struggled to eat a yoghurt. The endless bright white lights of the Royal Hallamshire. The surreal trip to my local hospital in an ancient, drafty ambulance. One thing I don’t remember, though, is meeting my hero. And for good reason. For I’m the “miracle” boy woken by the sound of Kenny’s voice when he spoke at my bedside. Continue reading...",
      "publishedAt": "2026-01-03T06:00:32.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior frontrunner to replace Maresca",
      "link": "https://www.espn.com/soccer/story/_/id/47479925/liam-rosenior-frontrunner-replace-enzo-maresca-chelsea-sources",
      "summary": "Strasbourg boss Liam Rosenior is the leading candidate to succeed Enzo Maresca as Chelsea head coach, sources have told ESPN.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep denies Maresca, City links: 'I have a contract'",
      "link": "https://www.espn.com/soccer/story/_/id/47481706/pep-guardiola-denies-enzo-maresca-man-city-links-contract",
      "summary": "Pep Guardiola has reiterated his desire to stay on at Manchester City amid fresh rumours surrounding Enzo Maresca.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Neymar hint about next contract teased",
      "link": "https://www.espn.com/soccer/story/_/id/47480654/neymar-hint-next-contract-teased-social-media",
      "summary": "Santos have indicated that Neymar will be with the club until the end of the year.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Sterling keen on permanent Chelsea exit",
      "link": "https://www.espn.com/soccer/story/_/id/47482059/raheem-sterling-keen-permanent-chelsea-exit-amid-west-ham-fulham-interest-sources",
      "summary": "Raheem Sterling is prioritising a permanent move away from Chelsea this month amid interest from West Ham and Fulham, sources have told ESPN.",
      "publishedAt": "2026-01-03T02:36:14.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Laurens' weekend preview: Maresca-less Chelsea visit Man City, Barcelona derby, more",
      "link": "https://www.espn.com/soccer/story/_/id/47482083/julien-laurens-weekend-soccer-preview-chelsea-manchester-city-premier-league-barcelona-laliga",
      "summary": "What is Julien Laurens watching this weekend? There's the start of the post-Maresca era at Chelsea as they head to Man City, huge derbies in Scotland and France, and much more.",
      "publishedAt": "2026-01-03T02:36:11.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship: What time is the final on Saturday?",
      "link": "https://www.skysports.com/darts/news/12040/13475673/world-darts-championship-2026-schedule-fixtures-and-results-from-alexandra-palace-with-luke-littler-beau-greaves-michael-van-gerwen-in-action",
      "summary": "The World Darts Championship has reached its climax live on Sky Sports, with Luke Littler seeking to defend his title.",
      "publishedAt": "2026-01-02T22:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Thomas Frank admits ‘it’s difficult to enjoy’ being Tottenham head coach",
      "link": "https://www.theguardian.com/football/2026/jan/02/thomas-frank-admits-its-difficult-to-enjoy-being-tottenham-head-coach",
      "summary": "Frank likens challenges at Spurs to running a marathon Tottenham booed off after goalless draw at Brentford Thomas Frank has admitted he is not enjoying his job at Tottenham. The head coach is dealing with numerous problems as he navigates what always stood to be a transitional season, the most insistent being his team’s lack of creativity. Spurs were booed off after Thursday’s 0-0 draw at Brentford by the travelling support, who also chanted “boring, boring Tottenham”. But Frank is confident he will come to look back on the first half of his debut campaign more fondly once – and not if – his squad emerges on the other side, stronger and wiser for the suffering. Tottenham are 12th in the Premier League – their next game is at home to Sunderland on Sunday and Frank leant into a marathon-running analogy when he was asked whether he was enjoying the challenge to which he has signed up. Continue reading...",
      "publishedAt": "2026-01-02T22:30:20.000Z"
    }
  ]
}