{
  "generatedAt": "2026-01-16T09:30:59.999Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Aston Villa schakelt door na misgrijpen bij Gallagher'",
      "link": "https://www.vi.nl/nieuws/napoli-spot-mogelijke-vervanger-lang-die-tussen-basis-en-transfermarkt-bungelt",
      "summary": "De tijd van winterse versterkingen is aangebroken, in dit blog volgen we alle transferactiviteit in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-16T09:23:28.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Laurens' weekend preview: Madrid's redemption?; Carrick's Man United debut; AFCON final",
      "link": "https://www.espn.com/soccer/story/_/id/47622724/manchester-united-manchester-city-real-madrid-afcon-final-julien-laurens-weekend-preview",
      "summary": "It's Friday and another full weekend of action awaits across the soccer calendar as Julien Laurens picks out the best games to watch in Europe.",
      "publishedAt": "2026-01-16T09:21:58.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Transfer news, Manchester derby looms for Carrick, and much more: football – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/16/transfer-news-manchester-derby-looms-for-carrick-and-much-more-football-live",
      "summary": "⚽ The latest football news going into the weekend ⚽ Premier League preview | Follow on Bluesky | Mail Taha Hello, hello, hello. The big story this weekend is Michael Carrick’s second debut as Manchester United's manager/head coach, and what a task it is: the noisy neighbours at home. How things have changed since his first Manchester derby as a player, a 3-1 victory for United in December 2006, with goals from Louis Saha, Wayne Rooney, Cristiano Ronaldo – and a first and last City strike for Hatem Trabelsi. We’ll be looking ahead to that and much more. Continue reading...",
      "publishedAt": "2026-01-16T09:16:41.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "SC Heerenveen zet vol in op Europees voetbal: 'Als je het uitspreekt, gaat het leven'",
      "link": "https://www.vi.nl/pro/sc-heerenveen-zet-vol-in-op-europees-voetbal-als-je-het-uitspreekt-gaat-het-lev",
      "summary": "Waar veel middenmoters stellen zich te richten op het halen van de play-offs, daar is de doelstelling van SC Heerenveen een stuk brutaler: de Friezen gaan voor niets minder dan Europees voetbal. Aanvoerder Luuk Brouwers vertelt waarom de lat bewust hoog is gelegd – en zet in zijn uitleg aankomende tegenstander FC Groningen alvast op scherp.",
      "publishedAt": "2026-01-16T09:16:21.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Schietschijf bij Volendam eerst gescout als speler: 'Dan maar keepen'",
      "link": "https://www.vi.nl/video/schietschijf-bij-volendam-eerst-gescout-als-speler-dan-maar-keepen",
      "summary": "Kayne van Oevelen werd eerst als voetballer gescout, maar staat inmiddels het doel te verdedigen van FC Volendam. Clubwatcher Bart Kruijt vertelt het bijzondere verhaal van de doelman met de meeste reddingen in de Eredivisie. Dit kan je overigens ook teruglezen via deze link .",
      "publishedAt": "2026-01-16T09:05:05.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Salaris Infantino sinds aanstelling verviervoudigd: dit is wat FIFA-baas opstrijkt",
      "link": "https://www.vi.nl/nieuws/salaris-infantino-sinds-aanstelling-verviervoudigd-dit-is-wat-fifa-baas-opstrijkt",
      "summary": "Gianni Infantino heeft zijn salaris sinds zijn aanstelling als FIFA-baas verviervoudigd. Dat blijkt uit Amerikaanse belastingdocumenten, die Le Monde heeft ingezien. De Zwitserse Italiaan streek in 2024 ruim vijf miljoen euro op. Met het komende WK op komst en de bonussen die daarbij komen kijken, lijkt dat bedrag nóg verder op te lopen.",
      "publishedAt": "2026-01-16T09:05:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick is 'the correct appointment at the right time' for Man Utd",
      "link": "https://www.skysports.com/football/news/12040/13494103/manchester-united-michael-carrick-is-the-correct-choice-at-the-right-time-reporter-notebook",
      "summary": "After Michael Carrick's appointment as Manchester United head coach until the end of the season, Sky Sports News reporter Dan Khan examines why he is the correct choice for the club...",
      "publishedAt": "2026-01-16T09:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Roma sign forward Malen from Aston Villa",
      "link": "https://www.bbc.com/sport/football/articles/c4g0ey1m8v9o?at_medium=RSS&at_campaign=rss",
      "summary": "Netherlands forward Donyell Malen joins Roma from Aston Villa after just one year with the Premier League side.",
      "publishedAt": "2026-01-16T08:35:14.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Tuchel vraagt sociale vaardigheden van spelers Engeland op WK",
      "link": "https://www.vi.nl/nieuws/tuchel-wijst-op-cruciaal-aspect-om-kans-op-wk-titel-te-vergroten",
      "summary": "Volgens Thomas Tuchel zijn sociale vaardigheden minstens zo belangrijk als voetballende kwaliteiten om ver te komen op het aanstaande WK. De bondscoach van Engeland benadrukt dat talent alleen niet genoeg is.",
      "publishedAt": "2026-01-16T08:35:05.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Murillo to replace Maguire at Manchester United?",
      "link": "https://www.theguardian.com/football/2026/jan/16/football-transfer-rumours-murillo-to-replace-maguire-at-manchester-united",
      "summary": "Today’s rumours might even get home one day This year, as with last year, Aston Villa are eyeing the January market to bolster their forward line. For Marcus Rashford in 2025, read Tammy Abraham in 2026. Roma own his registration, though he is now on loan at Besiktas. He was a fan favourite when on loan from Chelsea in Villa’s Championship days, so such a move would be something of a homecoming. Another Villa target is Dani Ceballos, the midfielder once of Arsenal, and a useful Real Madrid squad player for years now. To compound Crystal Palace’s FA Cup misery, and the unsettling tidings on Oliver Glasner’s future, there’s the rumour that Jean-Philippe Mateta is a target for Juventus. Continue reading...",
      "publishedAt": "2026-01-16T08:11:21.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "African football chiefs accused of not consulting fully over controversial Afcon change",
      "link": "https://www.theguardian.com/football/2026/jan/16/caf-accused-not-consulting-fully-controversial-afcon-change",
      "summary": "Tournament to be played every four years from 2028 Federation denies statutes breached in making decision The Confederation of African Football (Caf) has been accused of pushing through its controversial decision to stage the Africa Cup of Nations (Afcon) every four years without properly consulting member federations. Several presidents of African football federations have told the Guardian they were not informed of the decision until it was surprisingly announced by the Caf president, Patrice Motsepe, on 20 December, prompting claims that the confederation breached its statutes by failing to seek approval at a general assembly. Continue reading...",
      "publishedAt": "2026-01-16T08:00:03.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Cardiff boss Barry-Murphy: Hopefully I can deliver for Vincent Tan, or else...",
      "link": "https://www.skysports.com/football/news/12040/13494631/brian-barry-murphy-interview-cardiff-boss-discusses-how-he-navigated-team-to-top-of-league-one-without-raft-of-signings",
      "summary": "The January transfer window is open and clubs up and down the land are looking for new players. But it's all quiet at Cardiff.",
      "publishedAt": "2026-01-16T08:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Gauff: Grand Slam prize money 'not where we would like it'",
      "link": "https://www.skysports.com/tennis/news/12040/13494904/australian-open-coco-gauff-says-grand-slam-prize-money-not-where-we-would-like-it-ahead-of-first-major-of-2026",
      "summary": "Coco Gauff has led calls for the four Grand Slams to increase the prize money on offer further amid an ongoing dispute between tennis' leading players and the major tournaments.",
      "publishedAt": "2026-01-16T07:35:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Danish star Rune: Tennis has become unnecessarily demanding",
      "link": "https://www.skysports.com/tennis/news/12040/13493846/holger-rune-tennis-has-become-more-physically-and-unnecessarily-demanding-due-to-expanded-masters-1000-events",
      "summary": "Holger Rune has hit out at tennis' money-makers, calling for \"adjustments in the scheduling\" and labelled the expanded Masters 1000 events as unnecessarily demanding..",
      "publishedAt": "2026-01-16T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Red Bull expect 'to be trailing' rivals at start of 2026 F1 season",
      "link": "https://www.skysports.com/f1/news/12040/13494646/red-bull-chief-laurent-mekies-admits-he-expects-team-to-be-trailing-rivals-at-start-of-2026-f1-season-amid-new-engine-adjustment",
      "summary": "Red Bull chief Laurent Mekies has admitted he expects the team \"to be trailing\" their front-running rivals at the start of the 2026 Formula 1 season.",
      "publishedAt": "2026-01-16T06:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick 'right choice at this moment' - Rooney",
      "link": "https://www.bbc.com/sport/football/articles/c0mkl4n493zo?at_medium=RSS&at_campaign=rss",
      "summary": "Wayne Rooney says caretaker head coach Michael Carrick is the \"right choice at this moment in time\" to \"steady the ship\" at Manchester United.",
      "publishedAt": "2026-01-16T06:13:32.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "From Fiji to Latvia - are cross-border leagues the future?",
      "link": "https://www.bbc.com/sport/football/articles/cly5wy081y3o?at_medium=RSS&at_campaign=rss",
      "summary": "The OFC Professional League kicks off this week and a Baltic League has been proposed, so is there a future for cross-border football competitions?",
      "publishedAt": "2026-01-16T06:13:03.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League: 10 things to look out for this weekend",
      "link": "https://www.theguardian.com/football/2026/jan/16/premier-league-10-things-to-look-out-for-this-weekend",
      "summary": "Chelsea need to avoid long-throw blues, plus: a vacant spot for Liverpool and West Ham’s best hope for survival Race for the golden boot: Premier League top scorers Can the 198th derby be any spicier for Manchester United and their latest interim manager, Michael Carrick? This is his second caretaker tenure, though the three games of November-December 2021 (beating Villarreal and Arsenal, drawing with Chelsea) hardly compares with sending out an XI to try to beat Manchester City in Saturday’s early kick-off. Pep Guardiola’s high-performing unit remain in contention on all fronts. Carrick takes charge of a United suffering the aftershocks of a latest manager sacking, hoping to salvage the season via European qualification. The lad from Wallsend has 17 games to do so – his new team are in seventh place on 32 points, so victory over City would be a fine start. But you wonder if the match might end with Carrick and United humbled or, even worse, humiliated. Jamie Jackson Manchester United v Manchester City, Saturday 12.30pm (all times GMT) Chelsea v Brentford, Saturday 3pm Leeds v Fulham, Saturday 3pm Liverpool v Burnley, Saturday 3pm Continue reading...",
      "publishedAt": "2026-01-16T00:00:54.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man Utd's Martínez: Wanted to quit after ACL tear",
      "link": "https://www.espn.com/soccer/story/_/id/47623753/man-united-lisandro-martinez-quit-acl-injury-argentina",
      "summary": "Manchester United defender Lisandro Martínez has revealed that during the darkest moments of his recovery from a torn ACL, he seriously considered walking away from football.",
      "publishedAt": "2026-01-15T23:56:24.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pulisic stays on bench as Rabiot inspires Milan win",
      "link": "https://www.espn.com/soccer/report/_/gameId/736935",
      "summary": "AC Milan won 3-1 at in-form Como on Thursday, with Adrien Rabiot winning a penalty and then scoring two goals.",
      "publishedAt": "2026-01-15T23:56:24.000Z"
    }
  ]
}