{
  "generatedAt": "2025-12-30T12:52:24.793Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Einde Afrika Cup voor Aubameyang: spits keert geblesseerd terug bij Marseille",
      "link": "https://www.vi.nl/nieuws/einde-afrika-cup-voor-aubameyang-spits-keert-geblesseerd-terug-bij-marseille",
      "summary": "Het Afrika Cup-avontuur van Pierre-Emerick Aubameyang is abrupt ten einde gekomen. De 36-jarige spits heeft een dijbeenblessure opgelopen en is door de Gabonese voetbalbond per direct vrijgegeven aan Olympique Marseille. Gabon moet tijdens het laatste groepsduel met Ivoorkust dus zonder zijn sterspeler stellen.",
      "publishedAt": "2025-12-30T12:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Ronaldo wants 1k goals; open to Europe return",
      "link": "https://www.espn.com/soccer/story/_/id/47441885/cristiano-ronaldo-reiterates-desire-reach-1000-goals-retiring",
      "summary": "Portugal captain Cristiano Ronaldo has reiterated his desire to reach 1,000 career goals before he calls time on his playing career.",
      "publishedAt": "2025-12-30T12:32:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Hakimi returns as Morocco seal AFCON knockouts",
      "link": "https://www.espn.com/espn/story/_/id/47446867/achraf-hakimi-returns-morocco-afcon-knockouts",
      "summary": "Africa Cup of Nations hosts Morocco dispatched Zambia 3-0 at a fervid Prince Moulay Abdellah Stadium in Rabat on Monday to round off their Group A campaign in style and ease into the round of 16.",
      "publishedAt": "2025-12-30T12:32:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham into top half of Championship after win",
      "link": "https://www.espn.com/soccer/report/_/gameId/744881",
      "summary": "null",
      "publishedAt": "2025-12-30T12:32:11.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bondscoach Egypte laakt Afrika Cup-beslissing en wijst naar Europa",
      "link": "https://www.vi.nl/nieuws/bondscoach-egypte-laakt-beslissing-om-afrika-cup-om-vier-jaar-te-spelen",
      "summary": "Hossam Hassan, de bondscoach van Egypte, heeft zich uitgesproken tegen de beslissing om de Afrika Cup minder frequent af te werken. Het continentale toernooi zal niet langer eens in de vier, maar eens in de twee jaar worden gespeeld. Daarmee komt een einde aan een traditie van tweejaarlijkse organisatie die teruggaat tot 1957 en die kritiek heeft opgeroepen bij sommige coaches.",
      "publishedAt": "2025-12-30T12:27:12.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Met Zirkzee bedreigde Ferguson laat zich eindelijk zien bij Roma",
      "link": "https://www.vi.nl/nieuws/met-zirkzee-bedreigde-ferguson-laat-zich-eindelijk-zien-bij-roma",
      "summary": "Terwijl AS Roma op jacht is naar een nieuwe spits, liet Evan Ferguson zich maandagavond zien met een goal en een assist. Hoewel de Romeinen onder meer concreet zijn voor Joshua Zirkzee , houdt de Ier vertrouwen in zijn eigen kunnen.",
      "publishedAt": "2025-12-30T12:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Johnson to decide future after Palace deal agreed",
      "link": "https://www.bbc.com/sport/football/articles/clyky7nnpgzo?at_medium=RSS&at_campaign=rss",
      "summary": "Brennan Johnson is set decide whether he wants to join Crystal Palace after the south London club agreed a £35m deal to sign the Tottenham attacker.",
      "publishedAt": "2025-12-30T12:12:36.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship: Woodhouse, Clayton and Rock headline afternoon LIVE!",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2025-12-30T12:02:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De opleiders van de grote vier deel 2: zijn kinderen nog kind?",
      "link": "https://www.vi.nl/pro/de-opleiders-van-de-grote-vier-deel-2-zijn-kinderen-nog-kind",
      "summary": "De sleutel voor toekomstig succes van Nederland ligt bij de opleiding. Hoe kan er eindelijk weer een aanvaller van topkwaliteit worden opgeleid? VI nodigde de hoofden opleiding van de vier grootste clubs uit voor een uitgebreid interview in Zeist. Deel 2 van het openhartige tweeluik.",
      "publishedAt": "2025-12-30T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Timber hoort bij de beste rechterkant van Europa'",
      "link": "https://www.vi.nl/video/timber-hoort-bij-de-beste-rechterkant-van-europa",
      "summary": "Natúúrlijk maakt VI ook nu weer een Elftal van het Jaar met spelers die actief zijn in de buitenlandse topcompetities. Kleine verandering: dit keer kijken kenners buitenlands voetbal Süleyman Öztürk en Bas van den Hoven alleen naar de eerste seizoenshelft. In dit fragment gaan de heren dieper in op de ontwikkeling van Jurriën Timber.",
      "publishedAt": "2025-12-30T11:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool set-piece coach Aaron Briggs leaves club after defensive struggles",
      "link": "https://www.theguardian.com/football/2025/dec/30/liverpool-set-piece-coach-aaron-briggs-leaves-club",
      "summary": "Champions have conceded 12 set-piece goals in league Arne Slot expressed his dismay before Wolves game Liverpool have parted company with their first-team set-piece coach, Aaron Briggs, in response to the weaknesses that have blighted Arne Slot’s side this season. Slot has made no secret of his dismay with Liverpool’s set-piece failings at both ends of the pitch, and admitted they were holding back the Premier League champions before Saturday’s 2-1 win over Wolves. Continue reading...",
      "publishedAt": "2025-12-30T11:30:40.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Coventry to back Lampard with transfer funds in January and keen to extend contract",
      "link": "https://www.theguardian.com/football/2025/dec/30/coventry-frank-lampard-transfer-funds-january-keen-new-contract",
      "summary": "Championship leaders expected to strengthen team Club may start talks on deal for head coach next month The Coventry owner, Doug King, is preparing to back Frank Lampard with a significant transfer budget next month as the club chase a return to the Premier League after 25 years and is also ready to open talks over a new contract for the head coach. Lampard’s side suffered their first home defeat since April in losing to third-placed Ipswich on Monday night but retain an eight-point lead over Middlesbrough at the top of the Championship having lost only three of their 24 league games this season. Continue reading...",
      "publishedAt": "2025-12-30T11:19:52.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool set-piece coach leaves club amid woeful record this season",
      "link": "https://www.skysports.com/football/news/12040/13488666/liverpool-set-piece-coach-aaron-briggs-leaves-club-with-reds-having-joint-worst-record-in-europe-this-season",
      "summary": "Liverpool set-piece coach Aaron Briggs has left the club midway through a season in which the Reds have the joint-worst set-play record in Europe's big five leagues.",
      "publishedAt": "2025-12-30T10:59:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "From Guéhi to Yildiz – who could be on the move in the January transfer window?",
      "link": "https://www.theguardian.com/football/2025/dec/30/semenyo-ter-stegen-january-transfer-window",
      "summary": "We look at 10 players likely to create headlines next month, including the ‘new Kevin De Bruyne’ Men’s transfer interactive: January 2026 edition While Semenyo would doubtless prefer to be in Morocco at the moment, one of the advantages to Ghana’s failure to qualify for the Africa Cup of Nations has been that the 25-year-old is in the same country as all the clubs who have expressed an interest in signing him. With a contract at Bournemouth containing a £65m release clause that becomes active for the first two weeks of January, Manchester City appear to have won the race for the player who has scored 19 Premier League goals since the start of last season. Chelsea and Tottenham have now moved on to other targets but could Liverpool or Manchester United attempt to steal a late march on their rivals? They need to get a move on if so. Continue reading...",
      "publishedAt": "2025-12-30T10:27:32.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "David Squires on … football’s notable people and big moments from 2025",
      "link": "https://www.theguardian.com/football/picture/2025/dec/30/david-squires-on-footballs-notable-people-and-big-moments-from-2025",
      "summary": "Our cartoonist looks back at the big stories and memorable moments as we wave farewell to another year in football David’s favourite cartoons of 2025 | Buy one here And his latest book, Chaos in the Box: get it now Continue reading...",
      "publishedAt": "2025-12-30T10:00:03.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Prominent owner Sheikh Mohammed Obaid Al Maktoum dies",
      "link": "https://www.skysports.com/racing/news/12040/13488649/sheikh-mohammed-obaid-al-maktoum-prominent-owner-and-breeder-dies",
      "summary": "Trainer Karl Burke paid tribute to Sheikh Mohammed Obaid Al Maktoum following the leading owner and breeder’s death on Monday.",
      "publishedAt": "2025-12-30T09:04:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tiger turns 50 - but when will he return to competitive golf?",
      "link": "https://www.skysports.com/golf/news/12040/13481065/tiger-woods-when-will-he-return-from-injury-15-time-major-champion-offers-updates-on-2026-schedule-hopes",
      "summary": "Tiger Woods is celebrating his 50th birthday – but when will golf fans be toasting the 15-time major champion’s return to competitive action?",
      "publishedAt": "2025-12-30T08:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wiegman gets honorary damehood in New Year Honours",
      "link": "https://www.bbc.com/sport/articles/cy0p75qn0qqo?at_medium=RSS&at_campaign=rss",
      "summary": "Ice skaters Jayne Torvill and Christopher Dean become a dame and knight in the New Year Honours list, while England women's manager Sarina Wiegman is made an honorary dame.",
      "publishedAt": "2025-12-30T08:26:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Aston Villa the thorn in Arsenal’s side that Arteta has to remove for title push",
      "link": "https://www.theguardian.com/football/2025/dec/30/aston-villa-the-thorn-in-arsenals-side-that-arteta-has-to-remove-for-title-push",
      "summary": "Villa have sunk the Gunners’ title hopes in recent seasons but Gabriel’s return ready for Tuesday could be crucial It may be more than six years since Unai Emery left Arsenal but it’s hard to escape the feeling that the Spaniard still has an inexorable hold over his former club. Ever since Aston Villa ended a four-match losing streak against them with a 1-0 home win in December 2023, Emery has proved to be a thorn in Mikel Arteta’s side. Villa’s 2-0 victory at the Emirates a few months later ultimately cost Arsenal the title as a relentless Manchester City took advantage by winning their last eight matches. Arsenal had an impressive 2-0 triumph in Birmingham at the start of last season, but Villa’s comeback from two goals down to draw 2-2 in January of this year was symptomatic of Arsenal’s failure to chase down Liverpool in the title race that never was. Continue reading...",
      "publishedAt": "2025-12-30T08:00:02.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Can 'Champagne Charlie' upset Van Veen and reach Ally Pally quarter-finals?",
      "link": "https://www.skysports.com/darts/news/12040/13488376/world-darts-championship-champagne-charlie-manby-looks-to-continue-dream-run-against-gian-van-veen-at-alexandra-palace",
      "summary": "'Champagne' Charlie Manby takes on Gian van Veen at the World Darts Championship on Tuesday with a quarter-final spot on the line.",
      "publishedAt": "2025-12-30T07:00:00.000Z"
    }
  ]
}