{
  "generatedAt": "2025-12-30T15:26:34.824Z",
  "items": [
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Uganda v Nigeria: Africa Cup of Nations 2025 – live",
      "link": "https://www.theguardian.com/football/live/2025/dec/30/uganda-v-nigeria-africa-cup-of-nations-2025-live",
      "summary": "⚽ Afcon updates from the 4pm kick-off (GMT) in Group D ⚽ Live scores | Follow us on Bluesky | And email Michael That is a surprising XI from Nigeria! Not only because of who they have rested, but also who they have included. Only Bassey, Onyemaechi and Osimhen retain their place here from the XI that started against Tunisia. Captain Wilfred Ndidi, Semi Ajayi and goalkeeper Stanley Nwabali are all rested given the threat of suspension. The trio all received yellow cards in the group stage and another here would mean a suspension for the knockouts, so it’s smart to rest them. That makes the inclusion of superstar striker Osimhen all the more baffling, given he is also in the same boat. Éric Chelle will be praying the Galatasaray forward does not pick up another yellow here, or he will miss the last-16 match. Continue reading...",
      "publishedAt": "2025-12-30T15:25:32.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo’s move to Manchester City nears as Bournemouth hammer out terms",
      "link": "https://www.theguardian.com/football/2025/dec/30/antoine-semenyo-move-talks-manchester-city-bournemouth",
      "summary": "Move could be completed as soon as New Year’s Day City could let Oscar Bobb or Savinho leave Bournemouth expect Antoine Semenyo’s transfer to Manchester City to be finalised this week, with the only remaining issue being the payment terms of his release clause. The wide forward’s clause is worth slightly less than £65m, a sum that includes loyalty money and agent fees. City are thought to want to pay this over three years and Bournemouth believe an agreement will be sealed by Sunday at the latest but possibly as soon as New Year’s Day. Continue reading...",
      "publishedAt": "2025-12-30T14:54:27.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Amrabat staat pal achter Marokko-bondscoach: 'Kritiek hoort erbij, fluiten niet'",
      "link": "https://www.vi.nl/nieuws/amrabat-staat-pal-achter-marokko-bondscoach-kritiek-hoort-erbij-fluiten-niet",
      "summary": "Sofyan Amrabat heeft zich uitgesproken over de kritiek die Marokko-bondscoach Walid Regragui in aanloop naar het Afrika Cup-duel met Zambia heeft ontvangen. De middenvelder staat pal achter Regragui, die voor de aftrap werd uitgefloten door een aantal fans . Dat is niet de manier, vindt Amrabat.",
      "publishedAt": "2025-12-30T14:53:38.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Terence Kongolo naar beloften verbannen bij NAC",
      "link": "https://www.vi.nl/nieuws/terence-kongolo-naar-beloften-verbannen-bij-nac",
      "summary": "De rol van Terence Kongolo bij NAC Breda lijkt definitief uitgespeeld. De viervoudig Oranje-international is naar de beloften verwezen.",
      "publishedAt": "2025-12-30T14:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Zola ziet Højlund opbloeien bij Napoli en uit kritiek op Ten Hag",
      "link": "https://www.vi.nl/nieuws/zola-ziet-h-jlund-opbloeien-bij-napoli-en-uit-kritiek-op-ten-hag",
      "summary": "Gianfranco Zola is onder de indruk van Scott McTominay en Rasmus Højlund. Beiden werden voor hun transfer naar Napoli als overbodig bestempeld bij Manchester United, maar hebben The Red Devils inmiddels flink achter de oren laten krabben. Met name McTominay heeft zich ontpopt tot een superster in Napels. Volgens Zola ligt de schuld vooral bij Erik Ten Hag.",
      "publishedAt": "2025-12-30T14:16:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Inter zet deur open voor De Vrij, aanvaller Spurs op weg naar Palace'",
      "link": "https://www.vi.nl/nieuws/inter-zet-deur-open-voor-de-vrij-aanvaller-spurs-op-weg-naar-palace",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2025-12-30T14:08:26.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De Toekomst van Oranje is terug",
      "link": "https://www.vi.nl/video/de-toekomst-van-oranje-is-terug",
      "summary": "De Toekomst van Oranje is terug. Voetbal International sprak in deze serie in het verleden met toptalenten zoals Cody Gakpo, Brian Brobbey en de gebroeders Timber. Nu is het de beurt aan Isaac Babdi, Gjivai Zechiël, Ezechiel Banzuzi en Ernest Poku. We bespreken hun kwaliteiten, valkuilen en dromen!",
      "publishedAt": "2025-12-30T13:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "From Liverpool to Chelsea, ranking 8 Premier League clubs' transfer needs",
      "link": "https://www.espn.com/soccer/story/_/id/47438677/premier-league-transfer-needs-ranked-liverpool-arsenal-man-united-man-city-chelsea-ryan-ohanlon",
      "summary": "The January transfer window is about to open, so let's look at which Premier League teams need to make moves to improve for the rest of the season.",
      "publishedAt": "2025-12-30T13:04:29.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League summer transfer overperformers",
      "link": "https://www.espn.com/soccer/story/_/id/47408516/top-premier-league-signings-summer-transfer-window-madueke-xhaka",
      "summary": "Some of last summer's transfers have been vital for their clubs. Here are the 10 players who have most impressed.",
      "publishedAt": "2025-12-30T13:04:29.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Ronaldo wants 1k goals; open to Europe return",
      "link": "https://www.espn.com/soccer/story/_/id/47441885/cristiano-ronaldo-reiterates-desire-reach-1000-goals-retiring",
      "summary": "Portugal captain Cristiano Ronaldo has reiterated his desire to reach 1,000 career goals before he calls time on his playing career.",
      "publishedAt": "2025-12-30T13:03:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Hakimi returns as Morocco seal AFCON knockouts",
      "link": "https://www.espn.com/espn/story/_/id/47446867/achraf-hakimi-returns-morocco-afcon-knockouts",
      "summary": "Africa Cup of Nations hosts Morocco dispatched Zambia 3-0 at a fervid Prince Moulay Abdellah Stadium in Rabat on Monday to round off their Group A campaign in style and ease into the round of 16.",
      "publishedAt": "2025-12-30T13:03:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham into top half of Championship after win",
      "link": "https://www.espn.com/soccer/report/_/gameId/744881",
      "summary": "null",
      "publishedAt": "2025-12-30T13:03:27.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Body language and new-ball woes - Broad's verdict on England bowlers",
      "link": "https://www.skysports.com/cricket/news/12040/13488336/the-ashes-stuart-broad-delivers-verdict-on-englands-bowling-unit-after-series-defeat-down-under",
      "summary": "England's batters have taken quite the battering after numerous collapses contributed to a fourth successive Ashes series defeat in Australia.",
      "publishedAt": "2025-12-30T13:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Crystal Palace agree £35m fee for Brennan Johnson as race for Spurs forward hots up",
      "link": "https://www.theguardian.com/football/2025/dec/30/crystal-palace-agree-transfer-fee-brennan-johnson-spurs",
      "summary": "Figure would be a club-record transfer for Palace Johnson yet to decide with Bournemouth also interested Crystal Palace have agreed a club-record £35m fee with Tottenham for Brennan Johnson but are facing strong competition from Bournemouth to sign the Wales forward. Palace are desperate for reinforcements in attack after a punishing schedule that has seen them play 30 games in all competitions this season because of their Conference League commitments. With Senegal forward Ismaïla Sarr away at the African Cup of Nations, the club identified Johnson as their primary target for the January window and opened talks with Tottenham several weeks ago. Continue reading...",
      "publishedAt": "2025-12-30T12:48:44.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Johnson to decide future after Palace deal agreed",
      "link": "https://www.bbc.com/sport/football/articles/clyky7nnpgzo?at_medium=RSS&at_campaign=rss",
      "summary": "Brennan Johnson is set to decide whether he wants to join Crystal Palace after the south London club agreed a £35m deal to sign the Tottenham attacker.",
      "publishedAt": "2025-12-30T12:12:36.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "What will women’s football in England look like in 10 years’ time?",
      "link": "https://www.theguardian.com/football/2025/dec/30/what-will-womens-football-in-england-look-like-in-10-years",
      "summary": "With the club game hurtling along a Premier League-trodden path, women’s football is at a crossroads Where will women’s football in England be in a decade’s time? How can we possibly begin to imagine the scale of the interest, attendances and participation then? How will the game on the pitch have developed, with each generation of players training and playing in better and better environments and at younger ages? In truth, it’s near impossible to make even educated guesses. Women’s football in England is at a crossroads. The Women’s Super League and Women’s Super League 2 are now run independently of the Football Association, leading to increased outside investment, the rise of multi-club ownership groups, and the million-pound transfer barrier being broken twice in one summer. Minimum standards in the WSL and WSL2 have also been extended or raised, and while there is always talk of maintaining the connection between players and supporters, the women’s game is hurtling along a Premier League-trodden path at a fierce pace. Continue reading...",
      "publishedAt": "2025-12-30T12:06:14.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship: Clayton fights back to lead Harrysson LIVE!",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2025-12-30T12:02:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool set-piece coach Aaron Briggs leaves club after defensive struggles",
      "link": "https://www.theguardian.com/football/2025/dec/30/liverpool-set-piece-coach-aaron-briggs-leaves-club",
      "summary": "Champions have conceded 12 set-piece goals in league Arne Slot expressed his dismay before Wolves game Liverpool have parted company with their first-team set-piece coach, Aaron Briggs, in response to the weaknesses that have blighted Arne Slot’s side this season. Slot has made no secret of his dismay with Liverpool’s set-piece failings at both ends of the pitch, and admitted they were holding back the Premier League champions before Saturday’s 2-1 win over Wolves. Continue reading...",
      "publishedAt": "2025-12-30T11:30:40.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool set-piece coach leaves club amid woeful record this season",
      "link": "https://www.skysports.com/football/news/12040/13488666/liverpool-set-piece-coach-aaron-briggs-leaves-club-with-reds-having-joint-worst-record-in-europe-this-season",
      "summary": "Liverpool set-piece coach Aaron Briggs has left the club midway through a season in which the Reds have the joint-worst set-play record in Europe's big five leagues.",
      "publishedAt": "2025-12-30T10:59:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Prominent owner Sheikh Mohammed Obaid Al Maktoum dies",
      "link": "https://www.skysports.com/racing/news/12040/13488649/sheikh-mohammed-obaid-al-maktoum-prominent-owner-and-breeder-dies",
      "summary": "Trainer Karl Burke paid tribute to Sheikh Mohammed Obaid Al Maktoum following the leading owner and breeder’s death on Monday.",
      "publishedAt": "2025-12-30T09:04:00.000Z"
    }
  ]
}