{
  "generatedAt": "2025-12-27T17:20:06.547Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Mané voorkomt Senegalese nederlaag, Benin boekt eerste Afrika Cup-zege ooit",
      "link": "https://www.vi.nl/nieuws/man-voorkomt-senegalese-nederlaag-benin-boekt-eerste-afrika-cup-zege-ooit",
      "summary": "Het blijft spannend in Groep D van de Afrika Cup. Senegal en DR Congo hielden elkaar zaterdagmiddag in evenwicht, waardoor de beslissing aankomt op de laatste speelronde van de groepsfase. Benin won eerder op de dag al van Botswana, waardoor ook zij er goed voor staan richting de knock-outfase.",
      "publishedAt": "2025-12-27T17:19:19.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea v Aston Villa: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2025/dec/27/chelsea-v-aston-villa-premier-league-live",
      "summary": "⚽ Updates from the 5.30pm Premier League kick-off ⚽ Scores | Table | Follow us on Bluesky | Mail Will here Meanwhile Enzo Maresca, who is serving a touchline ban after being booked in Chelsea’s 2-2 draw with Newcastle, has brought in Benoît Badiashile and Enzo Fernández at the expense of Wesley Fofana and Malo Gusto. Unai Emery has made two changes to the side which beat Manchester United last time out, Emi Buendía and Donyell Malen swapping in for Amadou Onana and Ollie Watkins. It’s not often Watkins has ended up on the bench this season, so it’s an interesting reshuffle. Continue reading...",
      "publishedAt": "2025-12-27T17:13:04.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Raúl Jiménez rouses Fulham to leave Nuno’s hapless West Ham in desperation zone",
      "link": "https://www.theguardian.com/football/2025/dec/27/west-ham-fulham-premier-league-match-report-raul-jimenez",
      "summary": "Raúl Jiménez deepened West Ham’s relegation worries as Fulham snatched victory with five minutes remaining, his second goal in two matches giving Fulham a third straight win. Manchester City’s lunchtime victory at Nottingham Forest gave the Hammers the chance to cut the gap to 17th place to just two points. But instead they remain five points adrift of safety after the first of a run of supposedly winnable games, with Brighton and Forest still to come to east London, either side of a trip to rock-bottom Wolves. Continue reading...",
      "publishedAt": "2025-12-27T17:12:44.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ødegaard’s strike and Rice’s flexibility steer Arsenal past Brighton and back to top",
      "link": "https://www.theguardian.com/football/2025/dec/27/arsenal-brighton-premier-league-match-report",
      "summary": "A few minutes before half-time in a contest that swung entirely one way and then briefly the other, Brighton & Hove Albion threatened what was then a rare foray into Arsenal territory. For the briefest of moments, the visitors seemed certain to muster their first shot of an afternoon that had hitherto been miserable. But, no sooner had Maxim De Cuyper received the ball on the counterattack and glanced up, than the Belgian was flattened by a crunching Declan Rice tackle that hastily restored possession for the hosts. De Cuyper slumped, while Rice towered over him and roared; arguably this season’s standout Premier League midfielder making light of playing right-back for the first time in his Arsenal career. Continue reading...",
      "publishedAt": "2025-12-27T17:11:37.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League live updates: Arsenal beat Brighton to regain top spot; Liverpool win vs. Wolves",
      "link": "https://www.espn.com/soccer/story/_/id/47327288/premier-league-live-updates-nottingham-forest-manchester-city-arsenal-brighton-liverpool-wolves-chelsea-aston-villa",
      "summary": "null",
      "publishedAt": "2025-12-27T17:10:17.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep Guardiola on Rayan Cherki: 'Moments I shout at him, moments I want to kiss him'",
      "link": "https://www.espn.com/soccer/story/_/id/47426774/pep-guardiola-man-city-rayan-cherki-moments-shout-moments-want-kiss-him",
      "summary": "Manchester City boss Pep Guardiola has endured frustration with Rayan Cherki, but not today.",
      "publishedAt": "2025-12-27T17:10:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Burnley’s lack of quality allows depleted Everton to leave with a point",
      "link": "https://www.theguardian.com/football/2025/dec/27/burnley-everton-premier-league-match-report",
      "summary": "Burnley must be wondering where their next win is coming from. It has been more two months and nine games since their most recent one in the Premier League. They were the superior team here on Saturday, but unable to find the goal to close the gap on 17th. The hosts had more of the ball and chances but of their 16 shots, they failed to find the target once, explaining why they find themselves six points from safety. There was plenty of effort and endeavour from Burnley, but further evidence they lack the quality required. For Everton, they will be pleased to avoid a third defeat in a row. Continue reading...",
      "publishedAt": "2025-12-27T17:05:35.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Gravenberch en Frimpong belangrijk voor Liverpool op emotionele middag",
      "link": "https://www.vi.nl/nieuws/gravenberch-en-frimpong-belangrijk-voor-liverpool-op-emotionele-middag",
      "summary": "Liverpool heeft ten koste van hekkensluiter Wolverhampton Wanderers voor de derde keer op rij gewonnen in de Premier League. Rond de wedstrijd waarin Ryan Gravenberch de score opende stond veel in het teken van het herdenken van Diogo Jota, de op 28-jarige leeftijd overleden Portugees die zowel bij Liverpool als Wolves een rijk verleden heeft.",
      "publishedAt": "2025-12-27T17:05:16.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "We would have lost that game last season - Guardiola",
      "link": "https://www.bbc.com/sport/football/articles/c5y91djgky1o?at_medium=RSS&at_campaign=rss",
      "summary": "Pep Guardiola warned his players not to be overweight in the festive season - but there is little fat to trim at Manchester City who saw off Nottingham Forest at the City Ground.",
      "publishedAt": "2025-12-27T17:04:45.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Succesje voor Ødegaard bij benauwde zege van koploper Arsenal op Brighton",
      "link": "https://www.vi.nl/nieuws/succesje-voor-degaard-bij-benauwde-zege-van-koploper-arsenal-op-brighton",
      "summary": "Arsenal heeft zaterdag een benauwde zege geboekt in de Premier League. The Gunners hadden voor lange tijd geen kind aan Brighton & Hove Albion, maar moesten diep gaan om Manchester City weer in te halen.",
      "publishedAt": "2025-12-27T17:03:33.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wirtz scores first Liverpool goal in nervy win over Wolves",
      "link": "https://www.skysports.com/football/liverpool-vs-wolverhampton-wanderers/report/531304",
      "summary": "Florian Wirtz scored his first Premier League goal as Liverpool held on to beat Wolves 2-1 at a nervous Anfield.",
      "publishedAt": "2025-12-27T17:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Chelsea en Aston Villa maken zich op voor subtop-kraker",
      "link": "https://www.vi.nl/nieuws/vi-live-liverpool-met-frimpong-en-chiesa-timber-ontbreekt-bij-arsenal",
      "summary": "Goedendag en welkom in de VI Live van zaterdag 27 december. Hopelijk had u een fijne kerstperiode, en bent u klaar voor een fraaie dag vol voetbal. In dit blog hoeft u niks te missen van mooie affiches in onder meer Italië, Engeland en Marokko.",
      "publishedAt": "2025-12-27T16:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Solness denies Marine Nationale in Leopardstown thriller",
      "link": "https://www.skysports.com/racing/news/12040/13487801/solness-denies-marine-nationale-in-leopardstown-thriller",
      "summary": "Solness repeated his victory of 12 months ago in the Paddy’s Rewards Club Chase when seeing off a truly gallant Marine Nationale in a thrilling race at Leopardstown.",
      "publishedAt": "2025-12-27T16:39:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Haiti Couleurs takes out the Coral Welsh Grand National",
      "link": "https://www.skysports.com/racing/news/12040/13487798/welsh-wonders-curtis-and-bowen-record-famous-home-win-with-haiti-couleurs",
      "summary": "Haiti Couleurs was the toast of Chepstow after producing a magnificent front-running display to add the Coral Welsh Grand National to the Irish equivalent he won earlier in the year.",
      "publishedAt": "2025-12-27T16:29:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Vrouwencoach Valencia (44) en drie van zijn kinderen omgekomen na schipbreuk",
      "link": "https://www.vi.nl/nieuws/vrouwencoach-valencia-44-en-drie-van-zijn-kinderen-omgekomen-na-schipbreuk",
      "summary": "Een bijzonder triest bericht vanuit Spanje. Valencia deelt dat Fernando Martín (44) - de coach van Valencia Vrouwen B - en drie van zijn kinderen na een schipbreuk om het leven zijn gekomen tijdens een vakantie in Indonesië.",
      "publishedAt": "2025-12-27T16:05:58.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Jota's children lead tributes before Liverpool v Wolves",
      "link": "https://www.bbc.com/sport/football/articles/c9d97epel43o?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool and Wolves pay tribute to Diogo Jota as his two former sides meet for the first time since his death.",
      "publishedAt": "2025-12-27T15:59:18.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Inoue outclasses Picasso to retain world title and remain undefeated",
      "link": "https://www.skysports.com/boxing/news/12040/13487779/naoya-inoue-outclasses-alan-david-picasso-to-retain-undisputed-super-bantamweight-title-and-remain-undefeated",
      "summary": "Japan's Naoya Inoue retained his undisputed super-bantamweight crown in dominant fashion against Alan David Picasso on Saturday, winning by unanimous decision in Riyadh.",
      "publishedAt": "2025-12-27T15:42:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Match officials had 'bad day at office' - Dyche",
      "link": "https://www.bbc.com/sport/football/videos/cly1j45pk6ro?at_medium=RSS&at_campaign=rss",
      "summary": "Nottingham Forest manager Sean Dyche says he cannot understand the match officials' calls against his side in their 2-1 defeat by Manchester City.",
      "publishedAt": "2025-12-27T15:12:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City found right mentality to beat Nottingham Forest - Guardiola",
      "link": "https://www.bbc.com/sport/football/videos/ce91k8ypvyro?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City manager Pep Guardiola says that his side had the necessary mentality to come back after Christmas and beat Nottingham Forest 2-1.",
      "publishedAt": "2025-12-27T15:05:07.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rayan Cherki grabs Manchester City winner to deny bold Nottingham Forest",
      "link": "https://www.theguardian.com/football/2025/dec/27/nottingham-forest-manchester-city-premier-league-match-report",
      "summary": "Judging by the way Gianluigi Donnarumma and his teammates celebrated Rayan Cherki’s sweet late winner at Nottingham Forest, this was a significant victory for Manchester City. Donnarumma hurtled 40 yards towards the away technical area where Pep Guardiola was mobbed by his coaching staff, including Pep Lijnders and the set-piece coach James French, the architect behind Phil Foden’s corner that led to the goal that extended their winning run to eight matches. Then for a moment of calm, Cherki mimicked Erling Haaland’s meditation pose on the City Ground turf. It is now six wins in a row in the Premier League, the kind of ominous run they had not stitched together since winning their final nine matches of 2023-24. Everyone knows how that finished, City pipping Arsenal to the title by two points. This was anything but a straightforward victory, the City centre-backs Rúben Dias and Josko Gvardiol unusually ruffled by the Forest striker Igor Jesus; Dias was fortunate to finish an entertaining match with only a caution and Gvardiol got off the hook altogether. Sean Dyche, the Forest manager, was adamant Morgan Gibbs-White was impeded in the buildup to Cherki’s winner, a first-time strike that whistled through the legs of the Forest captain and low into the corner of past John Victor. Gibbs-White went to ground under pressure from Nico O’Reilly before an unmarked Gvardiol cushioned the ball into the path of Cherki who, just inside Forest’s 18-yard box, struck to maintain his sparkling form. Dyche felt the officials should have intervened: “It was such an easy game to referee, in my opinion, such an easy decision for VAR.” Continue reading...",
      "publishedAt": "2025-12-27T14:44:06.000Z"
    }
  ]
}