{
  "generatedAt": "2026-01-01T04:11:14.610Z",
  "items": [
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Joshua discharged from hospital after fatal car crash",
      "link": "https://www.skysports.com/boxing/news/12040/13489154/anthony-joshua-british-boxer-and-former-world-champion-discharged-from-hospital-after-fatal-car-crash-in-nigeria",
      "summary": "Anthony Joshua has been discharged from hospital less than three days after a car crash in Nigeria that killed two of his close friends.",
      "publishedAt": "2026-01-01T00:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Enzo Maresca on brink of Chelsea sack after breakdown of relations",
      "link": "https://www.theguardian.com/football/2025/dec/31/enzo-maresca-at-risk-of-chelsea-sack-january",
      "summary": "Club set to open new year with emergency talks Cryptic comments have led to rapid escalation Enzo Maresca is on the brink of leaving Chelsea after a complete breakdown in his relationship with the club. The situation around the head coach has been unpredictable for weeks and it is highly likely that a parting of the ways is expected to take place on Thursday. Chelsea are set to open the new year by holding emergency talks over Maresca’s position. It is expected that the Italian, who was booed by supporters during the disappointing 2-2 draw with Bournemouth at Stamford Bridge on Tuesday, will not be in charge for Sunday’s trip to Manchester City. Sources have indicated that Maresca wants to leave the club but it is unclear if he is willing to walk away without a payoff. His contract runs until 2029, with an option for an extra year. Continue reading...",
      "publishedAt": "2026-01-01T00:03:05.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Manchester United to sign Yan Diomande and Rúben Neves?",
      "link": "https://www.theguardian.com/football/2026/jan/01/football-transfer-rumours-manchester-united-to-sign-yan-diomande-and-ruben-neves",
      "summary": "Today’s rumours are back and bleary-eyed, baby Men’s transfer window interactive: January 2026 edition After the bongs and fireworks, 2026 has finally begun. Naturally, no one really cares about resolutions, the real interest is in whether your team will sign a new left-back. Tittle-tattle is back in the limelight and the Rumour Mill will be firing up the very best – and worst – of it over the coming month. It seems like everyone in the Premier League needs to get the pen and chequebook out to solve their problems, making it an intriguing month ahead. After missing out on Antoine Semenyo, Manchester United will need to look elsewhere for attacking reinforcements. One name that keeps cropping up in RB Leipzig’s Yan Diomande and the German side want around £87m for the Ivorian teenager. Bayern Munich and Paris Saint-Germain are also keeping tabs on Diomande, which will make any purchase a touch trickier. Continue reading...",
      "publishedAt": "2026-01-01T00:01:23.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De beste wensen voor 2026",
      "link": "https://www.vi.nl/nieuws/de-beste-wensen-voor-2026",
      "summary": "Voetbal International wenst u een mooi, sportief en voorspoedig 2026. Een jaar waarin wij met de grootste voetbalredactie van Nederland weer op elk moment van de dag u maximaal naar wens voorzien van alle ontwikkelingen in het voetballandschap.",
      "publishedAt": "2025-12-31T23:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Madrid's Mbappé (knee) doubtful for Supercopa",
      "link": "https://www.espn.com/soccer/story/_/id/47462555/kylian-mbappe-sidelined-knee-injury-doubt-supercopa-sources",
      "summary": "Kylian Mbappé will miss Real Madrid's LaLiga game with Real Betis and is a doubt for next week's Spanish Supercopa, sources have told ESPN, due to a knee injury.",
      "publishedAt": "2025-12-31T22:47:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Holders Ivory Coast rally to win group at AFCON",
      "link": "https://www.espn.com/soccer/story/_/id/47465955/defending-champs-ivory-coast-rally-top-afcon-group",
      "summary": "Defending Africa Cup of Nations champions Ivory Coast came from two goals down to defeat Gabon 3-2 in their final Group F fixture in Marrakesh on Wednesday, qualifying them as group winners to set up a round of 16 showdown with Burkina Faso.",
      "publishedAt": "2025-12-31T22:47:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Modric: Mourinho at Madrid 'made Ronaldo cry'",
      "link": "https://www.espn.com/soccer/story/_/id/47462411/luka-modric-mourinho-once-made-cristiano-ronaldo-cry",
      "summary": "Croatia and AC Milan midfielder Luka Modric said on Wednesday that Jose Mourinho was such a tough manager during their time at Real Madrid that he once reduced star player Cristiano Ronaldo to tears.",
      "publishedAt": "2025-12-31T22:47:36.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City welcome Rodri back with Guardiola ‘prouder than ever’ of 2025 efforts",
      "link": "https://www.theguardian.com/football/2025/dec/31/manchester-city-welcome-rodri-back-with-guardiola-prouder-than-ever-of-2025-efforts",
      "summary": "Manager praises his team’s turnaround in past 12 months January arrivals also hailed for making a key difference Pep Guardiola has praised Manchester City for turning their form around to become the best-performing Premier League team in 2025 and warned rivals they will improve once Rodri returns to full fitness. Despite a rare trophyless season, City go to Sunderland on New Year’s Day with 2025’s best points-per-game ratio, narrowly ahead of Arsenal, who played two more league matches. Continue reading...",
      "publishedAt": "2025-12-31T22:30:21.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Vroege' CL-finale en gekortwiekte play-offs: 10 belangrijke voetbaldata in 2026",
      "link": "https://www.vi.nl/nieuws/vroege-cl-finale-en-gekortwiekte-play-offs-10-belangrijke-voetbaldata-in-2026",
      "summary": "Met een XXL-WK voor de deur wordt het sowieso een bijzonder voetbaljaar. VI zet alvast tien belangrijke data in 2026 op een rij.",
      "publishedAt": "2025-12-31T22:29:59.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ivoorkust na fraaie comeback groepswinnaar op Afrika Cup",
      "link": "https://www.vi.nl/nieuws/ivoorkust-na-fraaie-comeback-groepswinnaar-op-afrika-cup",
      "summary": "Het al geplaatste Ivoorkust heeft zich woensdag tijdens de laatste duels in Groep F de kaas van het brood laten eten door het al uitgeschakelde Gabon. De titelverdediger moet daardoor voorrang verlenen aan Kameroen, dat geen fout maakte tegen Mozambique.",
      "publishedAt": "2025-12-31T22:05:55.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2025-12-31T22:01:49.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Afcon roundup: Côte d’Ivoire pip Cameroon with dramatic win over Gabon",
      "link": "https://www.theguardian.com/football/2025/dec/31/afcon-roundup-burkina-faso-sudan-algeria-equatorial-guinea-cote-divoire-cameroon-gabon-mozambique",
      "summary": "Holders come from two goals down to win 3-2 Burkina Faso beat Sudan as both sides progress Côte d’Ivoire came from two goals down to beat already eliminated Gabon 3-2 in Group F at the Africa Cup of Nations on Wednesday as the teenager Bazoumana Touré’s headed winner in added time in Marrakech handed them top spot. The Ivorians finished on seven points from their three games, ahead of Cameroon on goals scored after the latter beat third-placed Mozambique. Gabon were ahead on 11 minutes when Guélor Kanga profited from a mistake from the goalkeeper Alban Lafont as he spilled a tame shot, allowing the forward to score from close range. It was 2-0 on 21 minutes and this time Lafont had no chance. Denis Bouanga curled a superb shot from the left-hand side of the box across the goal and into the far corner. Continue reading...",
      "publishedAt": "2025-12-31T21:32:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Seven questions Liverpool must answer in the transfer window",
      "link": "https://www.espn.com/soccer/story/_/id/47456664/the-january-transfer-window-moves-liverpool-make",
      "summary": "The January transfer window opens soon, and top clubs like Liverpool have big and expensive decisions to make.",
      "publishedAt": "2025-12-31T21:32:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "What should Man United do in January?",
      "link": "https://www.espn.com/soccer/story/_/id/47442824/what-transfers-man-united-make-january-window",
      "summary": "There are plenty of big decisions to be made at Old Trafford, including concerning manager Ruben Amorim.",
      "publishedAt": "2025-12-31T21:32:36.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Dit is het schema van de achtste finale van de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/dit-is-het-schema-van-de-achtste-finale-van-de-afrika-cup",
      "summary": "In slechts elf dagen tijd is de groepsfase van de Afrika Cup afgewerkt. Na twee rustdagen gaat het toernooi zaterdag verder met de achtste finale. We zetten de wedstrijden op een rij.",
      "publishedAt": "2025-12-31T21:08:04.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham close in on Gil Vicente’s Pablo after going cold on Jørgen Strand Larsen",
      "link": "https://www.theguardian.com/football/2025/dec/31/west-ham-close-in-on-gil-vicentes-pablo-after-going-cold-on-jrgen-strand-larsen",
      "summary": "Costs for Strand Larsen high, with Wolves wanting £40m Gil Vicente’s Pablo has nine goals in Portuguese top flight West Ham are in advanced talks over a deal for the Gil Vicente forward Pablo after having second thoughts about bidding for the Wolves striker Jørgen Strand Larsen. Nuno Espírito Santo, whose side are at major risk of relegation from the Premier League, wants attacking reinforcements and club sources indicated on Tuesday that an opening offer for Strand Larsen was being prepared. However, there is a scattergun feel to West Ham’s recruitment and they have developed cold feet over the finances around Strand Larsen. Wolves want £40m for the Norwegian, whose wage demands are high. Continue reading...",
      "publishedAt": "2025-12-31T19:11:09.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Not just results - why Maresca is under pressure",
      "link": "https://www.bbc.com/sport/football/articles/cj0n8d913d8o?at_medium=RSS&at_campaign=rss",
      "summary": "Chelsea boss Enzo Maresca needs results to improve but issues off the pitch are adding to the pressure, BBC Sport's Nizaar Kinsella explains.",
      "publishedAt": "2025-12-31T18:21:17.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Everton wrongly denied penalty in Arsenal loss, says panel",
      "link": "https://www.bbc.com/sport/football/articles/cz9vwvde2y0o?at_medium=RSS&at_campaign=rss",
      "summary": "Everton should have been awarded a penalty in their 1-0 defeat by Arsenal, the Premier League's Key Match Incidents Panel has said.",
      "publishedAt": "2025-12-31T16:34:27.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maresca in danger of losing Chelsea job if results do not improve in January",
      "link": "https://www.skysports.com/football/news/12040/13489075/enzo-maresca-in-danger-of-losing-chelsea-job-unless-results-improve-in-january-after-run-of-one-win-in-seven-league-games",
      "summary": "Enzo Maresca will have to improve results at Chelsea quickly if he wants to keep his job after a run of one win in seven Premier League games.",
      "publishedAt": "2025-12-31T15:32:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Loughnane chalks up record-breaking 222nd win of the year",
      "link": "https://www.skysports.com/racing/news/12040/13489074/billy-loughnane-makes-history-as-he-breaks-kieren-fallons-record-for-most-wins-in-a-calendar-year-this-century",
      "summary": "Billy Loughnane broke the 21st century record for winners in a calendar year after he registered his 222nd success on Invited at Lingfield Park on New Year’s Eve.",
      "publishedAt": "2025-12-31T15:30:00.000Z"
    }
  ]
}