{
  "generatedAt": "2025-12-22T19:20:07.407Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Op de valreep: Spaanse arbiter trekt meest belachelijke rode kaart van 2025",
      "link": "https://www.vi.nl/nieuws/op-de-valreep-spaanse-arbiter-trekt-meest-belachelijke-rode-kaart-van-2025",
      "summary": "Het Spaanse Cedeira S.D. wist zijn voetbaljaar zondag niet optimaal af te sluiten. De Galicische club verloor in een competitiewedstrijd op regionaal niveau met 0-2 van CCRD Perlío. Een wel heel onbegrijpelijke arbitrale beslissing uit die wedstrijd maakte na afloop de tongen los.",
      "publishedAt": "2025-12-22T19:18:54.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'NEC-smaakmaker Sano kan zijn eigen broer opvolgen in Duitsland'",
      "link": "https://www.vi.nl/nieuws/az-anticipeert-met-hornkamp-op-mogelijke-transfer-parrott",
      "summary": "We zitten in het intermezzo tussen de zomer- en winterwindow, toch druppelt er in het najaar vaak nog een aantal transfers binnen. In dit blog vind je alle speculaties en bevestigde transfers in Nederland. Bekijk hier ons blog voor de transferperikelen in het buitenland.",
      "publishedAt": "2025-12-22T19:04:14.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Fulham v Nottingham Forest: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2025/dec/22/fulham-v-nottingham-forest-premier-league-live",
      "summary": "⚽ Premier League updates from the 8pm GMT kick-off ⚽ Live scores | Table | Ten things we learned | Mail Scott Nottingham Forest boss Sean Dyche speaks to Sky Sports. “Doug [Luiz] has certainly got Premier League experience … a very good footballer … on the verge of being fully match fit … Mats [Sels] has only had four days training … a bad finger … a groin … we’ve had to be careful with that … but John [Victor] has earned the right for this one with two very strong performances … [the 3-0 win over Spurs] was certainly the most consistent performance [this season] … we want the players to keep building and delivering at that level … we know we’re going to have to be strong tonight.” Fulham make one change from the starting XI selected for last Wednesday’s 2-1 League Cup defeat at Newcastle. Bernd Leno comes back into the team, with cup keeper Benjamin Lecomte dropping to the bench. Calvin Bassey, Samuel Chukwueze and Alex Iwobi are all on Afcon duty with Nigeria. Continue reading...",
      "publishedAt": "2025-12-22T19:02:08.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Kane smashes Arjen Robben record in Bayern rout",
      "link": "https://www.espn.com/soccer/report/_/gameId/746846",
      "summary": "Harry Kane scored his 30th club goal of the season as Bayern Munich shrugged off an injury and illness crisis to sweep past Heidenheim 4-0 on Sunday and go into the Bundesliga's winter break with a nine-point lead.",
      "publishedAt": "2025-12-22T18:54:10.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Dalot: Fernandes injury 'massive' blow to Utd",
      "link": "https://www.espn.com/soccer/story/_/id/47388137/bruno-fernandes-injury-massive-blow-man-united-diogo-dalot",
      "summary": "Diogo Dalot called Bruno Fernandes' injury a \"massive\" blow as Manchester United wait to find out the severity of the skipper's setback.",
      "publishedAt": "2025-12-22T18:54:10.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Alves buys Portuguese club, may play",
      "link": "https://www.espn.com/soccer/story/_/id/47388411/dani-alves-buys-portuguese-club-mulls-return-42-sources",
      "summary": "Former Barcelona and Brazil defender Dani Alves has finalised details to acquire Portuguese third division club Sporting Clube de São João de Ver, sources told ESPN Brazil's Bruno Andrade.",
      "publishedAt": "2025-12-22T18:54:10.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Nigeria using WC 'pain' as motivation at AFCON",
      "link": "https://www.espn.com/soccer/story/_/id/47390865/nigeria-using-wc-pain-motivation-afcon",
      "summary": "Stung by their failure to qualify for the 2026 FIFA World Cup, Victor Osimhen said Nigeria are determined to use the Africa Cup of Nations to channel their disappointment into tournament success in Morocco.",
      "publishedAt": "2025-12-22T18:54:10.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Real Madrid akkoord met tijdelijk vertrek van WK dromende Endrick'",
      "link": "https://www.vi.nl/nieuws/real-madrid-akkoord-met-tijdelijk-vertrek-van-wk-dromende-endrick",
      "summary": "Real Madrid lijkt een oplossing te hebben gevonden voor de behoorlijk uitzichtloze situatie waarin tienerster Endrick zich bevindt. L'Equipe pakt uit met het nieuws dat de Braziliaanse aanvaller op huurbasis naar Olympique Lyon zal gaan.",
      "publishedAt": "2025-12-22T18:46:54.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship LIVE! Humphries vs Lim headlines bumper evening session",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2025-12-22T18:33:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Kafka in Kameroen: bondscoach Brys niet ontslagen, maar ook niet op de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/kafka-in-kameroen-bondscoach-brys-niet-ontslagen-maar-ook-niet-op-de-afrika-cup",
      "summary": "Kameroen is onder leiding van trainer David Pagou afgereisd naar Marokko, waar de ploeg woensdag aan de Afrika Cup begint. De soap met bondscoach Marc Brys gaat tegelijkertijd onverminderd verder: de Vlaming stelt dat hij nog altijd geen communicatie heeft gehad waaruit blijkt dat hij niet langer de keuzeheer is.",
      "publishedAt": "2025-12-22T18:29:24.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Genk stelt na afzegging Hoefkens nieuwe hoofdtrainer aan",
      "link": "https://www.vi.nl/nieuws/genk-stelt-na-afzegging-hoefkens-nieuwe-hoofdtrainer-aan",
      "summary": "RC Genk heeft een nieuwe hoofdtrainer gevonden. De Belgische club, die eerder zonder succes een lijntje uitwierp naar NAC-coach Carl Hoefkens, maakt via de officiële website melding van de komst van Nicky Hayen.",
      "publishedAt": "2025-12-22T18:15:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Christmas Day NBA on Sky Sports: LeBron, Curry, Wembanyama and more!",
      "link": "https://www.skysports.com/nba/news/12040/13486802/christmas-day-nba-on-sky-sports-og-anunoby-shai-gilgeous-alexander-vs-victor-wembanyama-lebron-james-steph-curry-nikola-jokic-and-more",
      "summary": "The NBA's Christmas Day game has been a tradition since 1947 and continues to showcase some of the league's biggest teams and superstars.",
      "publishedAt": "2025-12-22T18:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Saudi Prince threatened Sheff Utd with wind-up order",
      "link": "https://www.skysports.com/football/news/12040/13486739/sheffield-united-saudi-prince-threatened-new-blades-owners-with-liquidation-over-10m-debt",
      "summary": "Former Sheffield United owner Prince Abdullah of Saudi Arabia was poised to issue a winding-up order on the club over a £10m debt owed to him by new owners COH Sports.",
      "publishedAt": "2025-12-22T18:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Box-office' Evans dumps out seventh seed Wade in Ally Pally classic",
      "link": "https://www.skysports.com/darts/news/12040/13486654/world-darts-championship-rapid-ricky-evans-dumps-out-seventh-seed-james-wade-in-alexandra-palace-classic",
      "summary": "'Rapid' Ricky Evans produced a \"box-office\" display as he dumped out seventh seed James Wade in a World Championship classic at Alexandra Palace on Monday.",
      "publishedAt": "2025-12-22T17:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Milan’s Serie A match in Australia called off after ‘unacceptable requests’",
      "link": "https://www.theguardian.com/football/2025/dec/22/milans-serie-a-match-in-australia-called-off-after-unacceptable-requests",
      "summary": "Milan-Como was intended for Perth on 8 February Asian Football Confederation wanted to impose conditions The proposal to play a Serie A match between Milan and Como in Perth, Australia, has been cancelled due to football sanctions and conditions imposed by the Asian Football Confederation (AFC). The game was set to become the first major European domestic league fixture to be played outside its home country but will now not go ahead because of the financial risks and last-minute complications. Continue reading...",
      "publishedAt": "2025-12-22T17:07:35.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Just reach out' - Man Utd's Bennett on his father's suicide",
      "link": "https://www.bbc.com/sport/football/articles/cx2e5jn466go?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United defender Rhys Bennett discusses his father's death in October to help raise awareness of mental health issues.",
      "publishedAt": "2025-12-22T17:03:55.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wolves’ freefall leaves even Derby’s dismal record low a lofty goal",
      "link": "https://www.theguardian.com/football/2025/dec/22/wolves-premier-league-freefall-derby-county-record",
      "summary": "A side that once looked resilient has collapsed into historic futility, with Wolves now facing the grim task of avoiding the worst season English league football has ever seen Saturday’s defeat at home to Brentford means Wolves have taken just two points for 17 games. No side in the entire history of English league football, in any division, has ever made a worse start than that. To reach 11 points, the record low for a Premier League season set by Derby County in 2007-08, would require a significant improvement. How can this have happened? Wolves finished 16th last season, recovering after a dismal start. When Vitor Pereira took over on 19 December last year, they were second bottom on nine points from 16 games. They picked up 23 points from the final 22 games of the season and effectively ended any prospect of relegation with a run of six successive victories in the spring. How can a team go from averaging near enough a point a game to a 10th of that? The drop-off is extraordinary. This is an extract from Soccer with Jonathan Wilson, a weekly look from the Guardian US at the game in Europe and beyond. Subscribe for free here. Have a question for Jonathan? Email soccerwithjw@theguardian.com, and he’ll answer the best in a future edition. Continue reading...",
      "publishedAt": "2025-12-22T16:53:33.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "How could Man Utd replace injured Fernandes?",
      "link": "https://www.bbc.com/sport/football/articles/c1dz1exq616o?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United are still evaluating the extent of Bruno Fernandes' injury, but who are the contenders to replace him if he is ruled out?",
      "publishedAt": "2025-12-22T15:56:54.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "After years away, Sunderland's Premier League return has revived the club and its city",
      "link": "https://www.espn.com/soccer/story/_/id/47358780/sunderland-premier-league-return-newcastle-granit-xhaka-bruce-schoenfeld-sunderland-til-die-netflix",
      "summary": "By any measure, Sunderland is one of the revelations of the season. The question now is no longer whether they'll stay up, but how high they can finish and, after all their fans have gone through, whether that even matters.",
      "publishedAt": "2025-12-22T15:37:47.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Milan agree loan deal for Niclas Füllkrug as West Ham look to sign new striker",
      "link": "https://www.theguardian.com/football/2025/dec/22/milan-agree-loan-deal-for-niclas-fullkrug-as-west-ham-look-to-sign-new-striker",
      "summary": "Milan have option to buy German at end of season West Ham interested in Wolves’s Jørgen Strand Larsen Milan have agreed to sign West Ham’s Niclas Füllkrug on loan with an option to buy at the end of the season. The Germany striker has toiled since moving to the London Stadium from Borussia Dortmund for £27.5m in the summer of 2024 and it is hoped that his exit will free up funds for Nuno Espírito Santo to boost his side’s fight against relegation by bringing in a new forward during next month’s transfer window. West Ham are interested in Wolves’s Jørgen Strand Larsen but are reluctant to meet his valuation. It is believed that the Premier League’s bottom-placed side want £40m for the Norwegian. West Ham’s budget is limited and they feel that the package for Strand Larsen, who has scored once in the league this season, is too expensive. Continue reading...",
      "publishedAt": "2025-12-22T15:12:02.000Z"
    }
  ]
}