{
  "generatedAt": "2025-12-25T20:27:14.638Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wijnaldum geeft zijn kerst kleur met wéér een goal",
      "link": "https://www.vi.nl/nieuws/wijnaldum-geeft-zijn-kerst-kleur-met-w-r-een-goal",
      "summary": "Georginio Wijnaldum heeft zich op eerste kerstdag met onder meer een doelpunt laten zien bij Al-Ettifaq. Voor de 35-jarige Nederlander en zijn teamgenoten was de overwinning op Al Riyadh pas de vierde van het seizoen in de Saoedische competitie.",
      "publishedAt": "2025-12-25T20:15:02.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Espanyol leeft met vrees naar derby tegen Barça toe en hangt netten op",
      "link": "https://www.vi.nl/nieuws/espanyol-leeft-met-vrees-naar-derby-tegen-bar-a-toe-en-hangt-netten-op",
      "summary": "Bij Espanyol is de vrees voor ongeregeldheden in de beladen thuiswedstrijd tegen Barcelona groot. Daarom heeft de club besloten grote netten te laten ophangen.",
      "publishedAt": "2025-12-25T19:59:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Premier League voorspellen: dit wordt de topvijf van Engeland",
      "link": "https://www.vi.nl/video/premier-league-voorspellen-dit-wordt-de-topvijf-van-engeland",
      "summary": "In Rondje Boxing Day voorspellen kenners buitenlands voetbal Süleyman Öztürk en Bas van den Hoven de top-vijf in de Premier League.",
      "publishedAt": "2025-12-25T19:42:01.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Waarom er dit jaar maar één wedstrijd op Boxing Day is",
      "link": "https://www.vi.nl/nieuws/waarom-er-dit-jaar-maar-een-wedstrijd-op-boxing-day-is",
      "summary": "Boxing Day wordt traditioneel gezien als een van de hoogtepunten van de Premier League, maar het heeft er alle schijn van dat op tweede kerstdag slechts één wedstrijd wordt gespeeld. Dat heeft te maken met de uitzendrechten.",
      "publishedAt": "2025-12-25T19:00:12.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bruggink trapte in bekende valkuil: 'Bij PSV was ik zelf mijn grootste concurrent'",
      "link": "https://www.vi.nl/nieuws/bruggink-trapte-in-bekende-valkuil-bij-psv-was-ik-zelf-mijn-grootste-concurrent",
      "summary": "Als technisch directeur van FC Twente legde Arnold Bruggink zichzelf te veel druk op, zegt hij terugblikkend in het kerstnummer van VI. Het is zijn karakterstructuur, weet hij inmiddels.",
      "publishedAt": "2025-12-25T18:34:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Robertson was 'the scruffy fat lad who conquered Europe twice'",
      "link": "https://www.bbc.com/sport/football/articles/c1632e2k82yo?at_medium=RSS&at_campaign=rss",
      "summary": "Those who know him best look back on the illustrious career of John Robertson, Nottingham Forest's double European Cup winner.",
      "publishedAt": "2025-12-25T14:19:33.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ex-Nottingham Forest and Scotland winger Robertson dies aged 72",
      "link": "https://www.skysports.com/football/news/12040/13487340/john-robertson-ex-nottingham-forest-and-scotland-winger-dies-aged-72",
      "summary": "Former Nottingham Forest and Scotland winger John Robertson has died at the age of 72.",
      "publishedAt": "2025-12-25T14:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Picasso' of football Robertson dies aged 72",
      "link": "https://www.bbc.com/sport/football/articles/cwywvy9yj9po?at_medium=RSS&at_campaign=rss",
      "summary": "Former Scotland, Nottingham Forest and Derby County winger John Robertson - once described by manager Brian Clough as \"a Picasso of our game\" - dies at the age of 72.",
      "publishedAt": "2025-12-25T13:53:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "John Robertson, Nottingham Forest and Scotland legend, dies aged 72",
      "link": "https://www.theguardian.com/football/2025/dec/25/john-robertson-nottingham-forest-and-scotland-legend-dies-aged-72",
      "summary": "Winger was described by Clough as ‘Picasso of our game’ Scored in Scotland’s 1981 win over England at Wembley John Robertson, the Nottingham Forest and Scotland legend, has died at the age of 72. Robertson was a hugely important part of the great Forest team that under Brian Clough rose from the second tier of English football to win multiple major honours, most famously back-to-back European Cups. Robertson assisted the decisive goal in the first European Cup triumph in 1979 and scored the decisive goal in the second, contributions that mark him out as one of the most remarkable players in British football history. He earned 28 Scotland caps, notably scoring the winning goal in a Home Championship victory over England at Wembley in May 1981. Clough described him as “the Picasso of our game”. Continue reading...",
      "publishedAt": "2025-12-25T13:52:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "This will be the Premier League's quietest Boxing Day ever: Where did all the games go?",
      "link": "https://www.espn.com/soccer/story/_/id/47393252/why-premier-league-quietest-boxing-day-ever",
      "summary": "The day after Christmas is usually jam-packed with great Premier League matchups, but not this year. What gives?",
      "publishedAt": "2025-12-25T12:43:50.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Richards on U.S., Palace return: 'Won't be long'",
      "link": "https://www.espn.com/soccer/story/_/id/47407490/usmnt-chris-richards-optimistic-quick-palace-return",
      "summary": "United States defender Chris Richards said it \"won't be long\" until he's back for Crystal Palace.",
      "publishedAt": "2025-12-25T12:37:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Zidane in stands for son Luca's Algeria clean sheet",
      "link": "https://www.espn.com/soccer/story/_/id/47407784/zidane-sees-son-luca-keep-clean-sheet-algeria-win",
      "summary": "France great Zinedine Zidane watched his goalkeeper son's safe hands as Algeria started its Africa Cup of Nations campaign with a 3-0 win over 10-man Sudan on Wednesday.",
      "publishedAt": "2025-12-25T12:37:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Barça's Bonmatí aims for April return to training",
      "link": "https://www.espn.com/soccer/story/_/id/47390516/barcelona-aitana-bonmati-aims-april-return-training",
      "summary": "Aitana Bonmatí said that breaking her leg is giving her the chance to relax for the first time in five years after topping ESPN FC Women's Rank for the third time in a row.",
      "publishedAt": "2025-12-25T12:37:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal survive 'emotionally tough' Palace shootout",
      "link": "https://www.espn.com/soccer/story/_/id/47402336/arsenal-survive-crystal-palace-shootout",
      "summary": "Arsenal manager Mikel Arteta said it was \"emotionally tough\" to accept Crystal Palace's stoppage-time equaliser before his team went on to win 8-7 on penalties following a 1-1 draw in their Carabao Cup quarterfinal.",
      "publishedAt": "2025-12-25T12:37:41.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool praying for a golden sky after seven months of storms",
      "link": "https://www.theguardian.com/football/2025/dec/25/liverpool-praying-for-a-golden-sky-after-seven-months-of-storms",
      "summary": "Despair and disorder have engulfed the club since their title party, leaving all concerned in need of previous serenity As Virgil van Dijk raised the Premier League trophy on a cool May afternoon at Anfield, the cap was sealed on a serenely glorious season for Liverpool. For sure there had been challenges en route to a 20th league title, but not many, and those that did arise were dealt with in a calm, orderly fashion. The ultimate prize had been captured with minimum sweat. Cue the celebrations after a final‑day 1-1 draw with Crystal Palace: players and staff dancing on the pitch, supporters doing the same in the stands, and no sense this was as good as it was going to get for the just-crowned champions. It took less than 24 hours for everything to change and set in motion an astonishing seven‑month period in the history of a club where it was probably thought they had seen and done it all. Continue reading...",
      "publishedAt": "2025-12-25T12:00:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League and EFL to hold talks over ending Saturday 3pm blackout",
      "link": "https://www.theguardian.com/football/2025/dec/25/premier-league-efl-talks-saturday-3pm-blackout-football-tv-rights",
      "summary": "Leagues eager to sell all games in next rights cycle Auction for televised rights expected in 2027 The Premier League and EFL will hold talks early next year about combining to permit 3pm Saturday kick-offs to be broadcast live each week for the first time. The UK is the last country in Europe to apply the so-called 3pm blackout, and with the Premier League and EFL eager to sell all their games to domestic broadcasters in the next rights cycle they want an early agreement before the next tender. Continue reading...",
      "publishedAt": "2025-12-25T12:00:39.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘A quick learner’: how Declan Rice went from Chelsea reject to Arsenal’s Rolls-Royce",
      "link": "https://www.theguardian.com/football/2025/dec/25/a-quick-learner-how-declan-rice-went-from-chelsea-reject-to-arsenals-rolls-royce",
      "summary": "Midfielder will be part of the conversation for a Ballon d’Or if he continues his ascent with trophies for club and country Declan Rice likes to call it “clean feedback”, which sounds like a euphemism for a bollocking, though he would probably say that is a misconception. Rather, it is part of the reason why Rice is being discussed as one of the best players in the world. “You can’t eff and blind, you can’t bully people,” says Terry Westley, the head of West Ham’s academy when Rice was there. “But we should be able to have a conversation and say: ‘Look, that ain’t quite good enough and we want to help you because this is what we need to do.’ Continue reading...",
      "publishedAt": "2025-12-25T09:00:35.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wiegman: How England won the Euros - again",
      "link": "https://www.skysports.com/football/news/12040/13487094/sarina-wiegman-england-women-head-coach-reflects-on-euro-2025-win-hannah-hamptons-impact-and-thomas-tuchel",
      "summary": "As Sarina Wiegman reflects on Euro 2025, a smile spreads across her face.",
      "publishedAt": "2025-12-25T09:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bewildering and bewitching Newcastle seek solution to end chaos",
      "link": "https://www.theguardian.com/football/2025/dec/25/eddie-howe-newcastle-manchester-united-premier-league",
      "summary": "Despite tactical flaws and a fixture pile-up, Eddie Howe still has a ‘glass half full’ attitude before Manchester United trip Newcastle supporters are starting to regard Eddie Howe’s team as an unreliable friend. Catch them on the right night and they invariably prove the life and soul of the thrillingly high-intensity party but, on other days, the once-dependable Sandro Tonali and company simply fail to turn up. As if that were not bad enough, their second-half game management has become suffused with a chaotic streak. Howe’s players visit Manchester United on Boxing Day having dropped 13 Premier League points from winning positions this season and are without a clean sheet in 10 games in all competitions. Victory at Old Trafford would be only their second away league win. Continue reading...",
      "publishedAt": "2025-12-25T08:00:37.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Coolest thing I've done' - Lowry on Ryder Cup win after 'horrific' leaderboard",
      "link": "https://www.skysports.com/golf/news/12040/13481833/ryder-cup-2025-shane-lowry-on-creating-history-for-team-europe-in-new-york-after-horrific-final-day-leaderboard",
      "summary": "Shane Lowry secured Team Europe's historic Ryder Cup title defence in New York, having been concerned about victory slipping through their grasp during a nail-biting Sunday.",
      "publishedAt": "2025-12-25T07:00:00.000Z"
    }
  ]
}