{
  "generatedAt": "2025-12-22T10:48:42.564Z",
  "items": [
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City to weigh players before Forest game",
      "link": "https://www.bbc.com/sport/football/articles/cm20dd4md8qo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester City manager Pep Guardiola says his players will be weighed when they return to training to check they are fit enough to play against Nottingham Forest.",
      "publishedAt": "2025-12-22T10:27:15.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Uitspraken Memphis maken veel los: 'Zijn invloed reikt verder dan het veld'",
      "link": "https://www.vi.nl/nieuws/uitspraken-memphis-maken-veel-los-zijn-invloed-reikt-verder-dan-het-veld",
      "summary": "Memphis Depay weet de ogen op zich gericht na de bekerwinst van Corinthians. De spits was niet alleen belangrijk met een goal, maar haalde na afloop uit richting het bestuur.",
      "publishedAt": "2025-12-22T10:16:59.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "AZ anticipeert met Hornkamp op mogelijke transfer Parrott",
      "link": "https://www.vi.nl/nieuws/az-anticipeert-met-hornkamp-op-mogelijke-transfer-parrott",
      "summary": "We zitten in het intermezzo tussen de zomer- en winterwindow, toch druppelt er in het najaar vaak nog een aantal transfers binnen. In dit blog vind je alle speculaties en bevestigde transfers in Nederland. Bekijk hier ons blog voor de transferperikelen in het buitenland.",
      "publishedAt": "2025-12-22T10:13:46.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham appoint Guarino as manager",
      "link": "https://www.bbc.com/sport/football/articles/cr5zjpmmd4lo?at_medium=RSS&at_campaign=rss",
      "summary": "Women's Super League side West Ham appoint Rita Guarino as manager following the sacking of Rehanne Skinner.",
      "publishedAt": "2025-12-22T10:12:33.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Jizz Hornkamp op weg naar AZ",
      "link": "https://www.vi.nl/nieuws/jizz-hornkamp-op-weg-naar-az",
      "summary": "Jizz Hornkamp is op weg naar de uitgang bij Heracles Almelo. AZ wil de 27-jarige spits per direct overnemen en nadert een akkoord met zowel de speler als de club. Zodra de definitieve overeenkomst een feit is, kan Hornkamp medisch gekeurd worden. Zijn huidige contract in Almelo loopt tot komende zomer, met een optie op nog een seizoen.",
      "publishedAt": "2025-12-22T10:08:21.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Kane smashes Arjen Robben record in Bayern rout",
      "link": "https://www.espn.com/soccer/report/_/gameId/746846",
      "summary": "Harry Kane scored his 30th club goal of the season as Bayern Munich shrugged off an injury and illness crisis to sweep past Heidenheim 4-0 on Sunday and go into the Bundesliga's winter break with a nine-point lead.",
      "publishedAt": "2025-12-22T10:03:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "United's Fernandes out a 'while' with injury blow",
      "link": "https://www.espn.com/soccer/story/_/id/47380002/aston-villa-vs-man-united-bruno-fernandes-substituted-apparent-injury",
      "summary": "Manchester United's Bruno Fernandes was substituted at halftime of the team's Premier League clash against Aston Villa with an apparent hamstring issue.",
      "publishedAt": "2025-12-22T10:03:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man United's Mazaroui 'fantastic' in Hakimi role",
      "link": "https://www.espn.com/soccer/story/_/id/47384768/manchester-united-mazaroui-fantastic-hakimi-role",
      "summary": "Achraf Hakimi was unable to make his comeback from injury in Morocco's opener at the Africa Cup of Nations on Sunday -- a 2-0 victory over Comoros -- but head coach Walid Regragui said his replacement is just as strong an option.",
      "publishedAt": "2025-12-22T10:03:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Juventus creep into title race while Ferguson struggles to convince Gasperini",
      "link": "https://www.theguardian.com/football/2025/dec/22/juventus-creep-into-title-race-while-ferguson-struggles-to-convince-gasperini",
      "summary": "Whoever wins season’s Scudetto is likely to crawl over the line and Juve have entered the picture ”When you say things like that, it makes me want to bite you,” Luciano Spalletti told a Sky Sport Italia reporter asking about title ambitions. Treating interviewers like a slice of Panettone aside, the most shocking thing about this assertion is that it’s not entirely implausible. Juventus have barely scraped a few good performances, but the overwhelming sense of inconsistency throughout Serie A means that’s no reason to rule them out for the top prize. Spalletti can tuck into his Christmas dinner knowing Juventus beat Roma 2-1 to close within a point of fourth place, securing three competitive wins in a row, with Loïs Openda finally breaking his Serie A duck, and Gleison Bremer returning for his first start sincehis meniscus tear on 27 September. The quality in the squad was always present, so with a little confidence, momentum and players beginning to gel with their new coach, there’s plenty for fans to get their teeth into. Continue reading...",
      "publishedAt": "2025-12-22T10:00:24.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Topaankoop Sivertsen wil uit de anonimiteit komen bij Go Ahead",
      "link": "https://www.vi.nl/pro/topaankoop-sivertsen-wil-uit-de-anonimiteit-komen-bij-go-ahead",
      "summary": "Go Ahead Eagles haalde Oskar Sivertsen een klein jaar geleden binnen als opvolger van Oliver Edvardsen, maar de Noor heeft zich tot nu toe nog weinig laten zien in Deventer. De 21-jarige vleugelspeler vertelt over zijn moeizame periode, legt uit waarom hij geduld heeft en krijgt van Melvin Boel te horen wat hij beter moet doen.",
      "publishedAt": "2025-12-22T10:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ref Watch: Newcaslte should have had penalty for 'body check' on Gordon",
      "link": "https://www.skysports.com/football/news/12040/13486621/ref-watch-newcastle-should-have-had-penalty-for-trevoh-chalobah-body-check-on-anthony-gordon",
      "summary": "Ex-Premier League referee Dermot Gallagher assesses the controversial moments from the weekend's action, including the decision not to hand Newcastle a penalty for Trevoh Chalobah's challenge on Anthony Gordon.",
      "publishedAt": "2025-12-22T09:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Gyrano Kerk ziet redding en lat Assist van het Jaar in de weg zitten",
      "link": "https://www.vi.nl/nieuws/gyrano-kerk-ziet-redding-en-lat-assist-van-het-jaar-in-de-weg-zitten",
      "summary": "Vlak voor het einde van 2025 toverde Gyrano Kerk in de Pro League van België. De aanvaller met een verleden bij Helmond Sport en FC Utrecht kreeg bij Antwerp FC bijna de Assist van het Jaar op zijn naam, ware het niet dat teamgenoot Thibo Somers miste.",
      "publishedAt": "2025-12-22T09:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tomori on Tuchel, living in Italy and why this is the best he has felt",
      "link": "https://www.bbc.com/sport/football/articles/c0edy3ey48no?at_medium=RSS&at_campaign=rss",
      "summary": "Fikayo Tomori says his success at AC Milan shows English players \"can go abroad and adapt to a different way of living\".",
      "publishedAt": "2025-12-22T08:00:59.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League: 10 talking points from the weekend’s action",
      "link": "https://www.theguardian.com/football/2025/dec/22/premier-league-10-talking-points-from-the-weekend-action",
      "summary": "Highs and lows for Alexander Isak, Wolves’ sobering survival chances and were Chelsea lucky at Newcastle? Premier League scoring charts Can results be misleading? That is the question. Aston Villa’s winning streak continued against Manchester United, but so did the nagging doubts. They were the lesser team by several measures – fewer shots (12-15), less possession (43-57), fewer big chances (2-3). As usual, the victory was a slender one. As usual, our friend xG was unimpressed: according to Opta, United edged it 1.31-1.02. But, as every fan knows, games are not won by xG. They are won by solid teamwork, shrewd management and individual talent – and Villa have all three. Morgan Rogers may be their only star, but he’s delivering like Father Christmas. Unai Emery is wily, battle-hardened, five years ahead of Ruben Amorim. If Rogers profited from Leny Yoro’s naivety, that was probably because Emery had spotted that Yoro is not a right-back, and told Rogers to start wide, cut in and torment him. Talent and management, working together. Tim de Lisle Match report: Aston Villa 2-1 Manchester United Match report: Everton 0-1 Arsenal Match report: Manchester City 3-0 West Ham Match report: Tottenham 1-2 Liverpool Match report: Newcastle 2-2 Chelsea Match report: Wolves 0-2 Brentford Match report: Leeds 4-1 Crystal Palace Continue reading...",
      "publishedAt": "2025-12-22T08:00:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "From Rochdale to Rabat: the Lancashire duo at the forefront of Tanzania’s Afcon bid",
      "link": "https://www.theguardian.com/football/2025/dec/22/from-rochdale-to-rabat-the-lancashire-duo-at-the-forefront-of-tanzanias-afcon-bid",
      "summary": "Friends Tarryn Allarakhia and Haji Mnoga will step out together in Morocco having shared a path in the English lower leagues Like all good things, Tarryn Allarakhia and Haji Mnoga’s friendship began at a National League match between Wealdstone and Aldershot in 2023 when they were opponents. Since then they have moved to the north-west and are heading into a second Africa Cup of Nations as Tanzania internationals together. This is the fourth time Tanzania, who sit 112th in Fifa’s rankings, have qualified for the tournament but they are yet to secure a victory. In Côte d’Ivoire in 2023, Allarakhia and Mnoga were part of a squad that secured draws against Zambia and DR Congo, but that was not enough to get them out of the group. Nigeria, the highest-ranked side in the group, will be their first opponents on Tuesday before clashes with Tunisia and Uganda in Morocco for the Taifa Stars. Continue reading...",
      "publishedAt": "2025-12-22T08:00:23.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "January transfer window: Key dates and Deadline Day",
      "link": "https://www.skysports.com/football/news/12040/13485681/january-transfer-window-2026-when-does-it-open-and-close-deadline-day-dates-for-premier-league-efl-wsl-and-europe",
      "summary": "The transfer window re-opens on Thursday January 1, allowing clubs across the leagues to seek reinforcements and reshape their squads.",
      "publishedAt": "2025-12-22T08:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Today on Sky Sports Racing: American Flight set to take off at Wolverhampton",
      "link": "https://www.skysports.com/racing/news/12040/13486373/today-on-sky-sports-racing-lingfield-wolverhampton-and-deauville-feature-live-on-monday",
      "summary": "We have a busy day's racing on Monday with Flat action from Lingfield, Wolverhampton and Deauville live on Sky Sports Racing...",
      "publishedAt": "2025-12-22T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "New Zealand secure West Indies Test series win after five Duffy wickets",
      "link": "https://www.skysports.com/cricket/news/12040/13486567/new-zealand-vs-west-indies-hosts-secure-test-series-victory-after-succession-of-records-broken-in-third-match",
      "summary": "Jacob Duffy took 5-42 as New Zealand bowled out the West Indies for 138 on a deteriorating fifth-day pitch to win the third Test by 323 runs and take the three-match series 2-0.",
      "publishedAt": "2025-12-22T06:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Patriots secure playoff return in comeback win over Ravens",
      "link": "https://www.skysports.com/nfl/news/12040/13486558/nfl-new-england-patriots-clinch-playoff-spot-with-28-24-comeback-win-over-baltimore-ravens-as-lamar-jackson-suffers-back-injury",
      "summary": "Drake Maye guided New England to a pair of fourth-quarter touchdowns, rallying his team from an 11-point deficit to a 28-24 victory over Baltimore on Sunday night that clinched a post-season spot for the Patriots and dealt a devastating blow to the Ravens' playoff hopes.",
      "publishedAt": "2025-12-22T06:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Incredible' Rice is 'future captain of England' - Rooney",
      "link": "https://www.bbc.com/sport/football/articles/cdxe7w9l722o?at_medium=RSS&at_campaign=rss",
      "summary": "Former England forward Wayne Rooney hails Arsenal midfielder Declan Rice as a \"future captain of England\".",
      "publishedAt": "2025-12-22T06:01:56.000Z"
    }
  ]
}