{
  "generatedAt": "2026-01-14T12:55:37.270Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Flick is op z'n hoede voor Santander en geniet na van Clásico-zege",
      "link": "https://www.vi.nl/nieuws/flick-is-op-z-n-hoede-voor-santander-en-geniet-na-van-cl-sico-zege",
      "summary": "Barcelona-trainer Hansi Flick waakt voor onderschatting op weg naar de Copa del Rey-wedstrijd tegen Racing Santander. De Duitser toonde zich in aanloop naar het bekerduel complimenteus over de koploper in de Segunda División en kwam nog terug op de Clásico van zondag .",
      "publishedAt": "2026-01-14T12:50:50.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Police on ban of Maccabi fans: AI was to blame",
      "link": "https://www.espn.com/soccer/story/_/id/47607667/police-chief-apologises-ai-error-helped-form-maccabi-tel-aviv-fan-ban-decision",
      "summary": "West Midlands Police's chief constable has apologised to MPs for giving them an error in evidence over the decision to ban Maccabi Tel Aviv fans.",
      "publishedAt": "2026-01-14T12:18:51.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Ajax sign Zlatan's son on loan from AC Milan",
      "link": "https://www.espn.com/soccer/story/_/id/47606855/ajax-sign-zlatan-ibrahimović-son-maximillian-ac-milan",
      "summary": "Ajax have confirmed the loan signing of the son of Zlatan Ibrahimović, Maximillian, from AC Milan.",
      "publishedAt": "2026-01-14T12:18:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Waarom Ten Hag zijn vertrek bij Leverkusen na drie weken achter zich liet",
      "link": "https://www.vi.nl/video/waarom-ten-hag-zijn-vertrek-bij-leverkusen-na-drie-weken-achter-zich-kon-laten",
      "summary": "Het kostte Erik ten Hag drie weken om zijn vertrek bij Bayer Leverkusen te verwerken. De nieuwe technisch directeur van FC Twente vindt dat hij niet de kans heeft gekregen om resultaten te halen. 'Dan houdt alles op en moet je het achter je laten.'",
      "publishedAt": "2026-01-14T12:10:10.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Delay in disallowed Semenyo goal an 'edge case'",
      "link": "https://www.espn.com/soccer/story/_/id/47607499/delay-disallowed-antoine-semenyo-goal-due-lack-offside-technology",
      "summary": "The delay in ruling out a Manchester City goal for offside in Tuesday's Carabao Cup win at Newcastle was extended because semi-automated offside technology could not be used in the incident.",
      "publishedAt": "2026-01-14T12:03:31.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Utd not planning Jan. transfers for Carrick",
      "link": "https://www.espn.com/soccer/story/_/id/47606619/man-united-not-planning-january-transfers-michael-carrick-sources",
      "summary": "Michael Carrick will work with the squad he has inherited as Man United boss with the club having no plans to make new signings, sources have told ESPN.",
      "publishedAt": "2026-01-14T12:03:30.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Pocognoli verlost landgenoot Faes richting WK bij Leicester City",
      "link": "https://www.vi.nl/nieuws/pocognoli-verlost-landgenoot-faes-richting-wk-bij-leicester-city",
      "summary": "Wout Faes maakt het seizoen op huurbasis af bij AS Monaco. De Monegasken hebben ook een optie tot koop bedongen in de overeenkomst met Leicester City, waar de 28-voudig international van België niet langer verzekerd was van een basisplaats.",
      "publishedAt": "2026-01-14T11:50:34.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ten Hag houdt deur naar Oranje op een kier: 'Hebben we het over gehad'",
      "link": "https://www.vi.nl/video/ten-hag-houdt-deur-naar-oranje-op-een-kier-hebben-we-het-over-gehad",
      "summary": "FC Twente heeft Erik ten Hag teruggehaald als technisch directeur, maar wat als Ronald Koeman na het WK vertrekt als bondscoach van het Nederlands elftal en de KNVB op de stoep staat? Dat scenario kwam ook aan bod in de contractbesprekingen tussen beide partijen.",
      "publishedAt": "2026-01-14T11:41:56.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rangers agree loan for Wolfsburg winger Skov Olsen",
      "link": "https://www.skysports.com/football/news/12040/13494156/andreas-skov-olsen-rangers-agree-loan-deal-for-wolfsburg-winger-which-includes-option-to-buy-in-summer",
      "summary": "Rangers have agreed a loan deal for Wolfsburg winger Andreas Skov Olsen.",
      "publishedAt": "2026-01-14T11:16:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Woods reveals injury 'progress' update during TGL appearance",
      "link": "https://www.skysports.com/golf/live-blog/12040/13486422/tgl-golf-live-latest-scores-reports-highlights-updates-and-news-as-pga-tour-stars-feature-in-indoor-team-league",
      "summary": "",
      "publishedAt": "2026-01-14T11:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hoe het mini-WK het einde werd voor bondscoach Jan Zwartkruis",
      "link": "https://www.vi.nl/pro/hoe-het-mini-wk-het-einde-werd-voor-bondscoach-jan-zwartkruis",
      "summary": "Deze week was het 45 jaar geleden dat het Nederlands elftal in Uruguay aantrad op het Mini-WK. Het werd een fiasco. Oranje won geen wedstrijd, speelde matig voetbal en zag een poging tot verjonging mislukken. Na terugkeer in Nederland besloot bondscoach Jan Zwartkruis op te stappen.",
      "publishedAt": "2026-01-14T11:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We're really stretched' - Livramento blow adds to Newcastle defence concerns",
      "link": "https://www.bbc.com/sport/football/articles/c78e49x5j0do?at_medium=RSS&at_campaign=rss",
      "summary": "Head coach Eddie Howe admits Newcastle United are \"really stretched\" after Tino Livramento is ruled out for up to two months with a hamstring injury.",
      "publishedAt": "2026-01-14T10:14:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Pro License admission barriers allow women’s coaching opportunities to go ‘down the drain’",
      "link": "https://www.theguardian.com/football/2026/jan/14/womens-football-coaching-pro-license-uefa",
      "summary": "Uefa’s limitations have set hurdles for women keen to take the next step in coaching despite the increasing demand Mariana Cabral has a coaching CV to be proud of. Born on the small Azores island of São Miguel, she has been in charge of the women’s teams at clubs including Benfica and Sporting, but the 38-year-old is frustrated. “We want more women coaches,” she says. “Who won the Euros? Who won the Champions League? Women – but we are losing so many.” Cabral has her A Licence but is stuck in limbo. Unable to get on a Pro Licence course that would clear a path to more senior head coach roles in an era when women’s teams are increasingly demanding that qualification, she stepped back to become a No 2 in the US. But after one NWSL season with Utah Royals, she left in December in the hope that expanding her experience at another club would help to open a Pro Licence door. Continue reading...",
      "publishedAt": "2026-01-14T10:05:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Iran’s footballers face battle to be heard as regime brutally clamps down on protests",
      "link": "https://www.theguardian.com/football/2026/jan/14/iran-football-team-battle-to-be-heard-regime-protests",
      "summary": "For Mehdi Taremi and others playing abroad, showing solidarity with their home nation can mean threats and possible detention Mehdi Taremi did what he does best. On Saturday, the Iranian striker turned inside the area and scored for Olympiakos, a well-taken eighth goal of the season for the 33-year-old that clinched a 2-0 win at Atromitos and a place at the top of the Greek Super League. Usually, millions of people in Iran follow every step of Taremi’s European career, one that took off with Porto and has settled in Piraeus via Milan, but not this time. The ruling regime in Tehran has cut the internet and all communications, which meant that residents of the football-loving nation also missed the non-celebration that followed. “It actually has to do with the conditions in my country,” Taremi said. “There are problems between the people and the government. The people are always with us, and that’s why we are with them. I couldn’t celebrate in solidarity with the Iranian people. I know that Olympiakos fans would like me to be happy, but I don’t celebrate the goals, in solidarity with what the Iranian people are going through.” Continue reading...",
      "publishedAt": "2026-01-14T10:00:22.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Golf leaderboards: Final scores from PNC Championship and more",
      "link": "https://www.skysports.com/golf/news/12040/12950625/golf-leaderboards-pga-tour-lpga-tour-liv-golf-dp-world-tour-ladies-european-tour-major-championships-and-more",
      "summary": "All the latest golf scores and results from around the world.",
      "publishedAt": "2026-01-14T10:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Chelsea to swoop for West Ham’s Lucas Paquetá?",
      "link": "https://www.theguardian.com/football/2026/jan/14/football-transfer-rumours-chelsea-west-hams-lucas-paqueta-marc-guehi-bayern-munich",
      "summary": "Today’s tell-all has got its ducks in a row Liam Rosenior has been Chelsea manager for a whole week without making a signing. That is bound to be remedied soon enough, and one name that has been bandied about is that of Lucas Paquetá. The Brazilian midfielder is set to leave West Ham in this transfer window having has said he wants to leave the Premier League and join Flamengo because of his disillusionment with how he was treated over the spot-fixing allegations of which he was cleared. But the Brazilian journalist Renan Moura reports that people around Paquetá want to persuade him to stay in Europe, and Chelsea could move for him. The future of Marc Guéhi was always likely to be one of the main plotlines of this transfer window, with original suitors Liverpool tussling with Manchester City over the defender’s services as he enters the last six months of his Crystal Palace contract. Arsenal have also shown interest but now entering stage left are Bayern Munich, whose sporting director, Max Erbl, has been having cosy chats with Guéhi’s agent at the Bundesliga champions’ training ground, according to Sky Italia. Continue reading...",
      "publishedAt": "2026-01-14T09:27:41.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Osimhen has become 'king of Nigerian football'",
      "link": "https://www.bbc.com/sport/football/articles/ce9yxjr98pgo?at_medium=RSS&at_campaign=rss",
      "summary": "Nigeria face a huge semi-final against Africa Cup of Nations hosts and favourites Morocco on Wednesday.",
      "publishedAt": "2026-01-14T08:52:51.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Could Arsenal win Premier League without a regular goalscorer?",
      "link": "https://www.bbc.com/sport/football/articles/cn56k7dpw7ko?at_medium=RSS&at_campaign=rss",
      "summary": "No team has ever won the Premier League title without having a player in the top 10 goalscorers, but could Arsenal change that?",
      "publishedAt": "2026-01-14T08:25:07.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maye vs the monster - why the Texans can shock the NFL",
      "link": "https://www.skysports.com/nfl/news/12040/13493697/the-houston-texans-can-win-the-super-bowl-but-the-nfls-best-defense-needs-cj-stroud-to-fire",
      "summary": "Modern NFL defenses tend to like a scalpel. The Houston Texans prefer a sledgehammer.",
      "publishedAt": "2026-01-14T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why has no English boss won Premier League - and who could be first?",
      "link": "https://www.bbc.com/sport/football/articles/cp37k9ql449o?at_medium=RSS&at_campaign=rss",
      "summary": "Why has an English manager not won the Premier League? Chief football writer Phil McNulty explores who could make history.",
      "publishedAt": "2026-01-14T06:39:45.000Z"
    }
  ]
}