{
  "generatedAt": "2026-01-13T23:23:09.917Z",
  "items": [
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "A no-fuss, loyal, safe option: How Man United chose Carrick as head coach",
      "link": "https://www.espn.com/soccer/story/_/id/47602042/how-manchester-united-chose-michael-carrick-head-coach",
      "summary": "A breakfast meeting set the course for former Man United star to return as their new head coach through the end of the season. How did he get the gig, and what is expected of him?",
      "publishedAt": "2026-01-13T23:14:09.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man United name Carrick boss until end of season",
      "link": "https://www.espn.com/soccer/story/_/id/47588996/man-united-michael-carrick-interim-manager-end-season",
      "summary": "Manchester United have appointed former player Michael Carrick as their head coach until the end of the season, the club confirmed Tuesday.",
      "publishedAt": "2026-01-13T23:06:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo nets again as Man City close in on final",
      "link": "https://www.espn.com/soccer/report/_/gameId/401842433",
      "summary": "Antoine Semenyo scored his second goal in as many games for his new club as Manchester City secured a precious Carabao Cup semifinal advantage over holders Newcastle.",
      "publishedAt": "2026-01-13T23:06:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Robertson: Szoboszlai backheel 'unacceptable'",
      "link": "https://www.espn.com/soccer/story/_/id/47597514/liverpool-barnsley-andy-robertson-dominik-szoboszlai-backheel-fa-cup-kop-anfield",
      "summary": "Liverpool defender Andy Robertson has described teammate Dominik Szoboszlai's careless backheel against Barnsley as \"unacceptable.\"",
      "publishedAt": "2026-01-13T23:06:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Klopp: Xabi's Madrid exit 'nothing to do with me'",
      "link": "https://www.espn.com/soccer/story/_/id/47598753/xabi-alonso-real-madrid-exit-do-me",
      "summary": "Jürgen Klopp has stated that he has not received any calls from Real Madrid following the exit of Xabi Alonso, and affirmed that the decision has nothing to do with him.",
      "publishedAt": "2026-01-13T23:06:58.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Voor het eerst sinds 1991 geen amateurclub bij laatste zestien Coupe de France",
      "link": "https://www.vi.nl/nieuws/vi-live-volg-hier-alles-rondom-het-bekervoetbal-en-de-bundesliga",
      "summary": "De VI Live van dinsdag 13 januari stond volledig in het teken van bekervoetbal in zowel het binnen- als buitenland én de Bundesliga. In de Eurojackpot KNVB Beker namen FC Utrecht en FC Twente het tegen elkaar op. In de League Cup spelen Newcastle United en Manchester City tegen elkaar. Verder kwamen ook Borussia Dortmund, Atlético Madrid en AS Roma in actie.",
      "publishedAt": "2026-01-13T23:05:26.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Griezmann matchwinner Atlético, Bilbao en Sociedad ontsnappen",
      "link": "https://www.vi.nl/nieuws/griezmann-matchwinner-atl-tico-bilbao-bekert-door-na-enerverende-avond",
      "summary": "Atlético Madrid staat in de kwartfinales van de Copa del Rey. De ploeg van Diego Simeone won op bezoek bij Deportivo La Coruña dankzij een wonderschone treffer van Antoine Griezmann. Athletic Bilbao speelde een zenuwslopende wedstrijd met drie strafschoppen en een rode kaart, Real Sociedad verloor/won na strafschoppen. Een overzicht.",
      "publishedAt": "2026-01-13T22:56:27.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Michael Carrick urges Manchester United to ‘pull together’ as he takes interim role",
      "link": "https://www.theguardian.com/football/2026/jan/13/michael-carrick-manchester-united-interim-head-coach-steve-holland-jonathan-woodgate",
      "summary": "Steve Holland and Jonathan Woodgate also on staff ‘I know what it takes to succeed here,’ insists Carrick Michael Carrick has called on everyone at Manchester United to “pull together” in order to bring ­success back to the club, after being appointed on Tuesday night as head coach until the end of the season. The former midfielder has brought the ex-England assistant Steve ­Holland and Jonathan Woodgate to work alongside him. They will join Jonny Evans, Travis Binnion and Craig Mawson in the backroom staff. It is Carrick’s second spell leading the team, having taken charge previously of three games after Ole Gunnar ­Solskjær was dismissed in 2021. Continue reading...",
      "publishedAt": "2026-01-13T22:46:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Jans kan afscheid met prijs vergeten: 'Dit komt hard aan'",
      "link": "https://www.vi.nl/nieuws/jans-kan-afscheid-met-prijs-vergeten-dit-komt-hard-aan",
      "summary": "De uitschakeling in het KNVB-bekertoernooi deed zichtbaar iets met Ron Jans. De na dit seizoen afzwaaiende trainer zag zijn laatste kans op een prijs met FC Utrecht dinsdagavond in rook opgaan door de nederlaag tegen FC Twente ( 1-2 ).",
      "publishedAt": "2026-01-13T22:43:07.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van den Brom draaide wedstrijd om met beelden: 'Geloof niet in schreeuwen'",
      "link": "https://www.vi.nl/nieuws/van-den-brom-draaide-wedstrijd-om-met-beelden-en-wil-samenwerken-met-ten-hag",
      "summary": "John van den Brom zag mede door het laten zien van beelden in de rust een compleet ander FC Twente in de tweede helft tegen FC Utrecht. Zijn ploeg bereikte door goals van Ricky van Wolfswinkel en Mats Rots uiteindelijk de kwartfinale van de Eurojackpot KNVB Beker .",
      "publishedAt": "2026-01-13T22:40:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior to talk to Sterling and Disasi about Chelsea exile",
      "link": "https://www.bbc.com/sport/football/articles/c5y42lg2w8lo?at_medium=RSS&at_campaign=rss",
      "summary": "New Chelsea manager has pledged to speak to Raheem Sterling and Axel Disasi, who were left in limbo by the previous boss.",
      "publishedAt": "2026-01-13T22:30:22.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liam Rosenior to hold talks with Sterling and Disasi over Chelsea futures",
      "link": "https://www.theguardian.com/football/2026/jan/13/liam-rosenior-to-hold-talks-with-sterling-and-disasi-over-chelsea-futures",
      "summary": "Players had been frozen out under Enzo Maresca Chelsea’s preference would be to move players on Liam Rosenior will hold talks with Raheem Sterling and Axel Disasi before deciding whether the pair have a future at Chelsea. The head coach, who wants to assess his new squad before con­cluding whether signings are required this month, has been focusing on preparations for the Carabao Cup semi-final first leg at home against Arsenal on Wednesday and has not had a chance to look at whether Sterling and Disasi should be brought back in from the cold. Continue reading...",
      "publishedAt": "2026-01-13T22:30:08.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arteta rues Arsenal’s injury list before Carabao Cup semi-final trip to Chelsea",
      "link": "https://www.theguardian.com/football/2026/jan/13/mikel-arteta-arsenal-injury-problems-carabao-cup-semi-final-first-leg-chelsea",
      "summary": "Manager hopes to find ‘solution’ to defensive problems Saliba and Trossard doubts for first leg on Wednesday Mikel Arteta has acknowledged that Arsenal must overcome their injury problems in defence if they are to maintain their challenge in four competitions. Arteta spoke after ­revealing that William Saliba is a doubt for the first leg of the Carabao Cup semi-final against Chelsea on Wednesday. Saliba and Leandro Trossard did not feature in the FA Cup victory against Portsmouth on Sunday. It was widely thought both had been rested. However, Arteta confirmed on Tuesday that the France defender could miss the game at Stamford Bridge because of an unspecified injury, while ­Trossard is also a doubt. Continue reading...",
      "publishedAt": "2026-01-13T22:30:08.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hasty or a shrewd move? Madrid in shock at swift Arbeloa appointment",
      "link": "https://www.bbc.com/sport/football/articles/cz7yle2e3d9o?at_medium=RSS&at_campaign=rss",
      "summary": "Many Real Madrid fans are in shock at Alvaro Arbeloa's appointment as manager - is it a hasty move or a shrewd decision?",
      "publishedAt": "2026-01-13T22:28:45.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo and Cherki give Manchester City edge over Newcastle after VAR storm",
      "link": "https://www.theguardian.com/football/2026/jan/13/newcastle-manchester-city-carabao-cup-semi-final-first-leg-match-report",
      "summary": "Eddie Howe was not exactly overjoyed to learn that, instead of being cup-tied, Antoine Semenyo was free to play for Manchester City. Sure enough the Newcastle manager’s worst fears were realised as Semenyo – who had played in the competition this season for Bournemouth – scored City’s opener and had an another “goal” disallowed before Rayan Cherki’s stoppage-time second left Pep Guardiola smiling broadly. With a second leg at the Etihad Stadium still to come this semi-final is not quite over but, thanks to not merely Semenyo but some fine goalkeeping from James Trafford, Newcastle’s defence of the Carabao Cup they won last March is looking distinctly fragile. Continue reading...",
      "publishedAt": "2026-01-13T22:14:20.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Gyrano Kerk in topvorm: dubbelslag brengt Oosting en Antwerp naar halve finale",
      "link": "https://www.vi.nl/nieuws/gyrano-kerk-in-topvorm-dubbelslag-brengt-oosting-en-antwerp-naar-halve-finale",
      "summary": "Gyrano Kerk is in absolute topvorm in België. De voormalig aanvaller van FC Utrecht schoot Antwerp FC dinsdag diep in de verlenging naar de halve finale van de Beker van België. Kerk had in de eerste helft ook al de openingstreffer voor zijn rekening genomen.",
      "publishedAt": "2026-01-13T22:08:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "DeChambeau, Rahm and Smith all committed to LIV Golf for upcoming season",
      "link": "https://www.skysports.com/golf/news/12040/13493975/bryson-dechambeau-and-jon-rahm-committed-to-liv-golf-after-brooks-koepka-returned-to-pga-tour",
      "summary": "Bryson DeChambeau, Jon Rahm and Cam Smith have committed to LIV Golf after Brooks Koepka announced his LIV Golf departure after four seasons with the Saudi-backed circuit.",
      "publishedAt": "2026-01-13T21:33:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City overcome VAR controversy for first-leg win at Newcastle",
      "link": "https://www.skysports.com/football/newcastle-united-vs-manchester-city/report/551323",
      "summary": "Antoine Semenyo scored again for Manchester City as his new club took control of their Carabao Cup semi-final against holders Newcastle - but was controversially denied another goal by VAR.",
      "publishedAt": "2026-01-13T21:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man Utd choose Carrick as the right man for the job - for now",
      "link": "https://www.skysports.com/football/news/12040/13493959/man-utd-keen-to-avoid-a-repeat-of-ruben-amorim-as-michael-carrick-appointed-until-the-end-of-the-season-reporter-notebook",
      "summary": "Manchester United have gone with Michael Carrick as head coach until the end of the season, as Rob Dorsett and Danyal Khan break down why the club's hierarchy and Jason Wilcox landed on the appointment...",
      "publishedAt": "2026-01-13T21:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tomlin steps down as coach of Steelers after 19 seasons",
      "link": "https://www.skysports.com/nfl/news/12040/13493933/mike-tomlin-steps-down-as-head-coach-of-pittsburgh-steelers-after-19-seasons",
      "summary": "Mike Tomlin - the longest-tenured head coach in major American professional sports - has stepped down from his job as coach of the Pittsburgh Steelers after yet another quick playoff exit.",
      "publishedAt": "2026-01-13T19:40:00.000Z"
    }
  ]
}