{
  "generatedAt": "2026-01-01T20:28:20.113Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slot legt vinger op zere Liverpool-plek: 'Helaas wordt dat niet erkend'",
      "link": "https://www.vi.nl/nieuws/slot-legt-vinger-op-zere-liverpool-plek-helaas-wordt-dat-niet-erkend",
      "summary": "Arne Slot baalt flink van de remise van Liverpool thuis tegen promovendus Leeds United . De Nederlandse manager zag zijn ploeg moeite hebben met een compact georganiseerde opponent. Hij legde de vinger op de zere plek.",
      "publishedAt": "2026-01-01T20:24:50.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sunderland v Manchester City: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/01/sunderland-v-manchester-city-premier-league-live",
      "summary": "⚽ Premier League updates from the 8pm GMT kick-off ⚽ Live scores | Tables | Follow us on Bluesky | Mail John Regis Le Bris also spoke to Sky: “A few weeks ago we struggled because they were really good and efficient through their counter pressing. I hope we learnt the lesson but it will be another experience at home with another energy so we’ll see.” Pep Guardiola has been speaking to Sky: “Tough place and it means that anyone could win here. Hopefully we can perform. Josko [Gvardiol] had a few niggles, an incredible run of playing every three days and Savinho has speed and is fresh. Continue reading...",
      "publishedAt": "2026-01-01T20:20:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea confirm Maresca exit amid poor PL run",
      "link": "https://www.espn.com/soccer/story/_/id/47469870/chelsea-confirm-enzo-maresca-exit-amid-poor-premier-league-run-breakdown-relations",
      "summary": "Chelsea confirmed Thursday they have parted ways with manager Enzo Maresca ahead of Sunday's game against Manchester City.",
      "publishedAt": "2026-01-01T20:19:38.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Leeds force stalemate to end Liverpool winning run",
      "link": "https://www.espn.com/soccer/report/_/gameId/740781",
      "summary": "Liverpool's winning run was brought to a grinding halt as Leeds claimed their first clean sheet since August with the new year bringing more frustration for Arne Slot's side.",
      "publishedAt": "2026-01-01T20:19:38.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Spurs' Johnson agrees move to Palace",
      "link": "https://www.espn.com/soccer/story/_/id/47472822/tottenham-transfers-brennan-johnson-agrees-35m-crystal-palace-move",
      "summary": "Tottenham winger Brennan Johnson has agreed to join Crystal Palace in a deal worth £35 million ($47.2m), sources have told ESPN.",
      "publishedAt": "2026-01-01T20:19:38.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Gabon govt. suspends team over AFCON flop",
      "link": "https://www.espn.com/soccer/story/_/id/47472240/gabon-government-suspends-national-team-axe-aubameyang-afcon-calamity",
      "summary": "Gabon's government have come down hard on the country's national team following their shambolic performance at the Africa Cup of Nations (AFCON).",
      "publishedAt": "2026-01-01T20:19:38.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool needed more pace to break through difficult Leeds defence - Slot",
      "link": "https://www.bbc.com/sport/football/videos/c1ev8ndv8d0o?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool manager Arne Slot says his side needed more pace to break through and create chances against Leeds United's low block, following their goalless draw at Anfield.",
      "publishedAt": "2026-01-01T20:17:18.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "FC Volendam heeft AZ-middenvelder Kwakman bijna binnen",
      "link": "https://www.vi.nl/nieuws/fc-volendam-heeft-az-middenvelder-kwakman-bijna-binnen",
      "summary": "Dave Kwakman (21) gaat het seizoen vrijwel zeker afmaken bij FC Volendam. Wanneer onverwachte wendingen uitblijven, zal AZ de middenvelder voor een halfjaar uitlenen aan de club uit zijn geboortedorp.",
      "publishedAt": "2026-01-01T20:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: opvallend incident met Aké bij Manchester City",
      "link": "https://www.vi.nl/nieuws/vi-live-liverpool-man-city-en-spurs-komen-in-actie",
      "summary": "Namens de redactie van VI nogmaals de beste wensen! Op deze nieuwjaarsdag is er traditioneel voetbal uit de Premier League. Uiteraard volgen we dat in deze VI Live allemaal op de voet.. Veel plezier.",
      "publishedAt": "2026-01-01T20:06:47.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior leading contender for Chelsea job",
      "link": "https://www.bbc.com/sport/football/articles/c0er1wx3v28o?at_medium=RSS&at_campaign=rss",
      "summary": "Strasbourg boss Liam Rosenior is the leading contender to be the next Chelsea manager, but others remain under consideration.",
      "publishedAt": "2026-01-01T19:58:50.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tom Cairney earns Fulham a point at Crystal Palace with late leveller",
      "link": "https://www.theguardian.com/football/2026/jan/01/crystal-palace-fulham-premier-league-match-report",
      "summary": "It’s a strange quirk of this fixture that the away side hasn’t lost for the last 10 Premier League matches, and substitute Tom Cairney’s late equaliser ensured that the streak goes on. Only a brilliant save in injury-time from Dean Henderson and a glaring miss from former Crystal Palace player Joachim Andersen denied Fulham all three points after they had fallen behind to Jean-Philippe Mateta’s first goal from open play since 1 November. But Oliver Glasner will still be bitterly disappointed that his side couldn’t end a sequence of six games without a victory in all competitions after running out of steam again in their 31st match of the season. Continue reading...",
      "publishedAt": "2026-01-01T19:57:04.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ipswich rise into Championship’s top two as rivals Coventry and Boro slip up",
      "link": "https://www.theguardian.com/football/2026/jan/01/championship-roundup-wrexham-blackburn-charlton-coventry-derby-middlesbrough",
      "summary": "Philogene and Akpom goals secure 2-1 win over Oxford Charlton hold Coventry 1-1; Derby upset Middlesbrough Ipswich climbed into the automatic promotion places in the Championship following a 2-1 victory over struggling Oxford. Their success came via first-half goals from leading scorer Jaden Philogene and Chuba Akpom, while Will Lankshear replied for the visitors. Ipswich moved a point above Middlesbrough after they fell to a 1-0 defeat at Derby, while Oxford remain three points from safety. Continue reading...",
      "publishedAt": "2026-01-01T19:52:52.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Besiktas laat sterspeler om 04.00 uur trainen, zaak ligt bij de FIFA'",
      "link": "https://www.vi.nl/nieuws/besiktas-laat-sterspeler-om-04-00-uur-trainen-zaak-ligt-bij-de-fifa",
      "summary": "De situatie rondom sterspeler Rafa Silva bij Besiktas houdt de gemoederen in Turkije bezig. Naar verluidt forceert de Turkse topclub de Portugese aanvaller richting de uitgang met kleine pesterijen. De zaak zou zijn voorgelegd aan de FIFA.",
      "publishedAt": "2026-01-01T19:52:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Ruthless' Littler thrashes Ratajski with Humphries vs Van Veen up next LIVE!",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-gary-anderson-in-action",
      "summary": "",
      "publishedAt": "2026-01-01T19:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Obdurate Leeds keep toiling Liverpool at arm’s length to earn point",
      "link": "https://www.theguardian.com/football/2026/jan/01/liverpool-leeds-premier-league-match-report",
      "summary": "Two unbeaten records continued at Anfield but only one team could take satisfaction from that. Leeds succeeded in stifling and frustrating Liverpool as the first goalless draw of Arne Slot’s reign underlined the limitations that linger behind the Premier League champions’ recent recovery. A drab scoreless draw, the first in 84 Liverpool games under Slot, owed much to the defensive dominance of the excellent Jaka Bijol and Pascal Struijk but also the home side’s inability to break down a compact Leeds unit. Liverpool were reduced to hopeful half chances and there was a smattering of boos around Anfield as the final whistle sounded on a laboured performance. Continue reading...",
      "publishedAt": "2026-01-01T19:43:09.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Enzo Maresca forgot Chelsea’s golden rule: the manager does not call the shots | Jacob Steinberg",
      "link": "https://www.theguardian.com/football/2026/jan/01/enzo-maresca-chelsea-manchester-city-analysis",
      "summary": "Manager toed the line at Stamford Bridge with one eye on the Manchester City job, frustrating fans and his employers It was late on New Year’s Eve when Chelsea’s patience ran out. They knew that Enzo Maresca was attempting to engineer an exit from the club and now they were ready to call his bluff. Midnight was approaching and the fireworks at Stamford Bridge were about to erupt. A baffling story soon had a familiar, predictable ending. Maresca, who is not the first manager to run out of friends at Chelsea, had taken the provocations too far. There was surprise when he told staff that he did not want to conduct his post-match press conference after the disappointing 2-2 draw with Bournemouth on Tuesday night. The official explanation was that Maresca was too unwell to talk in public, despite having just spent the evening coaching on the Stamford Bridge touchline, but the friction was palpable and it was never going to sit well with the Chelsea hierarchy when it took less than 24 hours for reports to emerge that the sickness line was a red herring and their head coach had actually decided not to meet the media because he needed time to consider his options. It was further confirmation that this was someone who wanted to be sacked. Maresca dared Chelsea to act and will have been the least surprised person in the world to find himself unemployed less than a day into 2026. Continue reading...",
      "publishedAt": "2026-01-01T19:35:38.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leeds hold Liverpool to goalless draw at Anfield",
      "link": "https://www.skysports.com/watch/video/13489493/liverpool-0-0-leeds-premier-league-highlights",
      "summary": "FREE TO WATCH: Highlights from Liverpool’s match against Leeds United in the Premier League.",
      "publishedAt": "2026-01-01T19:35:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool toil in limp draw at home to Leeds",
      "link": "https://www.skysports.com/football/liverpool-vs-leeds-united/report/531314",
      "summary": "Liverpool began 2026 with a whimper as they were held to a 0-0 draw with an impressive Leeds at Anfield on New Year’s Day.",
      "publishedAt": "2026-01-01T19:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "New year, old hero! Cairney rescues point for Fulham as Palace winless run extends",
      "link": "https://www.skysports.com/football/crystal-palace-vs-fulham/report/531313",
      "summary": "Tom Cairney came off the bench to net a stunner to secure Fulham a 1-1 draw at Selhurst Park as Crystal Palace's festive rot dripped into the new year, extending the Eagles' run without a win to five games.",
      "publishedAt": "2026-01-01T19:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Maak kennis met de motor van Arne Slot",
      "link": "https://www.vi.nl/pro/tactische-analyse-liverpool-leeds-united-curtis-jones-cruciale-passer",
      "summary": "Sinds Arne Slot een vaste plek op het middenveld heeft vrijgemaakt voor Curtis Jones (24) is Liverpool gaan winnen. Dat is niet toevallig. De Engelsman verstuurt passes die cruciaal zijn in de speelwijze van Slot.",
      "publishedAt": "2026-01-01T19:24:15.000Z"
    }
  ]
}