{
  "generatedAt": "2026-01-12T12:55:34.631Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "KNVB Beker gaat verder met achtste finale: dit is het programma",
      "link": "https://www.vi.nl/nieuws/dit-is-het-programma-in-de-achtste-finale-van-de-knvb-beker",
      "summary": "Het toernooi om de Eurojackpot KNVB Beker 2025/26 gaat deze week verder. Dit is het schema voor de achtste finale, waarin onder meer de topper tussen AZ en Ajax op het programma staat.",
      "publishedAt": "2026-01-12T12:46:22.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Fernandes' X account was hacked - Man United",
      "link": "https://www.espn.com/soccer/story/_/id/47587847/bruno-fernandes-x-account-was-hacked-man-united",
      "summary": "Manchester United released a statement announcing that captain Bruno Fernandes' social media platform X account was hacked.",
      "publishedAt": "2026-01-12T12:38:19.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Madrid's Endrick wants to stay in Europe",
      "link": "https://www.espn.com/soccer/story/_/id/47587982/real-madrid-endrick-wants-stay-europe-turns-south-american-clubs",
      "summary": "Endrick is confident he will gain playing time and have success in Europe after spurning offers to return to South America.",
      "publishedAt": "2026-01-12T12:38:19.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McManus appoints Cobden as new retained rider",
      "link": "https://www.skysports.com/racing/news/12040/13493397/harry-cobden-jp-mcmanus-appoints-former-british-champion-jockey-as-new-retained-rider-next-season",
      "summary": "Harry Cobden will become the No 1 rider for leading owner JP McManus in Britain and Ireland from next season.",
      "publishedAt": "2026-01-12T12:38:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Carrick has backing for Man United job",
      "link": "https://www.espn.com/soccer/story/_/id/47587449/michael-carrick-significant-backing-man-united-interim-job-sources",
      "summary": "Michael Carrick has growing support within Manchester United for the role of interim manager, with sources telling ESPN that the former midfielder has significant backing.",
      "publishedAt": "2026-01-12T12:32:53.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Raphinha's 'intensity' leads Barça Supercopa win",
      "link": "https://www.espn.com/soccer/story/_/id/47584005/hansi-flick-raphinha-supercopa-barcelona-real-madrid-analysis",
      "summary": "Barcelona manager Hansi Flick lauded Raphinha's mentality after the Brazilian haunted Real Madrid once again with two goals in his team's 3-2 Spanish Supercopa final win in Saudi Arabia on Sunday.",
      "publishedAt": "2026-01-12T12:32:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Heetgebakerde Man Utd-tiener wordt gewaardeerd na excuses",
      "link": "https://www.vi.nl/nieuws/heetgebakerde-man-utd-tiener-wordt-gewaardeerd-na-excuses",
      "summary": "De achttienjarige Shea Lacey heeft via social media zijn excuses aangeboden na de rode kaart die hij ontving tijdens het bekerduel tussen zijn werkgever Manchester United en Brighton & Hove Albion. Dit werd gewaardeerd door de fans.",
      "publishedAt": "2026-01-12T12:31:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De reddingsactie van O'Neill: hoe Celtic plots weer van de Schotse titel droomt",
      "link": "https://www.vi.nl/nieuws/de-reddingsactie-van-o-neill-hoe-celtic-plots-weer-van-de-schotse-titel-droomt",
      "summary": "Terwijl Celtic zich misschien wel in de grootste crisis uit de clubhistorie bevindt, solliciteert Martin O'Neill naar een nóg legendarischere status. De 73-jarige interim-manager sprong dit seizoen al twee keer op de bres voor de club en heeft de titeldroom van Celtic weer aangewakkerd. Een daad uit pure liefde.",
      "publishedAt": "2026-01-12T12:30:07.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Markante Franse trainer Rolland Courbis, oude leermeester Bosz, overleden",
      "link": "https://www.vi.nl/nieuws/markante-franse-trainer-rolland-courbis-72-overleden",
      "summary": "De Franse voetbalwereld rouwt maandag om Rolland Courbis. De voormalig speler en trainer van onder meer Olympique Marseille is op 72-jarige leeftijd overleden. Het maakt veel reacties los in Frankrijk.",
      "publishedAt": "2026-01-12T12:25:16.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sideline spats and media snubs - Eagles' season ends in ugly fashion",
      "link": "https://www.skysports.com/nfl/news/12040/13493258/philadelphia-eagles-super-bowl-defence-ends-in-ugly-fashion-as-aj-brown-skips-media-after-nick-sirianni-confrontation",
      "summary": "Philadelphia Eagles surrendered their right to be known as defending Super Bowl champions on Sunday night. In so many ways it would encapsulate the story of their season.",
      "publishedAt": "2026-01-12T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "WSL talking points: the Tullis-Joyce furore and Neville’s nightmare return",
      "link": "https://www.theguardian.com/football/2026/jan/12/wsl-talking-points-tullis-joyce-furore-and-nevilles-nightmare-return",
      "summary": "Earring-gate prevents Estelle Cascarino from making her West Ham debut while City continue to lead the pack The sight of coaches issuing a tactical team talk while their goalkeeper receives medical treatment has become increasingly common in the WSL but it became particularly controversial after the goalless draw between Arsenal and Manchester United, especially when the visiting defender Dominique Janssen appeared to admit in an interview with Sky Sports that they had orchestrated it on purpose. Janssen said: “Phallon [Tullis-Joyce] went down for us to discuss tactical changes,” when asked about how United adapted to going down to 10 players. Marc Skinner later said that Tullis-Joyce had felt something and needed treatment, but Renée Slegers said perceived time-wasting was “frustrating for the players”, adding: “There’s so many people investing so much to come and watch us, in the stadium, on TV. I think the product needs to be attractive and I think this is probably one of the areas that brings the entertainment down a little bit.” Tom Garry Match report: Arsenal 0-0 Manchester United Match report: Chelsea 5-0 West Ham Continue reading...",
      "publishedAt": "2026-01-12T11:57:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Super Stuttgart sweep Leverkusen aside with in-demand Leweling to the fore | Andy Brassell",
      "link": "https://www.theguardian.com/football/2026/jan/12/super-stuttgart-sweep-leverkusen-aside-with-in-demand-leweling-to-the-fore",
      "summary": "Plenty of prospective candidates for Germany’s World Cup squad caught the eye in a 4-1 cruise at the BayArena If ever there was a weekend to show up on your best form, then this was it. Stuttgart travelled to Bayer Leverkusen for Saturday night’s Topspiel not just facing a team with whom they have had a healthy sporting rivalry with over recent years, but with an audience to perform to. Starting with an XI containing seven current national team players they were – of course – under the gaze of Rudi Völler, who served Leverkusen as player and sporting director over two spells amounting to almost 25 years and, though now the sporting director of the DFB, still lives locally and is a frequent visitor to the BayArena. So if he enjoyed this early-year shockwave to the Bundesliga’s established order, it would have been in a professional rather than a personal capacity. Games between these two have tended to be among the highlights of recent Bundesliga seasons; intriguing, edge-of-the-seat, push-pull affairs between a team that took the express elevator to the very top under Xabi Alonso and one which never blinked for a second when faced by them, emboldened by an inspiring coach of their own in Sebastian Hoeness. “Even in their top year two years ago when Leverkusen dominated everyone,” noted Völler as a Sunday guest on Sport1’s celebrated Doppelpass, “Stuttgart were the only team that played on equal terms in both games.” Continue reading...",
      "publishedAt": "2026-01-12T11:39:33.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hatenboer krijgt rood bij Eredivisie-debuut, Regeer valt uit",
      "link": "https://www.vi.nl/video/hatenboer-krijgt-rood-bij-eredivisie-debuut-regeer-valt-uit",
      "summary": "Cedric Hatenboer kende zondag een uiterst ongelukkig Eredivisie-debuut voor Telstar. De voormalig middenvelder van Excelsior, op huurbasis overgekomen van Anderlecht, kreeg in zijn eerste wedstrijd een rode kaart voor een tackle van achteren op Youri Regeer. De middenvelder van Ajax moest de strijd uiteindelijk staken.",
      "publishedAt": "2026-01-12T11:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Cascarino earring a 'schoolgirl error' - Williams",
      "link": "https://www.bbc.com/sport/football/articles/c77k1z1017zo?at_medium=RSS&at_campaign=rss",
      "summary": "Fara Williams says West Ham's Estelle Cascarino made a \"schoolgirl error\" by being denied a debut because she could not remove an earring.",
      "publishedAt": "2026-01-12T11:12:04.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why McLaren are more confident than rivals ahead of 2026 F1 season",
      "link": "https://www.skysports.com/f1/news/12040/13491254/f1-2026-why-mclaren-are-more-confident-than-ferrari-mercedes-red-bull-ahead-of-new-season",
      "summary": "Despite a total reset of Formula 1's regulations ahead of the 2026 season, reigning champions McLaren appear to be entering the sport's new era with more confidence than their expected main rivals.",
      "publishedAt": "2026-01-12T11:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Did that really happen?' - Macclesfield fancy another Premier League test",
      "link": "https://www.bbc.com/sport/football/articles/c3wzd5l53wvo?at_medium=RSS&at_campaign=rss",
      "summary": "Two days on from Macclesfield's stunning FA Cup third-round win over Crystal Palace, the heroics are still sinking in for manager John Rooney.",
      "publishedAt": "2026-01-12T10:24:14.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Liverpool and Chelsea eye Ramón? Gallagher to Spurs?",
      "link": "https://www.theguardian.com/football/2026/jan/12/football-transfer-rumours-liverpool-chelsea-spurs-arsenal",
      "summary": "Today’s rumours need a bit of a stir Most footballers become famous for playing the game but others attract renown for not liking it – foremost among the latter category is Arsenal’s Ben White. Accordingly, it would make sense were he to join David Moyes’s Everton, who are seeking to resolve a problematic right-back situation. The chance to follow in the footsteps of Tony Hibbert, typically a huge pull factor, is nullified because White presumably has no idea who he is. Elsewhere on Merseyside, it appears Liverpool have finally discovered the best way to improve a dodgy defence is not to buss hundreds of millions on attackers, but to have decent defenders. Consequently, they are looking at Como’s Jacobo Ramón – and so too are Chelsea, should the romance of being stockpiled with a 68-year contract prove too alluring to turn down. Continue reading...",
      "publishedAt": "2026-01-12T09:01:53.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Qatar in talks with Fifa to host first Women’s Club World Cup in January 2028",
      "link": "https://www.theguardian.com/football/2026/jan/12/qatar-talks-fifa-host-first-womens-club-world-cup-january-2028",
      "summary": "Qatar has no Fifa women’s ranking after lack of games January tournament will disrupt domestic seasons Qatar is in talks with Fifa about staging the inaugural Women’s Club World Cup, which is in line to cause major disruption to domestic seasons in 2027-28, including in Europe. Fifa announced last month that its latest new club competition would take place from 5 to 30 January 2028, but the governing body has not said where it will be held or whether it will run a formal bidding process. Continue reading...",
      "publishedAt": "2026-01-12T08:44:31.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick favourite for Man Utd caretaker role",
      "link": "https://www.bbc.com/sport/football/articles/crkr2zye3v1o?at_medium=RSS&at_campaign=rss",
      "summary": "Michael Carrick emerges as favourite for the Manchester United caretaker role with club chiefs hoping to have an appointment in place for when players return to training on Wednesday.",
      "publishedAt": "2026-01-12T08:33:52.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FA Cup third round: 10 talking points from the weekend’s football",
      "link": "https://www.theguardian.com/football/2026/jan/12/fa-cup-10-talking-points-weekend-third-round-football",
      "summary": "Crystal Palace’s stars wilt, Manchester City’s youngsters shine, and Liam Rosenior starts in stylish fashion Playing against lower-league opposition as a top-flight side in the FA Cup is like batting on the first morning of a Test match – you cannot really win and failure can prompt humiliation and reputational damage. To that end, some members of the Crystal Palace side deservedly beaten by Macclesfield perhaps learned a valuable lesson at Moss Rose. Marc Guéhi and Adam Wharton are linked regularly with big moves away from Palace, but part of succeeding at elite clubs – the pair are admired by Manchester City and Manchester United respectively – is coping with being overwhelming favourites. Oliver Glasner, too, may have designs on bigger things, with United again a possible destination, but to see his side schooled by part-timers was a blow to his burgeoning reputation. Glasner slammed his players after the defeat but the Austrian must take a portion of the blame. They must all do better. Dominic Booth Report: Macclesfield 2-1 Crystal Palace Report: Manchester City 10-1 Exeter Report: Manchester United 1-2 Brighton Report: Derby 1-3 Leeds Continue reading...",
      "publishedAt": "2026-01-12T08:00:51.000Z"
    }
  ]
}