{
  "generatedAt": "2026-01-14T10:29:54.595Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wat Van Dijk tegen Frimpong zei na zijn transfer naar Liverpool",
      "link": "https://www.vi.nl/nieuws/wat-van-dijk-tegen-frimpong-zei-na-zijn-transfer-naar-liverpool",
      "summary": "Jeremie Frimpong heeft zich uitgelaten over zijn band met Virgil van Dijk. De zomeraanwinst van Liverpool ziet de captain van The Reds vooral als een vriend. 'Maar als we spelen, dan is Virgil de leider.'",
      "publishedAt": "2026-01-14T10:28:47.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Waarom het niet ondenkbaar is dat Smit nog een jaar bij AZ blijft",
      "link": "https://www.vi.nl/video/waarom-het-niet-gek-is-als-smit-nog-een-jaar-bij-az-blijft",
      "summary": "Kees Smit staat in de belangstelling van alle grote clubs uit de top 5 competitie, maar de speler zelf blijft rustig onder alle aandacht en geruchten. AZ-watcher Simon Zwartkruis acht het ook niet ondenkbaar dat het grote talent nog een seizoen in Alkmaar te bewonderen zal zijn en legt uit waarom.",
      "publishedAt": "2026-01-14T10:27:09.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We're really stretched' - Livramento blow adds to Newcastle defence concerns",
      "link": "https://www.bbc.com/sport/football/articles/c78e49x5j0do?at_medium=RSS&at_campaign=rss",
      "summary": "Head coach Eddie Howe admits Newcastle United are \"really stretched\" after Tino Livramento is ruled out for up to two months with a hamstring injury.",
      "publishedAt": "2026-01-14T10:14:11.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "AS Roma-talent (16) scoort met eerste balcontact in het betaald voetbal",
      "link": "https://www.vi.nl/nieuws/as-roma-talent-16-scoort-met-eerste-balcontact-in-het-betaald-voetbal",
      "summary": "De kans is groot dat je nog nooit van Antonio Arena hebt gehoord. De zestienjarige aanvaller van AS Roma maakte dinsdag in het Coppa Italia-duel met Torino zijn debuut in het betaald voetbal en baarde opzien door met zijn eerste balcontact meteen te scoren.",
      "publishedAt": "2026-01-14T10:11:28.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slot vaak verrast: '28 van 30 meetings konden de prullenbak in'",
      "link": "https://www.vi.nl/nieuws/slot-vaak-verrast-28-van-30-meetings-konden-de-prullenbak-in",
      "summary": "Liverpool-manager Arne Slot stelt dat heel veel teams voor duels met de regerend kampioen van Engeland hun vertrouwde tactiek loslaten. Dat merkte de Nederlander ook na de start van het gewonnen bekerduel met Barnsley .",
      "publishedAt": "2026-01-14T10:10:57.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Ajax sign Zlatan's son on loan from AC Milan",
      "link": "https://www.espn.com/soccer/story/_/id/47606855/ajax-sign-zlatan-ibrahimović-son-maximillian-ac-milan",
      "summary": "Ajax have confirmed the loan signing of the son of Zlatan Ibrahimović, Maximillian, from AC Milan.",
      "publishedAt": "2026-01-14T10:05:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Pro License admission barriers allow women’s coaching opportunities to go ‘down the drain’",
      "link": "https://www.theguardian.com/football/2026/jan/14/womens-football-coaching-pro-license-uefa",
      "summary": "Uefa’s limitations have set hurdles for women keen to take the next step in coaching despite the increasing demand Mariana Cabral has a coaching CV to be proud of. Born on the small Azores island of São Miguel, she has been in charge of the women’s teams at clubs including Benfica and Sporting, but the 38-year-old is frustrated. “We want more women coaches,” she says. “Who won the Euros? Who won the Champions League? Women – but we are losing so many.” Cabral has her A Licence but is stuck in limbo. Unable to get on a Pro Licence course that would clear a path to more senior head coach roles in an era when women’s teams are increasingly demanding that qualification, she stepped back to become a No 2 in the US. But after one NWSL season with Utah Royals, she left in December in the hope that expanding her experience at another club would help to open a Pro Licence door. Continue reading...",
      "publishedAt": "2026-01-14T10:05:17.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Iran’s footballers face battle to be heard as regime brutally clamps down on protests",
      "link": "https://www.theguardian.com/football/2026/jan/14/iran-football-team-battle-to-be-heard-regime-protests",
      "summary": "For Mehdi Taremi and others playing abroad, showing solidarity with their home nation can mean threats and possible detention Mehdi Taremi did what he does best. On Saturday, the Iranian striker turned inside the area and scored for Olympiakos, a well-taken eighth goal of the season for the 33-year-old that clinched a 2-0 win at Atromitos and a place at the top of the Greek Super League. Usually, millions of people in Iran follow every step of Taremi’s European career, one that took off with Porto and has settled in Piraeus via Milan, but not this time. The ruling regime in Tehran has cut the internet and all communications, which meant that residents of the football-loving nation also missed the non-celebration that followed. “It actually has to do with the conditions in my country,” Taremi said. “There are problems between the people and the government. The people are always with us, and that’s why we are with them. I couldn’t celebrate in solidarity with the Iranian people. I know that Olympiakos fans would like me to be happy, but I don’t celebrate the goals, in solidarity with what the Iranian people are going through.” Continue reading...",
      "publishedAt": "2026-01-14T10:00:22.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Utd not planning Jan. transfers for Carrick",
      "link": "https://www.espn.com/soccer/story/_/id/47606619/man-united-not-planning-january-transfers-michael-carrick-sources",
      "summary": "Michael Carrick will work with the squad he has inherited as Man United boss with the club having no plans to make new signings, sources have told ESPN.",
      "publishedAt": "2026-01-14T09:37:06.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep rants over VAR on disallowed Semenyo goal",
      "link": "https://www.espn.com/soccer/story/_/id/47603386/pep-rants-var-disallowed-semenyo-goal-man-city",
      "summary": "Pep Guardiola said he expects an explanation from referees' chief Howard Webb during a post-match rant after Antoine Semenyo's disallowed goal during a Manchester City win over Newcastle United on Tuesday.",
      "publishedAt": "2026-01-14T09:37:06.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior plans talks with Chelsea exile Sterling",
      "link": "https://www.espn.com/soccer/story/_/id/47603026/chelsea-liam-rosenior-raheem-sterling-axel-disasi",
      "summary": "\\Chelsea boss Liam Rosenior said he intends to hold talks with Raheem Sterling and Axel Disasi over their futures Stamford Bridge.",
      "publishedAt": "2026-01-14T09:37:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Oosting hoopt bekerheld Kerk te behouden: 'Ik ga wel doorduwen'",
      "link": "https://www.vi.nl/nieuws/oosting-hoopt-bekerheld-kerk-te-behouden-ik-ga-wel-doorduwen",
      "summary": "Antwerp-trainer Joseph Oosting hoopt dat Gyrano Kerk ook na dit seizoen nog in Antwerpen actief blijft. De Surinaams international heeft een aflopend contract en is sinds een aantal weken bijzonder op dreef. Zo ook in het gewonnen bekerduel van Antwerp met La Louvière .",
      "publishedAt": "2026-01-14T09:35:43.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football transfer rumours: Chelsea to swoop for West Ham’s Lucas Paquetá?",
      "link": "https://www.theguardian.com/football/2026/jan/14/football-transfer-rumours-chelsea-west-hams-lucas-paqueta-marc-guehi-bayern-munich",
      "summary": "Today’s tell-all has got its ducks in a row Liam Rosenior has been Chelsea manager for a whole week without making a signing. That is bound to be remedied soon enough, and one name that has been bandied about is that of Lucas Paquetá. The Brazilian midfielder is set to leave West Ham in this transfer window having has said he wants to leave the Premier League and join Flamengo because of his disillusionment with how he was treated over the spot-fixing allegations of which he was cleared. But the Brazilian journalist Renan Moura reports that people around Paquetá want to persuade him to stay in Europe, and Chelsea could move for him. The future of Marc Guéhi was always likely to be one of the main plotlines of this transfer window, with original suitors Liverpool tussling with Manchester City over the defender’s services as he enters the last six months of his Crystal Palace contract. Arsenal have also shown interest but now entering stage left are Bayern Munich, whose sporting director, Max Erbl, has been having cosy chats with Guéhi’s agent at the Bundesliga champions’ training ground, according to Sky Italia. Continue reading...",
      "publishedAt": "2026-01-14T09:27:41.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Osimhen has become 'king of Nigerian football'",
      "link": "https://www.bbc.com/sport/football/articles/ce9yxjr98pgo?at_medium=RSS&at_campaign=rss",
      "summary": "Nigeria face a huge semi-final against Africa Cup of Nations hosts and favourites Morocco on Wednesday.",
      "publishedAt": "2026-01-14T08:52:51.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Could Arsenal win Premier League without a regular goalscorer?",
      "link": "https://www.bbc.com/sport/football/articles/cn56k7dpw7ko?at_medium=RSS&at_campaign=rss",
      "summary": "No team has ever won the Premier League title without having a player in the top 10 goalscorers, but could Arsenal change that?",
      "publishedAt": "2026-01-14T08:25:07.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Maye vs the monster - why the Texans can shock the NFL",
      "link": "https://www.skysports.com/nfl/news/12040/13493697/the-houston-texans-can-win-the-super-bowl-but-the-nfls-best-defense-needs-cj-stroud-to-fire",
      "summary": "Modern NFL defenses tend to like a scalpel. The Houston Texans prefer a sledgehammer.",
      "publishedAt": "2026-01-14T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Panic Attack returns for another Newbury prize",
      "link": "https://www.skysports.com/racing/news/12040/13493513/today-on-sky-sports-racing-lingfield-newbury-and-happy-valley",
      "summary": "We have a busy day’s racing on Wednesday with action from Lingfield, Newbury and Happy Valley, live on Sky Sports Racing...",
      "publishedAt": "2026-01-14T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why has no English boss won Premier League - and who could be first?",
      "link": "https://www.bbc.com/sport/football/articles/cp37k9ql449o?at_medium=RSS&at_campaign=rss",
      "summary": "Why has an English manager not won the Premier League? Chief football writer Phil McNulty explores who could make history.",
      "publishedAt": "2026-01-14T06:39:45.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Raducanu fights back in Hobart to win first match since September",
      "link": "https://www.skysports.com/tennis/news/12040/13494022/emma-raducanu-british-no-1-fights-back-in-hobart-to-win-first-match-since-september-beating-camila-osorio",
      "summary": "Emma Raducanu earned her first victory since September after fighting back to beat Camila Osorio in straight sets in the first round of the Hobart International.",
      "publishedAt": "2026-01-14T05:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The three ages of Michael Carrick … and what they say about Manchester United",
      "link": "https://www.theguardian.com/football/2026/jan/14/the-three-ages-of-michael-carrick-and-what-they-say-about-manchester-united",
      "summary": "From his competitive debut to his first spell as interim, the former midfielder has seen much at Old Trafford over the past two decades 23 August 2006, Charlton 0-3 Manchester United The 25‑year‑old new signing was eased into United’s midfield as a second-half substitute in the second game of the season, having picked up a small injury on the pre‑season tour. With Wayne Rooney and Paul Scholes suspended, Sir Alex Ferguson started with John O’Shea and Darren Fletcher in central midfield, with the Scot (sporting a mullet) opening the scoring after Ryan Giggs and Cristiano Ronaldo had hit the woodwork. Carrick was one of four future United managers in the side, alongside Fletcher, Giggs and Ole Gunnar Solskjær, who rounded off the win with a late goal after Louis Saha had doubled United’s lead. Solskjær’s goal was his first in the league in three injury-hit years, and the Norwegian, also a substitute, should have had another when Carrick squared a perfect pass to the striker, only for Charlton’s Scott Carson to make an outstanding save. With Carrick an instant success at United that season, the club roared to the title in May 2007, their first in four years. Continue reading...",
      "publishedAt": "2026-01-14T00:00:08.000Z"
    }
  ]
}