{
  "generatedAt": "2026-01-11T12:49:11.094Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slot geeft hoopvolle blessure-update Ekitiké",
      "link": "https://www.vi.nl/nieuws/slot-geeft-hoopvolle-blessure-update-ekitike",
      "summary": "Arne Slot is hoopvol dat hij in het FA Cup-duel met Barnsley weer de beschikking heeft over spits Hugo Ekitiké. De Fransman moest twee wedstrijden aan zich voorbij laten gaan vanwege een blessure, maar is nu dicht bij een terugkeer.",
      "publishedAt": "2026-01-11T12:45:38.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool's Conor Bradley out for season with knee injury",
      "link": "https://www.espn.com/soccer/story/_/id/47579359/liverpool-conor-bradley-season-knee-injury",
      "summary": "Liverpool defender Conor Bradley is set to miss the rest of the season after suffering a serious knee injury in Thursday's 0-0 draw with Arsenal.",
      "publishedAt": "2026-01-11T12:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "USMNT's Pepi suffers broken arm scoring for PSV",
      "link": "https://www.espn.com/soccer/story/_/id/47573639/usmnt-ricardo-pepi-broken-arm-psv-eindhoven-goal",
      "summary": "United States striker Ricardo Pepi suffered a broken forearm while in action for PSV Eindhoven on Saturday and and is set to be sidelined for two months, the Dutch club has confirmed..",
      "publishedAt": "2026-01-11T12:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah scores to set up AFCON reunion with Mané",
      "link": "https://www.espn.com/espn/story/_/id/47573488/salah-fires-egypt-afcon-champions-ivory-coast-set-mane-senegal-reunion-semifinal",
      "summary": "Mohamed Salah scored his fourth goal of the Africa Cup of Nations as Egypt defeated defending champions Ivory Coast 3-2 in Agadir.",
      "publishedAt": "2026-01-11T12:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Buoyant Rosenior lauds 5-star Chelsea start",
      "link": "https://www.espn.com/soccer/story/_/id/47574761/liam-rosenior-chelsea-squad-charlton-fa-cup",
      "summary": "New Chelsea head coach Liam Rosenior promised more to come from his second string after they swept aside Charlton 5-1 at the Valley in his first match in charge.",
      "publishedAt": "2026-01-11T12:43:21.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: geen Wijndal in Ajax-selectie, Hatenboer debuteert bij Telstar",
      "link": "https://www.vi.nl/nieuws/vi-live-geen-wijndal-in-ajax-selectie-hatenboer-debuteert-bij-telstar",
      "summary": "Welkom in deze VI Live met aandacht voor Telstar - Ajax. Om 14.30 uur is de aftrap van dit Eredivisie-duel. Op deze plek houden we je op de hoogte.",
      "publishedAt": "2026-01-11T12:37:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slot benadrukt: FA Cup belangrijk toernooi voor Liverpool",
      "link": "https://www.vi.nl/video/slot-benadrukt-fa-cup-belangrijk-toernooi-voor-liverpool",
      "summary": "Liverpool neemt het toernooi om de FA Cup dit seizoen uiterst serieus, benadrukt Arne Slot. Maandagavond wacht League One-club Barnsley in de derde ronde.",
      "publishedAt": "2026-01-11T12:35:42.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City v Everton, Chelsea v West Ham and more: WSL clockwatch – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/11/manchester-city-v-everton-chelsea-v-west-ham-and-more-wsl-clockwatch-live",
      "summary": "⚽ Women’s Super League updates as the goals go in ⚽ Live scores | Get in touch! Email Emillia here Meanwhile, London City Lionesses cut ties with Jocelyn Prêcheur despite being sixth in the table. Prêcheur had been in charge of the club since the summer of 2024 and led them to the Championship title last term. Eder Maestre took over as the club’s new head coach on New Year’s Day. Upon his arrival, he said: “I am delighted to join London City Lionesses. I love English football and representing this club is a real honour. In my opinion this project is now the best project in women’s football. The ambitions are very aligned with my values and I’m very excited.” Continue reading...",
      "publishedAt": "2026-01-11T12:30:15.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Derby v Leeds United: FA Cup third round – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/11/derby-v-leeds-united-fa-cup-third-round-live",
      "summary": "⚽ Updates from the FA Cup tie (midday GMT) ⚽ Live scores | Sign up for Football Daily | Email Billy 2 min: Leeds’ first foray into the Derby box comes up short as Langas comes across and clears his lines. Ao Tanaka gets the ball rolling for Leeds, who are in blue. Continue reading...",
      "publishedAt": "2026-01-11T12:29:39.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool's Bradley out for season with knee injury",
      "link": "https://www.bbc.com/sport/football/articles/cgqevx5pvk1o?at_medium=RSS&at_campaign=rss",
      "summary": "Liverpool defender Conor Bradley is ruled out for the rest of the domestic season after suffering a significant knee injury, involving damage to bone and ligament.",
      "publishedAt": "2026-01-11T12:28:11.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Feyenoord-huurling Slory direct in de basis bij Go Ahead",
      "link": "https://www.vi.nl/nieuws/vi-live-bekijk-het-programma-in-binnen-en-buitenland",
      "summary": "Welkom in de VI Live op deze ijskoude zondag 11 januari. Volg hier de ontwikkelingen binnen en buiten de grenzen, met op deze plek onder meer aandacht voor de Eredivisie, de finale van de Super Cup tussen Barcelona en Real Madrid en het FA Cup-toernooi.",
      "publishedAt": "2026-01-11T12:24:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Jarige Steur opnieuw vervanger van vertrokken Taylor",
      "link": "https://www.vi.nl/nieuws/jarige-steur-bij-ajax-opnieuw-vervanger-van-vertrokken-taylor",
      "summary": "Interim-coach Fred Grim van Ajax kiest bij de hervatting van de Eredivisie, met een uitwedstrijd tegen Telstar, voor hetzelfde middenveld als in de Eredivisie-wedstrijd voor de winterstop. Dit betekent dat Sean Steur opnieuw op de plek van Kenneth Taylor staat.",
      "publishedAt": "2026-01-11T12:16:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arne Slot hit with Conor Bradley injury blow as he vows to go strong against Barnsley",
      "link": "https://www.theguardian.com/football/2026/jan/11/arne-slot-to-pick-strong-liverpool-team-a-year-on-from-plymouth-fa-cup-upset",
      "summary": "Bradley to miss rest of season with serious knee injury Slot will not repeat past error in FA Cup third-round tie Arne Slot has promised not to repeat last season’s FA Cup gamble against Plymouth when Liverpool entertain Barnsley in the third round on Monday. One player he will not be able to select, however, is Conor Bradley after it was confirmed the right-back will have to undergo surgery on the knee injury he sustained in Thursday’s goalless draw with Arsenal and is likely to rule him out for the rest of the season. Slot changed all 10 outfield players for the fourth-round tie at Home Park and was punished as Plymouth, then bottom of the Championship, produced a huge shock to win 1-0. He compounded his selection risk with an inexperienced bench that included only two senior players; Curtis Jones and Darwin Núñez. Slot stands by his decision on the basis Liverpool were challenging for four trophies at the time. But with his team out of the Carabao Cup and a distant fourth in the Premier League this season, that pressure no longer applies. Continue reading...",
      "publishedAt": "2026-01-11T12:00:28.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool's Bradley to miss rest of season with significant knee injury",
      "link": "https://www.skysports.com/football/news/12040/13493040/conor-bradley-injury-liverpool-defender-to-miss-rest-of-season-with-significant-knee-injury-sustained-at-arsenal",
      "summary": "Liverpool defender Conor Bradley will miss the rest of the season with a significant knee injury sustained in Thursday's goalless draw at Arsenal.",
      "publishedAt": "2026-01-11T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Supercopa Clasico preview, predictions: Are Barcelona favorites vs. Real Madrid?",
      "link": "https://www.espn.com/soccer/story/_/id/47568270/barcelona-favorites-vs-real-madrid",
      "summary": "Barcelona and Real Madrid meet in the Supercopa final Sunday, but who has the upper hand? Sam Marsden and Alex Kirkland preview the upcoming Clasico.",
      "publishedAt": "2026-01-11T11:59:54.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Who makes the Sky Sports Championship team of the season so far?",
      "link": "https://www.skysports.com/football/news/12040/13491180/who-makes-the-sky-sports-championship-team-of-the-season-so-far",
      "summary": "",
      "publishedAt": "2026-01-11T10:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sabalenka goes back-to-back in Brisbane after not dropping set all week",
      "link": "https://www.skysports.com/tennis/news/12040/13492988/aryna-sabalenka-retains-brisbane-international-title-after-not-dropping-set-all-week-as-world-no-1-prepares-for-australian-open",
      "summary": "World No 1 Aryna Sabalenka captured back-to-back Brisbane International titles as she avoided becoming Marta Kostyuk's latest top-10 scalp in Sunday's final.",
      "publishedAt": "2026-01-11T08:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘I’ve never celebrated a goal at 9-0 down in my life’: inside Exeter’s dressing room on a day to remember",
      "link": "https://www.theguardian.com/football/2026/jan/11/exeter-city-gary-caldwell-manchester-city-10-1-fa-cup",
      "summary": "League One club offered behind-the-scenes access for FA Cup tie and manager Gary Caldwell will not let crushing loss at Manchester City define them “The team to win today, lads” begins Gary Caldwell. Exeter City are two hours from kicking off against Manchester City in the FA Cup third round, and their manager is addressing his players at a hotel shortly before they travel to the Etihad. “You know why I said that?” he continues, his thick Scottish accent filling the room. No one knows. He explains the phrase is borrowed from Roberto Martínez, under whom Caldwell won the competition with Wigan in 2013. It was used to bring humour and break tension when his team were inevitably written off. Continue reading...",
      "publishedAt": "2026-01-11T08:00:21.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah inspires Egypt with energy recalling golden generation to evoke recent history | Jonathan Wilson",
      "link": "https://www.theguardian.com/football/2026/jan/11/egypt-mohamed-salah-africa-cup-of-nations-football",
      "summary": "Liverpool forward will face his former teammate Sadio Mané in Afcon semi against Senegal after arguably the Pharaohs’ best performance since 2008 It is a long time since Egypt had a night this good. There have been two World Cup qualifications since their golden age of three successive Cups of Nations came to an end in 2010, and they’ve got to the finals of two Cups of Nations since, but this had a different feel to the knockout phases in 2017 or 2021 (played in 2022). This wasn’t grinding through, doing just enough (across the knockouts in 2017 and 2021, Egypt won one game without needing extra time or penalties; a grim 1-0 against Morocco in the 2017 quarter-final). It was taking on one of the giants of African football and beating them well. A 3-2 victory over Côte d’Ivoire was probably Egypt’s best single performance since they beat the same opposition 4-1 in the semi-finals of Ghana 2008. That game in Kumasi was always going to cast its shadow over this quarter-final. Saturday’s coaches were on opposite sides when Egypt beat Côte d’Ivoire on penalties in the 2006 final in Cairo – Hossam Hassan as a 39-year-old squad captain and unused sub and Émerse Faé in the centre of midfield – but it was the semi-final two years later this game most resembled. The 4-1 hurt Côte d’Ivoire far more than the final had, the image of a bewildered Kolo Touré running away from Amr Zaki as he scored Egypt’s third a symbol of the Pharaohs’ superiority that night. Within four minutes on Saturday, Odilon Kossounou had got in a similar mess, legs tangled as Omar Marmoush sped by him to put Egypt ahead. Continue reading...",
      "publishedAt": "2026-01-11T08:00:21.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Rosenior sees no need for drastic change at Chelsea",
      "link": "https://www.bbc.com/sport/football/articles/crrnzerklyeo?at_medium=RSS&at_campaign=rss",
      "summary": "Liam Rosenior does not see a need for drastic change at Chelsea - and that was part of the reason he was brought in.",
      "publishedAt": "2026-01-10T23:48:13.000Z"
    }
  ]
}