{
  "generatedAt": "2026-01-07T08:36:00.676Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Dit is het schema van de kwartfinale van de Afrika Cup",
      "link": "https://www.vi.nl/nieuws/dit-is-het-schema-van-de-kwartfinale-van-de-afrika-cup",
      "summary": "De achtste finales van de Afrika Cup zitten erop, wat betekent dat het tijd is voor de kwartfinales. Na twee rustdagen gaat het toernooi vrijdag verder. We zetten de wedstrijden op een rij.",
      "publishedAt": "2026-01-07T08:29:26.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Glasner vreest: 'Bij een enorm bod van Man City zal Guéhi vertrekken'",
      "link": "https://www.vi.nl/nieuws/glasner-vreest-bij-een-enorm-bod-van-man-city-zal-gu-hi-vertrekken",
      "summary": "Oliver Glasner vreest voor een vertrek van Marc Guéhi. De sterkhouder van Crystal Palace staat in de nadrukkelijke belangstelling van Manchester City. Mocht die club de portemonnee trekken, dan weet Glasner wel hoe laat het is.",
      "publishedAt": "2026-01-07T08:03:07.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Liam Rosenior’s time at Strasbourg was ideal preparation for Chelsea",
      "link": "https://www.theguardian.com/football/2026/jan/07/liam-rosenior-strasbourg-ideal-preparation-chelsea-young-players-demands-owners",
      "summary": "The 41-year-old is at home with young players and, crucially, he is familiar with the demands of Chelsea’s owners By Get French Football News Liam Rosenior looks up at the towering Strasbourg Kop. He shouts and pleads as he points to his players, demanding the fans applaud them. Met with hostility, boos and jeers in the stands, he cuts a lone figure, one at pains to sow unity at a divided club. Strasbourg had just won the game, beating Le Havre 1-0 earlier this season, but the club’s fans were in no mood to celebrate. Behind an image are a thousand words, or three banners in this case. One called for the club president Marc Keller to leave Strasbourg; another criticised the bizarre Ishé Samuels-Smith back-and-forth transfer; and the one to which Rosenior took particular exception concerned his captain, Emmanuel Emegha. It read: “Emegha, pawn of BlueCo, after changing shirts, hand back your armband.” Emegha had agreed a deal to join Chelsea a few days earlier, once again confirming to Strasbourg fans that they were subservient to “big brother” Chelsea in the multi-club hierarchy. Continue reading...",
      "publishedAt": "2026-01-07T08:00:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No games, no league and now no City Football Group: Indian football faces up to ‘global embarrassment’",
      "link": "https://www.theguardian.com/football/2026/jan/07/no-games-no-league-city-football-group-indian-football-global-embarrassment-mumbai-city-manchester",
      "summary": "CFG have ditched Mumbai City and losing the glamour will hurt the game in the world’s most populated nation The world’s biggest multiclub network shrank from 13 to 12 in the last week of 2025 but few blame the City Football Group for walking away from Mumbai City and India after six years. The reason for divesting their shares which gave them 65% ownership was addressed, not that anyone needed enlightening in a statement. “CFG has made this decision after a comprehensive commercial review and in light of the ongoing uncertainty surrounding the future of the Indian Super League (ISL).” Uncertainty is an underestimation. The 2025-26 ISL season was supposed to kick off in September. However, with a 15-year Masters Right Agreement between the All India Football Federation (AIFF) and its commercial partner ending in December and no new agreement or partner in place, it never started. Most assumed that it would be a short-lived delay but here we are, in 2026, and there is still no football. A meeting took place in Delhi on Tuesday and produced a start date of 14 February, just six weeks short of a year since Mumbai’s last ISL game. How it works, if it works, remains to be seen. Continue reading...",
      "publishedAt": "2026-01-07T08:00:36.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Prepare for takeoff: which football teams play closest to airports? | The Knowledge",
      "link": "https://www.theguardian.com/football/2026/jan/07/which-football-teams-play-closest-to-airports-the-knowledge",
      "summary": "Plus: goals (not) on film and was Liverpool’s substitution chain at Spurs the longest in football? Mail us with your questions and answers “After St Mirren beat Celtic in the Scottish League Cup, I wondered where it actually is,” writes Dan J. “The answer is (as everyone bar me knew) Paisley, right next to Glasgow airport. Which got me wondering, which team is closest to an airport? I reckon Glentoran, next to Belfast City, and Eastleigh, virtually in Southampton airport, are in with a shout. And Charlton if you are happy to swim part of the way. Any closer ones?” We had so many answers to this question, so thank you to one and all. Let’s start with a ground that is but a thunderclap away from the nearest airport. “The Icelandic football club Valur is near Rekjavík airport, which is mostly a domestic airport, but also has some international flights,” writes Kári Tulinius. “The distance from the fence around the airport to Valur’s fence is about 150 metres. From training pitch to the nearest piece of airport tarmac is 230m, and from corner flag to the end of the runway is 380m. All of these distances were measured with Google Maps.” Continue reading...",
      "publishedAt": "2026-01-07T08:00:36.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van trainer naar 'td': deze grote namen gingen Ten Hag voor",
      "link": "https://www.vi.nl/nieuws/van-trainer-naar-td-deze-grote-namen-gingen-ten-hag-voor",
      "summary": "Het aantreden van Erik ten Hag als technisch directeur van FC Twente doet denken aan enkele andere bekende Nederlandse coaches die het trainingsveld verruilden voor een bestuursfunctie. We zetten er enkele op een rij.",
      "publishedAt": "2026-01-07T07:57:42.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Nuno blijft strijdbaar na volgende dreun voor dolend West Ham",
      "link": "https://www.vi.nl/nieuws/nuno-blijft-strijdbaar-na-volgende-dreun-voor-dolend-west-ham",
      "summary": "West Ham United-manager Nuno Espírito Santo houdt de moed erin na de volgende nederlaag met The Hammers in de Premier League. West Ham verloor dinsdagavond van Nottingham Forest en de zorgen bij de club uit het oosten van Londen nemen steeds verder toe.",
      "publishedAt": "2026-01-07T07:44:40.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Ik wil heel graag de Speler van het Toernooi worden'",
      "link": "https://www.vi.nl/video/ik-wil-heel-graag-de-speler-van-het-toernooi-worden",
      "summary": "Amad Diallo heeft zichzelf een doel gesteld. De speler van Manchester United was de grote uitblinker bij Ivoorkust in de achtste finale van de Afrika Cup tegen Burkina Faso. Hij wil - naast het toernooi winnen - ook de Speler van het Toernooi worden.",
      "publishedAt": "2026-01-07T07:27:15.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "TGL golf: Horschel delivers winning putt to keep Atlanta undefeated",
      "link": "https://www.skysports.com/golf/news/12040/13491367/tgl-golf-billy-horschel-delivers-winning-putt-to-keep-atlanta-undefeated-as-league-announce-formation-of-wtgl",
      "summary": "Billy Horschel drained the decisive putt to give Atlanta Drive GC their seventh consecutive victory in a 7-4 win over The Bay Golf Club on Tuesday.",
      "publishedAt": "2026-01-07T07:14:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Nasser: England will regret not starting series with 'exceptional' Bethell",
      "link": "https://www.skysports.com/watch/video/13491375/ashes-nasser-hussain-believes-england-will-regret-not-starting-the-series-with-exceptional-jacob-bethell",
      "summary": "Nasser Hussain believes England will regret not starting the series with Jacob Bethell.",
      "publishedAt": "2026-01-07T07:13:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bethell hits sublime maiden Test ton to give England slim hope in Sydney",
      "link": "https://www.skysports.com/cricket/news/12040/13491358/the-ashes-jacob-bethell-hits-maiden-test-hundred-to-give-slim-hope-to-england-fightback-in-fifth-test-in-sydney",
      "summary": "Jacob Bethell scored a sublime maiden first-class century to give hope to an England fightback in the fifth Ashes Test in Sydney before a late wobble on the fourth evening left the tourists eight wickets down and with a lead of 119.",
      "publishedAt": "2026-01-07T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Fletcher on 'surreal' week, unbelievable Bruno and bringing positivity back to Man Utd",
      "link": "https://www.skysports.com/football/news/12040/13491294/darren-fletcher-man-utd-interim-boss-on-surreal-week-unbelievable-bruno-fernandes-and-bringing-positivity-back",
      "summary": "\"I best speak to Sir Alex.\"",
      "publishedAt": "2026-01-07T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Nobody can get hold of him' - what happened to David Batty?",
      "link": "https://www.bbc.com/sport/football/articles/cp9jn090kv2o?at_medium=RSS&at_campaign=rss",
      "summary": "England midfielder David Batty vowed to have \"nothing to do with the football industry\" after retirement. As his former clubs Newcastle and Leeds prepare to meet, BBC Sport asks: What happened to him?",
      "publishedAt": "2026-01-07T06:47:44.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Why Fletcher could be what Man Utd fans have been waiting for'",
      "link": "https://www.bbc.com/sport/football/articles/czdqllp9639o?at_medium=RSS&at_campaign=rss",
      "summary": "In his BBC Sport column, ex-Premier League boss Tony Pulis explains why Manchester United's interim manager Darren Fletcher would be the perfect choice to take the job on a longer-term basis.",
      "publishedAt": "2026-01-07T06:28:49.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "No Mahomes, no Chiefs - the time is now for Josh Allen's Bills",
      "link": "https://www.skysports.com/nfl/news/12040/13491125/josh-allens-buffalo-bills-look-to-end-super-bowl-heartbreak-with-no-patrick-mahomes-or-kansas-city-chiefs-standing-in-their-way",
      "summary": "With a 'nearly' reputation in sport comes mounting, ever-intensifying year-on-year pressure. Josh Allen and the Buffalo Bills return to the NFL playoffs desperate to quash their own 'nearly-men' anguish - this has to be their moment, their time.",
      "publishedAt": "2026-01-07T06:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Who will be Man United's next manager? 12 top candidates to replace Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47516208/man-united-next-manager-12-candidates-replace-amorim",
      "summary": "Whether Manchester United aim to hire quickly or wait until summer, here are the coaches they could be after.",
      "publishedAt": "2026-01-07T04:00:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Man United sacked Amorim: Tactics, player issues, transfer frustration",
      "link": "https://www.espn.com/soccer/story/_/id/47514917/manchester-united-story-firing-ruben-amorim-analysis-rob-dawson",
      "summary": "Ruben Amorim was seen as a risky choice to lead Man United's rebuild. Here's how things broke down.",
      "publishedAt": "2026-01-07T04:00:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United approach Carrick, Solskjaer",
      "link": "https://www.espn.com/soccer/story/_/id/47527700/man-united-approach-ole-gunnar-solskjaer-michael-carrick-interim-role",
      "summary": "Manchester United have held \"early-stage informal talks\" with several potential interim managers, including Ole Gunnar Solskjaer and Michael Carrick, sources have told ESPN.",
      "publishedAt": "2026-01-07T02:02:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea name Rosenior as coach on 5½-year deal",
      "link": "https://www.espn.com/soccer/story/_/id/47523773/liam-rosenior-chelsea-appointment-strasbourg-exit-premier-league-manager",
      "summary": "Chelsea have announced the appointment of Liam Rosenior as their new head coach on a 5½-year contract.",
      "publishedAt": "2026-01-07T02:02:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Messi prefers ownership to coaching after career",
      "link": "https://www.espn.com/soccer/story/_/id/47529898/lionel-messi-prefers-ownership-coaching",
      "summary": "Lionel Messi said Tuesday that he does not see a future for himself as a manager, but would like to be a club owner someday.",
      "publishedAt": "2026-01-07T02:02:34.000Z"
    }
  ]
}