{
  "generatedAt": "2026-01-13T16:37:17.947Z",
  "items": [
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Robertson: Szoboszlai backheel 'unacceptable'",
      "link": "https://www.espn.com/soccer/story/_/id/47597514/liverpool-barnsley-andy-robertson-dominik-szoboszlai-backheel-fa-cup-kop-anfield",
      "summary": "Liverpool defender Andy Robertson has described teammate Dominik Szoboszlai's careless backheel against Barnsley as \"unacceptable.\"",
      "publishedAt": "2026-01-13T16:31:23.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Klopp: Xabi's Madrid exit 'nothing to do with me'",
      "link": "https://www.espn.com/soccer/story/_/id/47598753/xabi-alonso-real-madrid-exit-do-me",
      "summary": "Jürgen Klopp has stated that he has not received any calls from Real Madrid following the exit of Xabi Alonso, and affirmed that the decision has nothing to do with him.",
      "publishedAt": "2026-01-13T16:23:20.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Carrick set to be new Man United boss",
      "link": "https://www.espn.com/soccer/story/_/id/47587449/michael-carrick-set-appointed-new-man-united-interim-boss-sources",
      "summary": "Michael Carrick has growing support within Manchester United for the role of interim manager, with sources telling ESPN that the former midfielder has significant backing.",
      "publishedAt": "2026-01-13T16:23:20.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Madrid stars Mbappé, Bellingham bid Alonso adiós",
      "link": "https://www.espn.com/soccer/story/_/id/47597455/kylian-mbappe-bids-xabi-alonso-farewell-no-message-vinicius-junior-jude-bellingham",
      "summary": "Kylian Mbappé has paid tribute to Xabi Alonso after the Spanish coach departed Real Madrid after less than eight months in charge.",
      "publishedAt": "2026-01-13T16:23:20.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transfers PSV: deze eisen stelt PSV aan een mogelijke nieuwe spits",
      "link": "https://www.vi.nl/nieuws/transfers-psv-bosz-sluit-extra-transfer-niet-uit-na-blessure-pepi",
      "summary": "VI volgt het transfernieuws bij PSV op de voet, zeker nu de winterse transferwindow in aantocht is. De doelwitten van de Eindhovenaren, duiding van de clubwatcher, of aandacht in buitenlandse media. We verzamelen alles hier.",
      "publishedAt": "2026-01-13T16:07:50.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Volgend Sparta-talent dient zich aan: 'Ik ben meer een Frimpong dan een Dumfries'",
      "link": "https://www.vi.nl/pro/volgend-sparta-talent-dient-zich-aan-ik-ben-meer-een-frimpong-dan-een-dumfries",
      "summary": "Het leven van Lushendry Martes (17) heeft de afgelopen periode veel weg van een snelkookpan. De rechtsback, die vanaf zijn negende jaar al bij Sparta Rotterdam speelt, maakte al zijn debuut in de beker en competitie, en mocht zondag op Het Kasteel ook zijn basisdebuut maken in de Eredivisie.",
      "publishedAt": "2026-01-13T16:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah-Mane rivalry renewed in Afcon semi-finals",
      "link": "https://www.bbc.com/sport/football/articles/c9dvg5lyz02o?at_medium=RSS&at_campaign=rss",
      "summary": "Mohamed Salah's Egypt will face Senegal in the Afcon 2025 semi-finals, offering the chance of revenge against his old Liverpool team-mate Sadio Mane.",
      "publishedAt": "2026-01-13T15:57:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Barcelona bevestigt terugkeer Cancelo met vertraging",
      "link": "https://www.vi.nl/nieuws/barcelona-bevestigt-terugkeer-cancelo-met-vertraging",
      "summary": "João Cancelo is weer speler van Barcelona. De Portugese vleugelspeler kwam maandag met succes door de medische keuring, werd dinsdag officieel gepresenteerd waarna de club alle berichtgeving offline haalde en de persconferentie uitstelde. Maar de deal is met enige vertraging alsnog afgerond.",
      "publishedAt": "2026-01-13T15:51:32.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Benn 'in touching distance' of WBC title fight",
      "link": "https://www.skysports.com/boxing/news/12040/13493835/conor-benn-in-touching-distance-of-becoming-wbc-world-champion-title-fight-vs-ryan-garcia-or-mario-barrios-awaits",
      "summary": "Conor Benn believes he is within 'touching distance' of the WBC welterweight title, and is ready to fight the winner of Mario Barrios against Ryan Garcia.",
      "publishedAt": "2026-01-13T15:37:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Manchester United, crowd-pleasing nostalgia and failing to learn lessons of Seinfeld",
      "link": "https://www.theguardian.com/football/2026/jan/13/manchester-united-crowd-pleasing-nostalgia-michael-carrick-seinfeld",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! In the Seinfeld episode The Opposite, serial loser George Costanza realises his life is a monument to bad choices, his every impulse is wrong and his gut instinct is not to be trusted. Instead, he decides to do the “opposite” of whatever the little George inside him suggests and within days has landed himself a stunning girlfriend, been offered the job of his dreams and moved out of his parents’ house. While the makers of Seinfeld have always insisted that there are no lessons to be learned from their sitcom, George’s decision to override his brain suggests that if your current instincts and habits aren’t getting you the results you want, doing the opposite might well be the only logical path to success. While Football Daily has no wish to go all High Performance on our readers’ collective @ss, this episode of Seinfeld kept springing to mind as we have tried to make sense of Manchester United’s managerial succession plan (or apparent lack thereof) following the dismissal of Ruben Amorim. As we approach the 10th anniversary of the best thing ever to happen in football, this Leicester City fan notes that we are currently in a bigger hole than we were round about 2014, when this wild ride started. If, back then, you’d offered me a Faustian pact – the league title, followed by ignominy – I’d have snatched your hand off. I offer this by way of consolation to Crystal Palace fans, who I have always kind of liked for the fantastic atmosphere they generate at Selhurst. If you were offered this 12 months ago, you’d have taken it – it’s better than a pair of fifth-round exits. The pain will pass, but you will always have the memory of that glorious day at Wembley” – Gumley Slats. Thanks for providing the name of the photographer beneath the picture of the Rooneys’ interview at Macclesfield (yesterday’s Football Daily). Now we know who shot JR” – Dan Westacott. Continue reading...",
      "publishedAt": "2026-01-13T15:35:03.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Nunnely maakt transfer binnen Griekenland, 'Italiaanse stoelendans om Raspadori'",
      "link": "https://www.vi.nl/nieuws/nunnely-maakt-transfer-binnen-griekenland-italiaanse-stoelendans-om-raspadori",
      "summary": "De tijd van winterse versterkingen is aangebroken, in dit blog volgen we alle transferactiviteit in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-13T15:16:20.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Marokko leeft toe naar 'een van de belangrijkste wedstrijden ooit'",
      "link": "https://www.vi.nl/nieuws/marokko-leeft-toe-naar-een-van-de-belangrijkste-wedstrijden-ooit",
      "summary": "Marokko staat na 22 jaar weer in de halve finale van de Afrika Cup en maakt zich op voor 'een van de belangrijkste wedstrijden uit de geschiedenis'. Dat zei bondscoach Walid Regragui daags voor het duel met Nigeria. De Leeuwen van de Atlas nemen alleen genoegen met de eindzege op het toernooi. 'We staan nu waar we horen.'",
      "publishedAt": "2026-01-13T15:11:24.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Broad: Current England squad do not have drinking culture",
      "link": "https://www.skysports.com/cricket/news/12040/13493813/stuart-broad-current-england-squad-under-ben-stokes-brendon-mccullum-do-not-have-drinking-culture",
      "summary": "Former England bowler Stuart Broad says he believes England \"do not have a drinking culture,\" despite a number of high-profile incidents during the side's 4-1 Ashes defeat to Australia this winter.",
      "publishedAt": "2026-01-13T15:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Predicting the Premier League table: How will all 20 teams finish the season?",
      "link": "https://www.espn.com/soccer/story/_/id/47591334/predicting-premier-league-table-how-all-20-teams-finish-season",
      "summary": "Who will win the Premier League and who will be relegated? It's time to predict how the second half of the season finishes.",
      "publishedAt": "2026-01-13T15:05:50.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Klopp a candidate for Real Madrid head coach role",
      "link": "https://www.skysports.com/football/news/12040/13493731/jurgen-klopp-to-real-madrid-former-liverpool-manager-a-candidate-for-head-coach-role-at-laliga-club",
      "summary": "Jurgen Klopp is a candidate for the head coach position at Real Madrid should the club decide to appoint a new boss in the summer.",
      "publishedAt": "2026-01-13T12:55:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Mané v Salah: veteran superstars dominate buildup to Senegal v Egypt Afcon semi",
      "link": "https://www.theguardian.com/football/2026/jan/13/sadio-mane-mohamed-salah-egypt-senegal-afcon-semi-final",
      "summary": "Former Liverpool teammates meet for the fifth time in international football, with Salah still waiting for meaningful victory The Olembe Stadium, Yaoundé, 6 February 2022, the Africa Cup of Nations final. Senegal and Egypt drew 0-0. Penalties followed. The first three kicks were scored, then Egypt’s Mohamed Abdelmonem hit the post. Mohamed Abou Gabal immediately saved from Bouna Sarr but Eduard Mendy saved the fourth Egyptian effort, from Mohanad Lasheen. After four penalties each, Senegal led 3-2; Sadio Mané had the chance to win it. Mané had missed a fifth-minute penalty in the game. He’d missed a penalty against Cameroon in the shootout after the quarter-final in Franceville in 2017. “I can’t explain how tough it was for me,” Mané said. “I was sleeping four or five hours a night, five hours maximum. I had a big pressure in my head. I would go to bed and wake up maybe at 4am and I could not sleep any more … Everybody knew I was obsessed about this tournament and wanted to win it with my country … Thinking about this penalty I can say it was one of the hardest things in my life.” Continue reading...",
      "publishedAt": "2026-01-13T11:56:43.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘A clear injustice’: PSG Women rail over points deduction in season of pain",
      "link": "https://www.theguardian.com/football/2026/jan/13/a-clear-injustice-psg-women-rail-over-points-deduction-in-season-of-pain",
      "summary": "Club furious after being sanctioned for paperwork error regarding Canada international Florianne Jourde Paris Saint-Germain have lost only one league game all season yet are still only fifth in the Première Ligue. How is that possible? On Monday 22 December, just after the final league game of 2025, the French Football Federation issued a bombshell statement: three of PSG’s wins this season had been turned into defeats (0-3) because of a licensing issue regarding the Canada international Florianne Jourde. Continue reading...",
      "publishedAt": "2026-01-13T11:35:06.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Michael Carrick adds Steve Holland and Woodgate to staff at Manchester United",
      "link": "https://www.theguardian.com/football/2026/jan/13/michael-carrick-manchester-united-interim-head-coach-steve-holland-jonathan-woodgate",
      "summary": "Carrick to be confirmed as interim manager on Tuesday Darren Fletcher returns to job with United’s under-18s Michael Carrick has handed Steve Holland and Jonathan Woodgate roles on his staff at Manchester United. Carrick will be confirmed on Tuesday as the club’s interim manager until the end of the season and four spots on his backroom team have been filled. Holland was the assistant to Gareth Southgate with England and more recently the manager of the Japanese club Yokohama F Marinos, who sacked him last April. Woodgate coached alongside Carrick at Middlesbrough and had a spell there and at Bournemouth as manager. Retained on the staff after working with Darren Fletcher are Travis Binnion, who was promoted from his role as under-21s lead coach, and Jonny Evans. Continue reading...",
      "publishedAt": "2026-01-13T10:59:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "David Squires on … the magic of the Cup as Macclesfield dethrone Crystal Palace",
      "link": "https://www.theguardian.com/football/picture/2026/jan/13/david-squires-on-the-magic-of-the-cup-as-macclesfield-dethrone-crystal-palace",
      "summary": "Our cartoonist looks back on a glorious day for the non-league side as they knocked out the FA Cup holders Buy this cartoon | David’s favourite work of 2025 And his latest book, Chaos in the Box: get it now Continue reading...",
      "publishedAt": "2026-01-13T10:59:25.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Carrick to bring in Holland as Man Utd assistant",
      "link": "https://www.bbc.com/sport/football/articles/c0erq5gdvwqo?at_medium=RSS&at_campaign=rss",
      "summary": "Michael Carrick agrees to become Manchester United interim head coach - and former England assistant manager Steve Holland is set to be his number two.",
      "publishedAt": "2026-01-13T10:14:03.000Z"
    }
  ]
}