{
  "generatedAt": "2026-01-11T11:20:30.267Z",
  "items": [
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FA Cup third round buildup, Macclesfield magic, WSL and a big clash in Serie A – matchday live",
      "link": "https://www.theguardian.com/football/live/2026/jan/11/fa-cup-third-round-buildup-wsl-and-a-big-clash-in-serie-a-matchday-live",
      "summary": "⚽ All the latest ahead of Saturday’s football action ⚽ Link in here | Fixtures | Mail us Serie A: Let’s zoom in on the game of the day in Italy as Inter host Napoli at 7.45pm (GMT). These two teams have scooped up four of the last five scudetti between them – with two each – and their rivalry is now among Serie A’s hottest. Inter lead the way this season on 42 points but Napoli, in fourth, are only four points behind. Milan, Roma and Juventus will all think they still have a chance of competing for the title too. Inter and Napoli’s first meeting this season was certainly eventful. Kevin De Bruyne put Antonio Conte’s side ahead from the penalty spot but tore his hamstring in the process. Scott McTominay’s second-half strike was a beauty and set Napoli on their way to a 3-1 win. Can they repeat the feat at San Siro tonight? Continue reading...",
      "publishedAt": "2026-01-11T11:15:18.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Derby v Leeds United: FA Cup third round – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/11/derby-v-leeds-united-fa-cup-third-round-live",
      "summary": "⚽ Updates from the FA Cup tie (midday GMT) ⚽ Live scores | Sign up for Football Daily | Email Billy The teams are in from Pride Park: Derby (4-4-1-1): Zetterström; Ward, Langås, Batth, Forsyth; Brereton Díaz, Travis, Fraulo, Blackett-Taylor; Clark; Salvesen Subs: O’Donnell, Agyemang, Brewster, Weimann, Ozoh, Elder, Adams, Nelson, Eames. Continue reading...",
      "publishedAt": "2026-01-11T11:12:28.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Manchester City v Everton, Chelsea v West Ham and more: WSL clockwatch – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/11/manchester-city-v-everton-chelsea-v-west-ham-and-more-wsl-clockwatch-live",
      "summary": "⚽ Women’s Super League updates as the goals go in ⚽ Live scores | Get in touch! Email Emillia here Chelsea starting line-up: Hampton, Carpenter, Bright, Buurman, Girma, Baltimore, Nüsken, Cuthbert, Kaneryd, Thompson, James. Substitutes: Spencer, Peng, Reiten, Kaptein, Kerr, Bronze, Potter, Sarwie, Shooter. Chelsea v West Ham Tottenham v Leicester City Aston Villa v Brighton Manchester City v Everton Liverpool v London City Lionesses (2:30pm GMT) Continue reading...",
      "publishedAt": "2026-01-11T11:11:13.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Veelzijdige Hato geprezen: 'Greep deze kans met beide handen aan'",
      "link": "https://www.vi.nl/nieuws/veelzijdige-hato-geprezen-greep-deze-kans-met-beide-handen-aan",
      "summary": "Jorrel Hato is weliswaar een (aanvallende) verdediger, maar hij gaat toch echt de boeken in als eerste Chelsea-doelpuntenmaker onder de nieuwe manager Liam Rosenior. De Oranje-international werd geprezen door zijn coach en de media.",
      "publishedAt": "2026-01-11T11:11:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Feyenoord hoopt tegen Heerenveen slechte reeks te beëindigen",
      "link": "https://www.vi.nl/nieuws/vi-live-feyenoord-hoopt-tegen-heerenveen-slechte-reeks-te-be-indigen",
      "summary": "Welkom in deze VI Live met aandacht voor SC Heerenveen - Feyenoord. Om 12.15 uur is de aftrap in het Abe Lenstra Stadion. Via deze VI Live houden we je op de hoogte van het duel in speelronde 18 van de Eredivisie.",
      "publishedAt": "2026-01-11T11:08:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Van Persie blij met uitschakeling Algerije en houding Steijn",
      "link": "https://www.vi.nl/nieuws/van-persie-blij-met-uitschakeling-algerije-en-houding-steijn",
      "summary": "Robin van Persie is tevreden over hoe Sem Steijn is omgegaan met de aanvoerderskwestie bij Feyenoord. Steijn raakte zijn aanvoerdersband kwijt aan doelman Timon Wellenreuther. De middenvelder gaat echter niet bij de pakken neerzitten.",
      "publishedAt": "2026-01-11T11:07:13.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "FREE WSL STREAMS: Chelsea vs West Ham, Spurs vs Leicester and Aston Villa vs Brighton",
      "link": "https://www.skysports.com/football/news/12040/13492632/wsl-free-streams-watch-chelsea-vs-west-ham-tottenham-hotspur-vs-leicester-city-and-aston-villa-vs-brighton",
      "summary": "",
      "publishedAt": "2026-01-11T10:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Noppert 'duurste derde keeper' van Nederland: 'Ik zou helemaal gek worden'",
      "link": "https://www.vi.nl/nieuws/noppert-duurste-derde-keeper-van-nederland-hij-moet-weg-daar",
      "summary": "De situatie van Andries Noppert is schrijnend. In 2022 was hij nog de doelman van het Nederlands elftal op het WK in Qatar, nu is hij derde keeper bij SC Heerenveen. Zijn zaakwaarnemer Henk Timmer vindt dat de Toren van Joure beter kan vertrekken.",
      "publishedAt": "2026-01-11T10:45:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Supercopa Clasico preview, predictions: Are Barcelona favorites vs. Real Madrid?",
      "link": "https://www.espn.com/soccer/story/_/id/47568270/barcelona-favorites-vs-real-madrid",
      "summary": "Barcelona and Real Madrid meet in the Supercopa final Sunday, but who has the upper hand? Sam Marsden and Alex Kirkland preview the upcoming Clasico.",
      "publishedAt": "2026-01-11T10:34:40.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Opstelling Feyenoord: zo lost Van Persie schorsing Valente op",
      "link": "https://www.vi.nl/nieuws/opstelling-feyenoord-zo-lost-van-persie-schorsing-valente-op",
      "summary": "Robin van Persie heeft zijn eerste Feyenoord-opstelling van 2026 uit de doeken gedaan. Feyenoord neemt het zondag om 12.15 uur op tegen SC Heerenveen. Van Persie heeft flink moeten puzzelen.",
      "publishedAt": "2026-01-11T10:01:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sabalenka goes back-to-back in Brisbane after not dropping set all week",
      "link": "https://www.skysports.com/tennis/news/12040/13492988/aryna-sabalenka-retains-brisbane-international-title-after-not-dropping-set-all-week-as-world-no-1-prepares-for-australian-open",
      "summary": "World No 1 Aryna Sabalenka captured back-to-back Brisbane International titles as she avoided becoming Marta Kostyuk's latest top-10 scalp in Sunday's final.",
      "publishedAt": "2026-01-11T08:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘I’ve never celebrated a goal at 9-0 down in my life’: inside Exeter’s dressing room on a day to remember",
      "link": "https://www.theguardian.com/football/2026/jan/11/exeter-city-gary-caldwell-manchester-city-10-1-fa-cup",
      "summary": "League One club offered behind-the-scenes access for FA Cup tie and manager Gary Caldwell will not let crushing loss at Manchester City define them “The team to win today, lads” begins Gary Caldwell. Exeter City are two hours from kicking off against Manchester City in the FA Cup third round, and their manager is addressing his players at a hotel shortly before they travel to the Etihad. “You know why I said that?” he continues, his thick Scottish accent filling the room. No one knows. He explains the phrase is borrowed from Roberto Martínez, under whom Caldwell won the competition with Wigan in 2013. It was used to bring humour and break tension when his team were inevitably written off. Continue reading...",
      "publishedAt": "2026-01-11T08:00:21.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah inspires Egypt with energy recalling golden generation to evoke recent history | Jonathan Wilson",
      "link": "https://www.theguardian.com/football/2026/jan/11/egypt-mohamed-salah-africa-cup-of-nations-football",
      "summary": "Liverpool forward will face his former teammate Sadio Mané in Afcon semi against Senegal after arguably the Pharaohs’ best performance since 2008 It is a long time since Egypt had a night this good. There have been two World Cup qualifications since their golden age of three successive Cups of Nations came to an end in 2010, and they’ve got to the finals of two Cups of Nations since, but this had a different feel to the knockout phases in 2017 or 2021 (played in 2022). This wasn’t grinding through, doing just enough (across the knockouts in 2017 and 2021, Egypt won one game without needing extra time or penalties; a grim 1-0 against Morocco in the 2017 quarter-final). It was taking on one of the giants of African football and beating them well. A 3-2 victory over Côte d’Ivoire was probably Egypt’s best single performance since they beat the same opposition 4-1 in the semi-finals of Ghana 2008. That game in Kumasi was always going to cast its shadow over this quarter-final. Saturday’s coaches were on opposite sides when Egypt beat Côte d’Ivoire on penalties in the 2006 final in Cairo – Hossam Hassan as a 39-year-old squad captain and unused sub and Émerse Faé in the centre of midfield – but it was the semi-final two years later this game most resembled. The 4-1 hurt Côte d’Ivoire far more than the final had, the image of a bewildered Kolo Touré running away from Amr Zaki as he scored Egypt’s third a symbol of the Pharaohs’ superiority that night. Within four minutes on Saturday, Odilon Kossounou had got in a similar mess, legs tangled as Omar Marmoush sped by him to put Egypt ahead. Continue reading...",
      "publishedAt": "2026-01-11T08:00:21.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bears stun Packers with incredible fourth-quarter comeback!",
      "link": "https://www.skysports.com/watch/video/13492973/nfl-green-by-packers-chicago-bears-wild-card-weekend-highlights",
      "summary": "Highlights from the Wild Card Weekend matchup between the Green Bay Packers and the Chicago Bears during the 2025 NFL season.",
      "publishedAt": "2026-01-11T07:14:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Legendary Luke bids to enhance his reputation at Fontwell",
      "link": "https://www.skysports.com/racing/news/12040/13492547/today-on-sky-sports-racing-fontwell-and-sha-tin",
      "summary": "We have jumps action to enjoy from Fontwell on Sunday afternoon, live on Sky Sports Racing...",
      "publishedAt": "2026-01-11T07:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rams score in final minute to beat Panthers in NFL playoffs",
      "link": "https://www.skysports.com/nfl/news/12040/13492961/nfl-playoffs-los-angeles-rams-hold-on-to-beat-carolina-panthers-after-matthew-staffords-touchdown-pass-to-colby-parkinson-in-final-minute",
      "summary": "Colby Parkinson's touchdown with 38 seconds to play silenced the Carolina Panthers crowd as the Los Angeles Rams escaped with a 34-31 victory to advance to the Divisional Round of the NFL playoffs on Saturday.",
      "publishedAt": "2026-01-11T00:59:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "USMNT's Pepi suffers broken arm scoring for PSV",
      "link": "https://www.espn.com/soccer/story/_/id/47573639/usmnt-ricardo-pepi-broken-arm-psv-eindhoven-goal",
      "summary": "United States striker Ricardo Pepi suffered a broken forearm while in action for PSV Eindhoven on Saturday and and is set to be sidelined for two months, the Dutch club has confirmed..",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Buoyant Rosenior lauds 5-star Chelsea start",
      "link": "https://www.espn.com/soccer/story/_/id/47574761/liam-rosenior-chelsea-squad-charlton-fa-cup",
      "summary": "New Chelsea head coach Liam Rosenior promised more to come from his second string after they swept aside Charlton 5-1 at the Valley in his first match in charge.",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Fletcher 'prepared' to lead Man Utd until summer",
      "link": "https://www.espn.com/soccer/story/_/id/47572566/darren-fletcher-man-united-manager-interim-season",
      "summary": "Darren Fletcher has said he's \"prepared\" if Manchester United decide to hand him the head coach job until the end of the season.",
      "publishedAt": "2026-01-11T00:15:01.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Salah scores to set up AFCON reunion with Mané",
      "link": "https://www.espn.com/espn/story/_/id/47573488/salah-fires-egypt-afcon-champions-ivory-coast-set-mane-senegal-reunion-semifinal",
      "summary": "Mohamed Salah scored his fourth goal of the Africa Cup of Nations as Egypt defeated defending champions Ivory Coast 3-2 in Agadir.",
      "publishedAt": "2026-01-11T00:15:00.000Z"
    }
  ]
}