{
  "generatedAt": "2026-01-05T11:23:23.843Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Feyenoord hervat trainingskamp in Marbella: Moder ontbreekt nog",
      "link": "https://www.vi.nl/nieuws/feyenoord-hervat-trainingskamp-in-marbella-moder-ontbreekt-nog",
      "summary": "Na een aantal flinke hoosbuien die zondag roet in het trainingsschema van Feyenoord gooiden, is de lucht opgeklaard in Marbella. Maandagochtend kon de ploeg van Robin van Persie eindelijk weer het veld op om het trainingskamp in Spanje te hervatten. Alleen Jakub Moder ontbrak.",
      "publishedAt": "2026-01-05T11:22:34.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim tells Man Utd bosses: 'Do your jobs'",
      "link": "https://www.espn.com/soccer/story/_/id/47501012/ruben-amorim-hints-man-united-power-struggle-manager-not-coach",
      "summary": "Ruben Amorim has raised doubts over his future at Manchester United by saying he wants to be the \"manager, not the coach.\"",
      "publishedAt": "2026-01-05T11:16:01.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Amorim heeft slechtste score op het trainerskerkhof van Man Utd",
      "link": "https://www.vi.nl/nieuws/amorim-heeft-slechtste-score-op-het-trainerskerkhof-van-man-utd",
      "summary": "Het ontslag van manager Rúben Amorim bij Manchester United komt gezien de prestaties niet uit de lucht vallen. De Portugees presteert van alle aangestelde hoofdcoaches veruit het slechtste sinds het vertrek van Sir Alex Ferguson.",
      "publishedAt": "2026-01-05T11:11:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ruben Amorim sacked by Manchester United – live updates",
      "link": "https://www.theguardian.com/football/live/2026/jan/05/ruben-amorim-sacked-by-manchester-united-live-updates",
      "summary": "Amorim sacked after losing power struggle over transfers Darren Fletcher to take charge for game at Burnley Have any thoughts? Send them to Dom via email Ruben Amorim’s exit brings to mind the disparate cast of Manchester United managers post-Sir Alex Ferguson. The club have endured some major troughs in the past 12-and-a-half years, with the odd fleeting peak. Where does Amorim rank? Towards the bottom of the list no doubt, but how low? Not discounting caretakers or interims (Ryan Giggs, Michael Carrick, Ruud van Nistelrooy and now Darren Fletcher have all held that role since 2013) United have had seven managers since Ferguson’s retirement. Ralf Rangnick was an interim but since he was afforded a fair chunk of games, we will include the German. Continue reading...",
      "publishedAt": "2026-01-05T11:09:45.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Heerenveen troeft Hollywood-club Wrexham af en haalt nieuwe spits",
      "link": "https://www.vi.nl/nieuws/heerenveen-troeft-hollywood-club-wrexham-af-en-haalt-nieuwe-spits",
      "summary": "Lasse Nordas komt naar de Eredivisie toe. SC Heerenveen gaat de 23-jarige spits voor een halfjaar huren van het Engelse Luton Town. Hiermee spelen de Friezen alvast in op een naderend vertrek van Václav Sejk.",
      "publishedAt": "2026-01-05T11:07:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Ruben Amorim sacked as Man United head coach",
      "link": "https://www.espn.com/soccer/story/_/id/46418438/ruben-amorim-sacked-manchester-united-head-coach",
      "summary": "Manchester United have sacked Ruben Amorim less than 24 hours after he held a stunning news conference following the 1-1 draw with Leeds United in which he urged club bosses to \"do your jobs.\"",
      "publishedAt": "2026-01-05T11:06:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Manchester United laat Fletcher mogelijk seizoen afmaken'",
      "link": "https://www.vi.nl/nieuws/manchester-united-laat-fletcher-mogelijk-seizoen-afmaken",
      "summary": "Darren Fletcher moet Manchester United in rustiger vaarwater zien te krijgen. De 42-jarige clubicoon heeft officieel de Onder-18 onder zijn hoede, maar is tijdelijk gepromoveerd tot interim vanwege het ontslag van Rúben Amorim. Mogelijk maakt Fletcher zelfs het seizoen af.",
      "publishedAt": "2026-01-05T11:05:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Dick Schreuder levert bij NEC spektakel én heel veel punten",
      "link": "https://www.vi.nl/pro/dick-schreuder-levert-bij-nec-spektakel-n-heel-veel-punten",
      "summary": "Na een relatief korte winterstop gaat vrijdag de Eredivisie weer verder. Tot diep in maart is er elk weekeinde een speelronde. Met andere woorden: het cruciale deel van het seizoen gaat beginnen. In deze serie maken we bij elke club de balans op, waarbij we wat betreft de volgorde uitgaan van de eerste speelronde van 2026. Deze keer: NEC.",
      "publishedAt": "2026-01-05T11:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Bayern wonderkid Karl reveals Real Madrid dream",
      "link": "https://www.espn.com/soccer/story/_/id/47511286/bayern-munich-wonderkid-lennart-karl-reveals-real-madrid-ambitions",
      "summary": "Bayern Munich wonderkid Lennart Karl has revealed that we \"definitely\" wants to play for Real Madrid at some point in his career, calling the Spanish giants his \"dream club.\"",
      "publishedAt": "2026-01-05T10:36:15.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Real Madrid join Wharton race - Monday's gossip",
      "link": "https://www.bbc.com/sport/football/articles/cx2yn878zxyo?at_medium=RSS&at_campaign=rss",
      "summary": "Adam Wharton emerges as a target for Real Madrid, Crystal Palace are assessing several options, AC Milan are keeping tabs on Nathan Ake, plus more.",
      "publishedAt": "2026-01-05T10:36:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior in London, close to Chelsea job",
      "link": "https://www.espn.com/soccer/story/_/id/47503955/liam-rosenior-arrives-london-edges-chelsea-job-enzo-maresca",
      "summary": "Chelsea are moving closer to the appointment of Liam Rosenior as their new head coach after the 41-year-old arrived in London on Sunday, sources have told ESPN.",
      "publishedAt": "2026-01-05T10:21:23.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "City injuries worry Pep: Gvardiol 'doesn't look good'",
      "link": "https://www.espn.com/soccer/story/_/id/47504035/manchester-city-injuries-concerning-pep",
      "summary": "Pep Guardiola said he has \"concerns\" after a number of defenders suffered injuries in a 1-1 draw with Chelsea in the Premier League on Sunday.",
      "publishedAt": "2026-01-05T10:21:23.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Hard working but had to go' - Our writers' verdict on what went wrong for Amorim",
      "link": "https://www.skysports.com/football/news/12040/13442753/ruben-amorim-sacked-what-went-wrong-at-man-utd-for-hard-working-head-coach-after-club-confirm-old-trafford-exit",
      "summary": "Sky Sports' writers give their assessment of what went wrong for Ruben Amorim at Manchester United after the club confirmed the Portuguese would be departing his role after 14 months in charge at Old Trafford.",
      "publishedAt": "2026-01-05T10:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim sacked by Man Utd after 14 months in charge",
      "link": "https://www.bbc.com/sport/football/articles/cvg48wdmx24o?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United sack manager Ruben Amorim after he criticised the club's hierarchy following Sunday's 1-1 draw at Leeds.",
      "publishedAt": "2026-01-05T10:18:35.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ruben Amorim sacked by Manchester United after losing power struggle over transfers",
      "link": "https://www.theguardian.com/football/2026/jan/05/ruben-amorim-sacked-by-manchester-united-transfers-power-struggle",
      "summary": "Head coach goes after outburst at Leeds game He oversaw worst Premier League finish of 15th Live reaction and updates after Amorim sacked Ruben Amorim has been sacked by Manchester United after 14 months as their head coach. The Portuguese departs after a power struggle with the hierarchy over transfer policy, with Amorim demanding his colleagues in the recruitment department “do their job” after Sunday’s draw at Leeds. Amorim believed United were prepared to back him in the January window should a major signing become available but then said last Friday: “We have no conversation to have any change in the squad.” Continue reading...",
      "publishedAt": "2026-01-05T10:12:26.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leicester poised to sign full-back Ashleigh Neville from Tottenham",
      "link": "https://www.theguardian.com/football/2026/jan/05/leicester-ashleigh-neville-tottenham-wsl-transfers",
      "summary": "Spurs sign Julie Blakstad after bringing in Hanna Wijk Arsenal sign Sweden right-back Smilla Holmberg Leicester are poised to sign the experienced full-back Ashleigh Neville from their fellow Women’s Super League club Tottenham, the Guardian understands, after the north London club completed deals for Julie Blakstad and Hanna Wijk. According to sources, an agreement has been reached for Neville’s move. Tottenham on Monday announced the signing of the Norway international Blakstad on as free transfer, after her contract expired at Hammarby. The 24-year-old former Manchester City player can operate as a winger, wing-back or left-back. Neville is Tottenham’s longest-serving player, having been with the club for eight and a half years, and has been a core part of their side since promotion to the second tier in 2017. A fans’ favourite, she became in February 2025 the first player to make 100 WSL appearances for Tottenham and was a key part of the side that reached the club’s first Women’s FA Cup final in 2024. Neville’s switch to Rick Passmoor’s Leicester is expected to bring regular starting opportunities after Tottenham also signed the Sweden full-back Wijk. The 22-year-old Wijk can, like Neville, play at left-back or right-back and Tottenham are evolving their squad. Leicester are understood to be targeting players with more WSL experience, having often had the youngest average age in the division in their starting side this season. Continue reading...",
      "publishedAt": "2026-01-05T10:03:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim sacked by Man Utd with Fletcher in interim charge",
      "link": "https://www.skysports.com/football/news/12040/13490609/ruben-amorim-sacked-manchester-united-dismiss-head-coach-after-14-months-in-charge",
      "summary": "Manchester United have sacked head coach Ruben Amorim.",
      "publishedAt": "2026-01-05T10:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Britain's Jones claims biggest win of career over Navarro",
      "link": "https://www.skysports.com/tennis/news/12040/13490623/fran-jones-british-no-3-tennis-player-beats-emma-navarro-at-asb-classic-in-biggest-win-of-career",
      "summary": "Great Britain's Fran Jones claimed the biggest win of her career so far to defeat world No 15 Emma Navarro in the first round of the ASB Classic.",
      "publishedAt": "2026-01-05T08:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ref Watch: Why Wirtz goal was given onside by VAR...",
      "link": "https://www.skysports.com/football/live-blog/12040/13490617/ref-watch-live-premier-league-efl-and-scottish-premiership-incidents-analysed-by-dermot-gallagher-and-jay-bothroyd",
      "summary": "",
      "publishedAt": "2026-01-05T08:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Africa’s superpowers assemble for Cup of Nations knockout stages",
      "link": "https://www.theguardian.com/football/2026/jan/05/africas-superpowers-assemble-for-cup-of-nations-knockout-stages",
      "summary": "Cameroon and hosts Morocco could soon be joined by Nigeria and Egypt at the business end of the tournament For a decade or more, a familiar theme of Cups of Nations has been how the pyramid of African football has been growing little taller but much broader. African sides came no closer to really challenging at a World Cup, but the range of teams capable of beating the continent’s elite, of getting to the knockout stage of the Cup of Nations, was becoming more diverse. Perhaps, though, a new phase is beginning. It’s dangerous always to read too much into the performance of one side at one tournament, but in Qatar in 2022 Morocco at last broke through the quarter-final barrier and became the first African side to reach a World Cup semi-final. And now, in the Cup of Nations Morocco are hosting, the traditional powers are reasserting themselves. There is yet to be a real surprise in the tournament and, halfway through the round of 16, the prospect is of the highest-powered list of quarter-finalists in history. Continue reading...",
      "publishedAt": "2026-01-05T08:00:30.000Z"
    }
  ]
}