{
  "generatedAt": "2026-01-05T09:36:42.734Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Engelse media zien Reijnders opleven bij Man City: 'Hij fleurde het team op'",
      "link": "https://www.vi.nl/nieuws/engelse-media-zien-reijnders-opleven-bij-man-city-hij-fleurde-het-team-op",
      "summary": "Tijjani Reijnders heeft zich na een lastige fase herpakt bij Manchester City. De Nederlander maakte zondagavond zijn derde doelpunt in de laatste vier duels en leek daarmee ook de matchwinner te worden tegen Chelsea. Hoewel Man City de overwinning in the dying seconds alsnog uit handen gaf, deelden Engelse media na afloop genoeg complimenten uit aan Reijnders.",
      "publishedAt": "2026-01-05T09:25:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2026-01-05T09:21:29.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Telstar haalt Hatenboer terug naar Nederland",
      "link": "https://www.vi.nl/nieuws/telstar-haalt-hatenboer-terug-naar-nederland",
      "summary": "We zitten in het intermezzo tussen de zomer- en winterwindow, toch druppelt er in het najaar vaak nog een aantal transfers binnen. In dit blog vind je alle speculaties en bevestigde transfers in Nederland. Bekijk hier ons blog voor de transferperikelen in het buitenland.",
      "publishedAt": "2026-01-05T09:20:40.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Mourinho dringt aan op komst voormalig Ajax-spits Lucca'",
      "link": "https://www.vi.nl/nieuws/west-ham-united-legt-23-miljoen-euro-op-tafel-voor-nieuwe-spits",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-05T09:19:20.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "AZ werkt mee aan eventuele transfer van Sadiq",
      "link": "https://www.vi.nl/nieuws/az-werkt-mee-aan-eventuele-transfer-van-sadiq",
      "summary": "Met Jizz Hornkamp en Ayoub Oufkir legde AZ al twee nieuwe aanvallers vast in de winterperiode, Ibrahim Sadiq vertrekt mogelijk juist uit Alkmaar. De clubleiding staat open voor een afscheid van de rechtsbuiten.",
      "publishedAt": "2026-01-05T09:01:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leicester poised to sign full-back Ashleigh Neville from Tottenham",
      "link": "https://www.theguardian.com/football/2026/jan/05/leicester-ashleigh-neville-tottenham-wsl-transfers",
      "summary": "Spurs sign Julie Blakstad after bringing in Hanna Wijk Leicester keen to land experienced players this month Leicester are poised to sign the experienced full-back Ashleigh Neville from their fellow Women’s Super League club Tottenham, the Guardian understands, after the north London club completed deals for Julie Blakstad and Hanna Wijk. According to sources, an agreement has been reached for Neville’s move. Tottenham on Monday announced the signing of the Norway international Blakstad on as free transfer, after her contract expired at Hammarby. The 24-year-old former Manchester City player can operate as a winger, wing-back or left-back. Neville is Tottenham’s longest-serving player, having been with the club for eight and a half years, and has been a core part of their side since promotion to the second tier in 2017. A fans’ favourite, she became in February 2025 the first player to make 100 WSL appearances for Tottenham and was a key part of the side that reached the club’s first Women’s FA Cup final in 2024. Neville’s switch to Rick Passmoor’s Leicester is expected to bring regular starting opportunities after Tottenham also signed the Sweden full-back Wijk. The 22-year-old Wijk can, like Neville, play at left-back or right-back and Tottenham are evolving their squad. Leicester are understood to be targeting players with more WSL experience, having often had the youngest average age in the division in their starting side this season. Continue reading...",
      "publishedAt": "2026-01-05T09:00:28.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ref Watch LIVE! Why Wirtz goal was given onside by VAR...",
      "link": "https://www.skysports.com/football/live-blog/12040/13490617/ref-watch-live-premier-league-efl-and-scottish-premiership-incidents-analysed-by-dermot-gallagher-and-jay-bothroyd",
      "summary": "",
      "publishedAt": "2026-01-05T08:50:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League: 10 talking points from the weekend’s football",
      "link": "https://www.theguardian.com/football/2026/jan/05/premier-league-10-talking-points-from-the-weekends-football",
      "summary": "Nuno lets a golden opportunity slip, Viktor Gyökeres does everything but score and Benjamin Sesko struggles again Calum McFarlane’s unexpected battle with Pep Guardiola brought back memories of the 2021 League Cup final, when Ryan Mason, Tottenham’s 29-year-old interim coach, faced the significant task of trying to outsmart one of the greatest managers in the game’s history. For Mason there was the added baggage of Spurs’ 13-year trophy drought; for McFarlane, making his senior management debut, it was Chelsea’s astonishingly bad recent record against Manchester City. Four and a half years have passed since Chelsea last beat Guardiola’s side, when Thomas Tuchel’s team triumphed in the Champions League final, and a draw on Sunday took that winless run to 12 matches. But Enzo Fernández’s injury-time equaliser, combining with the midweek upheaval at Stamford Bridge, made it a triumphant point, something Enzo Maresca didn’t achieve against City during his tenure. Taha Hashim Match report: Manchester City 1-1 Chelsea Match report: Fulham 2-2 Liverpool Match report: Bournemouth 2-3 Arsenal Match report: Leeds 1-1 Manchester United Match report: Tottenham 1-1 Sunderland Continue reading...",
      "publishedAt": "2026-01-05T08:00:30.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Africa’s superpowers assemble for Cup of Nations knockout stages",
      "link": "https://www.theguardian.com/football/2026/jan/05/africas-superpowers-assemble-for-cup-of-nations-knockout-stages",
      "summary": "Cameroon and hosts Morocco could soon be joined by Nigeria and Egypt at the business end of the tournament For a decade or more, a familiar theme of Cups of Nations has been how the pyramid of African football has been growing little taller but much broader. African sides came no closer to really challenging at a World Cup, but the range of teams capable of beating the continent’s elite, of getting to the knockout stage of the Cup of Nations, was becoming more diverse. Perhaps, though, a new phase is beginning. It’s dangerous always to read too much into the performance of one side at one tournament, but in Qatar in 2022 Morocco at last broke through the quarter-final barrier and became the first African side to reach a World Cup semi-final. And now, in the Cup of Nations Morocco are hosting, the traditional powers are reasserting themselves. There is yet to be a real surprise in the tournament and, halfway through the round of 16, the prospect is of the highest-powered list of quarter-finalists in history. Continue reading...",
      "publishedAt": "2026-01-05T08:00:30.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I'm here to be manager, not coach' - but will Amorim survive at Man Utd?",
      "link": "https://www.bbc.com/sport/football/articles/c1m7lmnnev0o?at_medium=RSS&at_campaign=rss",
      "summary": "Ruben Amorim challenges Manchester United's board to let him do his job after Sunday's draw with Leeds, and says he intends to leave in 18 months' time.",
      "publishedAt": "2026-01-05T07:33:15.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior deserves Chelsea chance, says Rooney",
      "link": "https://www.bbc.com/sport/football/articles/cp87nmpk8eko?at_medium=RSS&at_campaign=rss",
      "summary": "Wayne Rooney says Liam Rosenior is as good a coach as he has worked with and deserves the chance to be Chelsea manager.",
      "publishedAt": "2026-01-05T06:09:31.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "NFL playoff picture: Jags, Panthers, Steelers win division titles",
      "link": "https://www.skysports.com/nfl/news/12040/13486008/2025-nfl-playoff-picture-afc-nfc-seedings-schedule-uk-times-and-how-to-watch-on-road-to-super-bowl-lx-at-levis-stadium-in-california",
      "summary": "Which teams have reached the 2025 NFL playoffs? We look at the standings on the road to Super Bowl LX in Santa Clara, California...",
      "publishedAt": "2026-01-05T01:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim’s Manchester United future in balance amid Wilcox transfer tension",
      "link": "https://www.theguardian.com/football/2026/jan/04/ruben-amorim-manchester-united-leeds-premier-league",
      "summary": "Coach believed club would back him in January window Amorim had cast doubt on long-term future at United Ruben Amorim’s future at Manchester United is in the balance, with the head coach’s strained relationship with the director of football, Jason Wilcox, a factor in what is viewed as an unpredictable situation at the club. Amorim believed United were prepared to back him in the January transfer window should a major signing become available but at the moment this has changed, causing him discontent. The 40-year-old is believed to have been informed of this on the authority of Wilcox, who reports to Omar Berrada, the chief executive. Continue reading...",
      "publishedAt": "2026-01-04T23:02:42.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim wants control at Man United, but his outburst could cost him his job",
      "link": "https://www.espn.com/soccer/story/_/id/47499896/amorim-wants-control-man-united-outburst-cost-job",
      "summary": "Manchester United manager Ruben Amorim is frustrated at not being able to choose his transfers himself. But by speaking out, he has put his job in danger.",
      "publishedAt": "2026-01-04T23:02:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "No Maresca, no problem? Chelsea's late draw at Man City a blow for Guardiola & Co.",
      "link": "https://www.espn.com/soccer/story/_/id/47502723/manchester-city-chelsea-premier-league-analysis-reaction-enzo-maresca-enzo-fernandez-calum-mcfarlane",
      "summary": "All signs pointed to a routine Man City win, yet Enzo Fernandez' late goal ensured Chelsea went home happy.",
      "publishedAt": "2026-01-04T23:02:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim hits out: I'm Utd manager, not the coach",
      "link": "https://www.espn.com/soccer/story/_/id/47501012/ruben-amorim-hints-man-united-power-struggle-manager-not-coach",
      "summary": "Ruben Amorim has raised doubts over his future at Manchester United by saying he wants to be the \"manager, not the coach.\"",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior in London, close to Chelsea job",
      "link": "https://www.espn.com/soccer/story/_/id/47503955/liam-rosenior-arrives-london-edges-chelsea-job-enzo-maresca",
      "summary": "Chelsea are moving closer to the appointment of Liam Rosenior as their new head coach after the 41-year-old arrived in London on Sunday, sources have told ESPN.",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "City injuries worry Pep: Gvardiol 'doesn't look good'",
      "link": "https://www.espn.com/soccer/story/_/id/47504035/manchester-city-injuries-concerning-pep",
      "summary": "Pep Guardiola said he has \"concerns\" after a number of defenders suffered injuries in a 1-1 draw with Chelsea in the Premier League on Sunday.",
      "publishedAt": "2026-01-04T22:26:03.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'I don't have a crystal ball' - damaging few days for Man City?",
      "link": "https://www.bbc.com/sport/football/articles/cn9zgd3dqj5o?at_medium=RSS&at_campaign=rss",
      "summary": "Chelsea's stoppage-time equaliser against Manchester City on a freezing Sunday evening at Etihad Stadium felt a monumental moment in the Premier League title race.",
      "publishedAt": "2026-01-04T21:55:35.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liam Rosenior arrives in London to discuss taking over as Chelsea manager",
      "link": "https://www.theguardian.com/football/2026/jan/04/liam-rosenior-arrives-in-london-to-discuss-taking-over-as-chelsea-manager",
      "summary": "Strasbourg manager, 41, to have talks on Monday He could be in place before Wednesday’s game at Fulham Chelsea are closing in on the appointment of Liam Rosenior after the Strasbourg manager flew to London to hold talks over the role. The 41-year-old is due to meet with the west London club on Monday and it is expected that discussions will end with him agreeing to replace Enzo Maresca, who left Stamford Bridge in acrimonious circumstances earlier this. Continue reading...",
      "publishedAt": "2026-01-04T21:27:02.000Z"
    }
  ]
}