{
  "generatedAt": "2025-12-27T15:22:23.940Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Ødegaard helpt Arsenal virtueel terug aan kop, Liverpool tegen Wolves",
      "link": "https://www.vi.nl/nieuws/vi-live-liverpool-met-frimpong-en-chiesa-timber-ontbreekt-bij-arsenal",
      "summary": "Goedendag en welkom in de VI Live van zaterdag 27 december. Hopelijk had u een fijne kerstperiode, en bent u klaar voor een fraaie dag vol voetbal. In dit blog hoeft u niks te missen van mooie affiches in onder meer Italië, Engeland en Marokko.",
      "publishedAt": "2025-12-27T15:15:52.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Tranen op Anfield: zoontjes van Jota lopen bij Liverpool - Wolves het veld op",
      "link": "https://www.vi.nl/nieuws/ranen-op-anfield-zoontjes-van-jota-lopen-bij-liverpool-wolves-het-veld-op",
      "summary": "De emoties zijn voor het begin van de wedstrijd tussen Liverpool en Wolverhampton Wanderers, twee van de voormalige clubs van de overleden Diogo Jota, hoog opgelopen. Dat de twee zoons van de op 28-jarige leeftijd overleden Portugees met de spelers het veld opkwamen, zorgde voor tranen en kippenvel op Anfield.",
      "publishedAt": "2025-12-27T15:13:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Arsenal v Brighton, Liverpool v Wolves, Senegal v DR Congo, and more – football live",
      "link": "https://www.theguardian.com/football/live/2025/dec/27/arsenal-v-brighton-liverpool-v-wolves-senegal-v-dr-congo-and-more-football-live",
      "summary": "⚽ Updates from the afternoon’s football action ⚽ Live scores | Tables | Follow us on Bluesky | Mail Scott In Scotland, Hearts are making a go of things in the derby at Easter Road. Lawrence Shankland pulled one back on 75 minutes. That seemed no more than a consolation, but Cammy Devlin has made it 3-2 on 89 minutes, and there will be six additional minutes. Is an absurd comeback on? Senegal: Edouard Mendy, Diatta, Koulibaly, Niakhate, Jakobs, Idrissa Gueye, Pape Gueye, Ismaila Sarr, Iliman Ndiaye, Mane, Jackson. Subs: Diaw, Lamine Camara, Ciss, Dia, Diallo, Diarra, El Hadji Diouf, Yehvann Diouf, Mbaye, Antoine Mendy, Cherif Ndiaye, Sabaly, Pape Sarr, Mamadou Sarr, Seck. Continue reading...",
      "publishedAt": "2025-12-27T15:11:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Hibernian cling on to defeat league leaders Hearts in pulsating derby",
      "link": "https://www.theguardian.com/football/2025/dec/27/scottish-premiership-hibernian-hearts-celtic-rangers",
      "summary": "Raphael Sallinger made two crucial stoppage-time saves as Hibernian held off a late fightback from Hearts to defeat the Scottish Premiership leaders 3-2 in the Edinburgh derby at Easter Road. Hibs were three up and seemingly coasting early in the second half after Kieron Bowie added to first-half goals from Jamie McGrath and the substitute Josh Campbell. But Hearts hit back through Lawrence Shankland and Cammy Devlin, setting up a grandstand finale in which Shankland and Beni Baningime were denied by Sallinger, as Derek McInnes’s side suffered only their second league defeat of the season. This story will be updated Continue reading...",
      "publishedAt": "2025-12-27T15:09:59.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Janssen en Kerk helpen Oosting aan weer een zege",
      "link": "https://www.vi.nl/nieuws/janssen-en-kerk-helpen-oosting-aan-weer-een-zege",
      "summary": "Joseph Oosting heeft voor de derde keer in vier competitiewedstrijden gewonnen als trainer van Antwerp FC. De ploeg van de Nederlandse coach kwam zaterdagmiddag tegen Zulte-Waregem terug van een achterstand. Vincent Janssen en Gyrano Kerk waren allebei trefzeker.",
      "publishedAt": "2025-12-27T15:05:47.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Afcon 2025: First tournament win for Benin keeps hope of progress alive",
      "link": "https://www.theguardian.com/football/2025/dec/27/afcon-2025-first-tournament-win-for-benin-keeps-hope-of-progress-alive",
      "summary": "Yohan Roche scores only goal in first half Botswana out after second group loss Benin kept alive their hopes of staying in the Africa Cup of Nations with a 1-0 victory over Botswana in Rabat in Group D. It ended a run of 15 games – five draws and 10 defeats – without a win in the competition. Two minutes before the half-hour mark Yohan Roche’s shot from inside the area was deflected in. Botswana hit the bar through Mothusi Johnson but they were unable to avoid a second successive defeat and are now out of the competition. This story will be updated Continue reading...",
      "publishedAt": "2025-12-27T15:04:15.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Reijnders plukt vruchten van tactische zet Guardiola: 'Hij is erg intens'",
      "link": "https://www.vi.nl/nieuws/reijnders-plukt-vruchten-van-tactische-zet-guardiola-hij-is-erg-intens",
      "summary": "Erling Haaland heeft zaterdag zijn twintigste Premier League-doelpunt van dit seizoen gemaakt. De Noorse aanvaller was trefzeker voor Manchester City in het uitduel met Nottingham Forest. Slechts één keer eerder gebeurde het dat een speler twintig Premier League-goals voor de jaarwisseling maakte.",
      "publishedAt": "2025-12-27T14:58:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rayan Cherki grabs Manchester City winner to deny bold Nottingham Forest",
      "link": "https://www.theguardian.com/football/2025/dec/27/nottingham-forest-manchester-city-premier-league-match-report",
      "summary": "Judging by the way Gianluigi Donnarumma celebrated Rayan Cherki’s late winner at Nottingham Forest, this was a significant victory for Manchester City. Donnarumma hurtled towards the bench where Pep Guardiola was being mobbed by his coaching staff, including Kolo Touré, Pep Lijnders and the set-piece coach James French, seemingly the architect behind Phil Foden’s corner that led to the goal. Cherki smacked a right-foot effort through the legs of Morgan Gibbs-White and into the corner of the Forest goal, to put City ahead of Arsenal for a couple of hours at least. Earlier, Forest’s Omari Hutchinson had cancelled out Tijjani Reijnders’ second-half opener. Guardiola had warned his squad against overindulging on Christmas Day, promising to weigh his players on their return to training and before they departed for Nottingham. “Only the manager is overweight – the rest are perfect,” the City manager, fresh from a couple of days in Catalonia, said with a smile before kick-off. City arrived in ominous form and have now won their past eight matches in all competitions, including six in a row in the Premier League. Continue reading...",
      "publishedAt": "2025-12-27T14:44:06.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Hearts krijgt in Edinburgh Derby stevige dreun in Schotse titelstrijd",
      "link": "https://www.vi.nl/nieuws/hearts-krijgt-in-edinburgh-derby-stevige-dreun-in-schotse-titelstrijd",
      "summary": "Intro",
      "publishedAt": "2025-12-27T14:31:58.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League live updates: Arsenal must beat Brighton to regain top spot; Liverpool in action",
      "link": "https://www.espn.com/soccer/story/_/id/47327288/premier-league-live-updates-nottingham-forest-manchester-city-arsenal-brighton-liverpool-wolves-chelsea-aston-villa",
      "summary": "null",
      "publishedAt": "2025-12-27T14:28:24.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "In-demand Guehi expected to finish season at Palace",
      "link": "https://www.bbc.com/sport/football/articles/ce3zdlw0p12o?at_medium=RSS&at_campaign=rss",
      "summary": "Crystal Palace captain Marc Guehi is expected to see out the final six months of his contract at the club.",
      "publishedAt": "2025-12-27T13:26:51.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'Gutting and frustrating' - Wood undergoes surgery",
      "link": "https://www.bbc.com/sport/football/articles/cqxq5935879o?at_medium=RSS&at_campaign=rss",
      "summary": "Nottingham Forest striker Chris Wood is set for extended spell on sidelines after undergoing surgery.",
      "publishedAt": "2025-12-27T12:38:41.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Amorim hails 'spirit' of depleted Man Utd in win",
      "link": "https://www.espn.com/soccer/story/_/id/47422409/ruben-amorim-hails-manchester-united-spirit-gritty-newcastle-win",
      "summary": "Manchester United boss Ruben Amorim lauded his team's spirit and togetherness after a depleted squad beat Newcastle on Friday.",
      "publishedAt": "2025-12-27T12:10:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Slot needed to 'convince' Ekitike to reach best form",
      "link": "https://www.espn.com/soccer/story/_/id/47417740/liverpool-hugo-ekitike-needed-convincing-reach-best-form-arne-slot",
      "summary": "Liverpool striker Hugo Ekitike's five goals in four matches suggest he is starting to get to grips with the Premier League but head coach Arne Slot admits he had to push the player to reach his current levels.",
      "publishedAt": "2025-12-27T12:10:36.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Wrexham's Moore delighted with brace vs. ex-club",
      "link": "https://www.espn.com/soccer/story/_/id/47421148/wrexham-kieffer-moore-delighted-double-vs-former-club-sheffield-united",
      "summary": "Kieffer Moore was pleased to silence the Sheffield United fans after his double inspired a superb Wrexham fightback on Boxing Day.",
      "publishedAt": "2025-12-27T12:10:35.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Morocco's historic winning streak snapped by Mali",
      "link": "https://www.espn.com/soccer/story/_/id/47422160/morocco-historic-winning-streak-snapped-mali",
      "summary": "Morocco and Mali played to a 1-1 draw on Friday in their second AFCON Group A match, with both sides converting penalties awarded after VAR interventions.",
      "publishedAt": "2025-12-27T12:10:35.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "World Darts Championship LIVE! Gilding, Clayton in action after Ratajski wins thriller",
      "link": "https://www.skysports.com/darts/live-blog/12040/13480473/world-darts-championship-2026-live-updates-video-analysis-results-schedule-with-luke-littler-luke-humphries-michael-van-gerwen-in-action",
      "summary": "",
      "publishedAt": "2025-12-27T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "CITY LEAVE IT LATE! Cherki nets winner at Forest LIVE!",
      "link": "https://www.skysports.com/football/live-blog/12040/13486642/nottingham-forest-vs-man-city-live-team-news-live-blog-score-updates-free-highlights-and-match-report",
      "summary": "",
      "publishedAt": "2025-12-27T10:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "I was there: England’s Euro 2025 glory was a surreal, almost psychedelic blur",
      "link": "https://www.theguardian.com/football/2025/dec/27/i-was-there-england-survive-setbacks-and-shootouts-to-seal-euro-2025-glory",
      "summary": "Sarina Wiegman’s champions took supporters on the most thrilling and nail-biting ride in Switzerland that was in many ways even more enjoyable to cover than their 2022 triumph Surreal. Utterly surreal. A home Euros in 2022 had provided wave after wave of emotion, England’s win at Wembley the culmination of decades of growth, setbacks, fight and deep longing. Everyone sang from the same hymn sheet for that maiden Euros win: the written press, broadcasters, fans, sponsors, Football Association, players and Sarina Wiegman and her staff. There were tears – lots. Having begun covering women’s football for the Guardian via a weekly column before the 2017 Euros, then gone full-time before the 2019 World Cup, I felt as if I had lived that progression, journeyed with them, contributed, in some small way, to that growth. The 2025 edition was different, surreal, an almost psychedelic experience. In many ways better than 2022. This was England’s first major tournament win – male or female – away from home. Expectations were high but injuries, retirements and inconsistent performances and results had made most aware that a title defence wouldn’t be a procession. That made it all the more magnificent. Continue reading...",
      "publishedAt": "2025-12-27T08:00:33.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "The best wonderkids outside big five leagues",
      "link": "https://www.bbc.com/sport/football/articles/cn7k3kpxkl8o?at_medium=RSS&at_campaign=rss",
      "summary": "There are plenty of wonderkids catching the eye outside of Europe's big-five leagues - BBC Sport takes a look at the top 10 as ranked by the CIES Football Observatory research group.",
      "publishedAt": "2025-12-27T07:51:18.000Z"
    }
  ]
}