{
  "generatedAt": "2025-12-22T14:45:36.126Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Heracles neemt enorm risico met verkoop Hornkamp",
      "link": "https://www.vi.nl/pro/heracles-neemt-enorm-risico-met-verkoop-hornkamp",
      "summary": "Heracles Almelo gaat Jizz Hornkamp kwijtraken. De 27-jarige spits gaat zijn carrière vervolgen bij AZ en laat daarmee een enorme leegte achter in het Asito Stadion. Heracles is als nummer zeventien van de Eredivisie de winterstop in gegaan en moet het in de tweede seizoenshelft stellen zonder de clubtopscorer. Over de risico's van de verkoop van Hornkamp.",
      "publishedAt": "2025-12-22T14:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Mali v Zambia: Africa Cup of Nations – live",
      "link": "https://www.theguardian.com/football/live/2025/dec/22/mali-v-zambia-africa-cup-of-nations-live",
      "summary": "⚽ Updates from the Group A fixture; kick-off 2pm GMT ⚽ Scores | Follow us on Bluesky | Email Will She’s offered £36k under asking price. Surely she has no chance. We are the business end of A Place in the Sun on 4Seven before the football starts. Will they make an offer on a property? The tension is palpable!. Continue reading...",
      "publishedAt": "2025-12-22T14:28:30.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Scott departs Hibs to replace Sadiku at Celtic Women",
      "link": "https://www.skysports.com/football/news/12040/13486716/celtic-women-grant-scott-departs-hibernian-to-replace-elena-sadiku-as-head-coach-at-scottish-womens-premier-league-club",
      "summary": "Celtic have appointed Grant Scott as the club's new Women's head coach.",
      "publishedAt": "2025-12-22T14:09:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Precheur gone - so what's next for London City?",
      "link": "https://www.bbc.com/sport/football/articles/cvg17pv3rlpo?at_medium=RSS&at_campaign=rss",
      "summary": "When London City Lionesses sacked manager Jocelyn Precheur it sparked controversy - but they are a club who have always done things differently.",
      "publishedAt": "2025-12-22T14:07:22.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Slory bij Go Ahead herenigd met Boel: 'Belangrijke reden om te komen'",
      "link": "https://www.vi.nl/nieuws/slory-bij-go-ahead-herenigd-met-boel-belangrijke-reden-om-te-komen",
      "summary": "Go Ahead Eagles heeft de tijdelijk komst van Jaden Slory maandag bevestigd. De twintigjarige aanvaller speelt voor de rest van het seizoen op huurbasis in Deventer. Go Ahead heeft zo met enige vertraging beet op de transfermarkt.",
      "publishedAt": "2025-12-22T14:04:34.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Sky Sports extends PGA Tour deal until 2029",
      "link": "https://www.skysports.com/golf/news/12040/13486612/sky-sports-extends-pga-tour-partnership-to-2029-in-four-year-golf-broadcast-rights-deal-in-uk-and-ireland",
      "summary": "Sky and the PGA Tour have agreed a four-year extension to their long-standing partnership in the UK and Ireland through to the end of 2029.",
      "publishedAt": "2025-12-22T14:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "'Milan bereikt akkoord met West Ham over concurrent voor Giménez'",
      "link": "https://www.vi.nl/nieuws/milan-bereikt-akkoord-met-west-ham-over-concurrent-voor-gim-nez",
      "summary": "Santiago Gimenez lijkt er een concurrent bij te gaan krijgen in de komende transferwindow bij AC Milan. De Mexicaan kampt met blessures en voldoet niet aan de verwachtingen, waardoor er volgens meerdere bronnen al een akkoord zou zijn gesloten met zijn opvolger.",
      "publishedAt": "2025-12-22T13:58:34.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Leverkusen level up as Hjulmand oversees rebuild after Ten Hag debacle",
      "link": "https://www.theguardian.com/football/2025/dec/22/bayer-leverkusen-rise-kasper-hjulmand-erik-ten-hag-bundesliga",
      "summary": "A fightback win over RB Leipzig before the Christmas break is just reward for coach who faced a thankless task Leipzig might not be every Bundesliga fan’s idea of a weekend idyll but as the sun set on 2025, the venue for the final Saturday night Topspiel of the year might have been the scene of a minor Christmas miracle. It had already been a worthy showpiece to draw the curtains on pre-Christmas Bundesliga but the end result – achieved not without a smidgeon of controversy – left us with a satisfying tale to tell by an open fire over holiday season. For Bayer Leverkusen can enjoy their brief break with a rosy glow of satisfaction with their win against a direct competitor a clear measure of how far they have come; or, if you like, a measure of how far Kasper Hjulmand has taken them. Leverkusen sit third over the bridge to the new year which, if we were to return to the closure of the summer transfer window, looked a long way off. Continue reading...",
      "publishedAt": "2025-12-22T13:52:56.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Glasner hopes to gee up jaded Palace as he eyes Carabao Cup revenge over Arsenal",
      "link": "https://www.theguardian.com/football/2025/dec/22/oliver-glasner-jaded-crystal-palace-carabao-cup-arsenal",
      "summary": "Tuesday’s quarter-final will be the Eagles’ 29th game of the season and Gabriel Jesus is set to line up against them Oliver Glasner could be forgiven for preferring to enjoy a rest with his family in Austria a few days before Christmas rather than preparing for Crystal Palace’s 29th game of the season – a Carabao Cup quarter-final against Arsenal on Tuesday night. However, any suggestion that Palace may have to prioritise given they remain in four competitions was unsurprisingly dismissed. “No, I don’t think so,” said Glasner after his team’s 4-1 hammering by Leeds on Saturday. “If somebody tells me that we lose on purpose, the next day I’m not the manager any more.” Continue reading...",
      "publishedAt": "2025-12-22T13:30:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Peter Bosz als bondscoach? 'Geen garantie op direct droomvoetbal'",
      "link": "https://www.vi.nl/video/peter-bosz-als-bondscoach-geen-garantie-op-direct-droomvoetbal",
      "summary": "Er is een lobby gaande voor Peter Bosz als bondscoach. In Rondje Eredivisie bespreken Martijn Krabbendam, Geert-Jan Jakobs en Inta Janssen wie na het WK de nieuwe bondscoach moet worden. Kan de huidige PSV-trainer het droomvoetbal bij Oranje brengen waar iedereen zo naar verlangt?",
      "publishedAt": "2025-12-22T13:30:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Dalot: Fernandes injury 'massive' blow to Utd",
      "link": "https://www.espn.com/soccer/story/_/id/47388137/bruno-fernandes-injury-massive-blow-man-united-diogo-dalot",
      "summary": "Diogo Dalot called Bruno Fernandes' injury a \"massive\" blow as Manchester United wait to find out the severity of the skipper's setback.",
      "publishedAt": "2025-12-22T13:28:11.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Kane smashes Arjen Robben record in Bayern rout",
      "link": "https://www.espn.com/soccer/report/_/gameId/746846",
      "summary": "Harry Kane scored his 30th club goal of the season as Bayern Munich shrugged off an injury and illness crisis to sweep past Heidenheim 4-0 on Sunday and go into the Bundesliga's winter break with a nine-point lead.",
      "publishedAt": "2025-12-22T13:27:44.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Arteta: Jesus could start in cup against Palace",
      "link": "https://www.espn.com/soccer/story/_/id/47388499/gabriel-jesus-start-arsenal-crystal-palace-mikel-arteta",
      "summary": "Mikel Arteta hinted he was ready to hand Gabriel Jesus his first start in 345 days in Arsenal's Carabao Cup quarterfinal clash against Crystal Palace.",
      "publishedAt": "2025-12-22T13:27:44.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man United's Mazaroui 'fantastic' in Hakimi role",
      "link": "https://www.espn.com/soccer/story/_/id/47384768/manchester-united-mazaroui-fantastic-hakimi-role",
      "summary": "Achraf Hakimi was unable to make his comeback from injury in Morocco's opener at the Africa Cup of Nations on Sunday -- a 2-0 victory over Comoros -- but head coach Walid Regragui said his replacement is just as strong an option.",
      "publishedAt": "2025-12-22T13:27:44.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transfers Feyenoord: 'Brentford kijkt opnieuw in Rotterdam rond'",
      "link": "https://www.vi.nl/nieuws/transfers-feyenoord-brentford-kijkt-opnieuw-in-rotterdam-rond",
      "summary": "Ook buiten de transferperiode om volgt VI het transfernieuws bij Feyenoord op de voet, ook omdat het sneller dan je denkt alweer januari is. De doelwitten van de Rotterdammers, duiding van de clubwatcher, of aandacht in buitenlandse media. We verzamelen alles hier.",
      "publishedAt": "2025-12-22T13:20:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool win again, but lose Isak to injury. Now what? Plus: Barça ride their luck, more",
      "link": "https://www.espn.com/soccer/story/_/id/47386120/liverpool-win-isak-injured-tottenham-barcelona-laliga-analysis-monday-musings-gab-marcotti",
      "summary": "Liverpool won a third straight game, but Alexander Isak's injury and some familiar issues mean the Reds still have a lot of work to do.",
      "publishedAt": "2025-12-22T13:10:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "England name squad for away series against South Africa",
      "link": "https://www.skysports.com/netball/news/12040/13486647/vitality-roses-england-name-squad-for-south-africa-series-in-january-2026-fresh-from-jamaica-win",
      "summary": "The Vitality Roses have named their squad for their three-match test series away to South Africa in January.",
      "publishedAt": "2025-12-22T13:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Villarreal tried everything against Barcelona – except moving the game to Miami | Sid Lowe",
      "link": "https://www.theguardian.com/football/2025/dec/22/villarreal-barcelona-la-liga-football-miami",
      "summary": "In a match mercifully on Spanish soil, Villarreal bombarded Barça but were undone by profligacy and ill-discipline Marcelino García Toral came bounding down the steps like an excited schoolboy when the bell goes. He flew past the substitutes and staff, skidded left, and sprinted up the line all wide-eyed and excited, shaking his fists and beaming. He had gone 15 or 20 metres, maybe 25 when he realised – just a fraction later than everyone else – that something had gone wrong again. So Villarreal’s manager put the brakes on and his head down, and turned back towards the bench feeling almost as silly as this was getting. This, he already suspected, was going to be one of those days. They had been playing 16 minutes and the goal Villarreal had scored, the goal Jules Koundé scored for them, wasn’t a goal at all. Just as the chance they made after 80 seconds wasn’t, Nicolas Pépé putting wide from a yard out. Just as Ayoze Pérez’s opportunity on six minutes wasn’t a goal, Tajon Buchanan’s effort on 13 wasn’t, and Raphinha’s on nine minutes was. One moment – a dash, a tumble and a penalty – and from nowhere Villarreal trailed Barcelona. Now they were level again only for a raised flag to halt the manager’s run as suddenly, the oh neatly summing up the afternoon when La Liga’s best teams met on the Mediterranean, not in Miami, and Barcelona beat Villarreal 2-0. Continue reading...",
      "publishedAt": "2025-12-22T12:17:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "McCullum concedes England future 'up to other people' after 11-day Ashes series defeat",
      "link": "https://www.skysports.com/cricket/news/12040/13486662/the-ashes-2025-26-brendon-mccullum-concedes-england-future-in-hands-of-others-after-11-day-series-defeat",
      "summary": "Brendon McCullum is eager to stay on as England's head coach but admits his future is \"up to other people\" after losing the Ashes in just 11 days.",
      "publishedAt": "2025-12-22T12:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Should Van de Ven have been sent off for Isak tackle?",
      "link": "https://www.bbc.com/sport/football/articles/cwyljp82q21o?at_medium=RSS&at_campaign=rss",
      "summary": "Micky van de Ven faced no action for the challenge which led to Alexander Isak's injury in Liverpool's win at Tottenham - but did the officials make the right call?",
      "publishedAt": "2025-12-22T11:58:43.000Z"
    }
  ]
}