{
  "generatedAt": "2026-01-14T18:38:39.139Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Respectvolle uitfans van PSV juichen pas na eerbetoon FC Den Bosch",
      "link": "https://www.vi.nl/nieuws/respectvolle-uitfans-van-psv-juichen-pas-na-eerbetoon-fc-den-bosch",
      "summary": "De fans van PSV hebben zich woensdagavond in Den Bosch van hun beste kant laten zien. De meegereisde Eindhovenaren juichten pas een kleine minuut na de 0-2 van Dennis Man.",
      "publishedAt": "2026-01-14T18:26:11.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Senegal v Egypt: Africa Cup of Nations semi-final – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/14/senegal-v-egypt-africa-cup-of-nations-2026-semi-final",
      "summary": "⚽ Updates from the first semi-final; kick-off 5pm GMT ⚽ Follow us on Bluesky | Read Football Daily | Mail Yara Koulibaly and Salah shake hands as captains and are all smiles before Salah goes over to Mané before kick-off and the two share an embrace. The teams are out and the national anthems are being sung. First Senegal and then Egypt. Lots of support for both sides at the Tangier Grand Stadium. Continue reading...",
      "publishedAt": "2026-01-14T18:24:44.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Monaco CEO on injured Pogba: Plan isn't working",
      "link": "https://www.espn.com/soccer/story/_/id/47610010/monaco-ceo-paul-pogba-injury-france-world-cup",
      "summary": "Monaco's CEO acknowledged that their original plan for Paul Pogba \"is not working,\" with the former France star limited to just 30 minutes of action since joining the club last summer.",
      "publishedAt": "2026-01-14T18:19:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Richards named U.S. Male Player of the Year",
      "link": "https://www.espn.com/soccer/story/_/id/47610350/chris-richards-usa-men-player-year-2025-crystal-palace",
      "summary": "Crystal Palace and United States defender Chris Richards has been voted the 2025 U.S. Soccer Male Player of the Year, the federation announced Wednesday.",
      "publishedAt": "2026-01-14T18:19:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Delay in disallowed Semenyo goal an 'edge case'",
      "link": "https://www.espn.com/soccer/story/_/id/47607499/delay-disallowed-antoine-semenyo-goal-due-lack-offside-technology",
      "summary": "The delay in ruling out a Manchester City goal for offside in Tuesday's Carabao Cup win at Newcastle was extended because semi-automated offside technology could not be used in the incident.",
      "publishedAt": "2026-01-14T18:19:52.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Man City sign USWNT's Coffey from Thorns",
      "link": "https://www.espn.com/soccer/story/_/id/47608248/man-city-sign-uswnt-sam-coffey-portland-thorns",
      "summary": "Manchester City have announced the signing of United States midfielder Sam Coffey from NWSL side Portland Thorns.",
      "publishedAt": "2026-01-14T18:19:52.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: PSV in sneltreinvaart richting kwartfinales KNVB Beker",
      "link": "https://www.vi.nl/nieuws/vi-live-heerlijke-doordeweekse-voetbalavond-op-het-menu",
      "summary": "Smullen op de woensdagavond. In de Eurojackpot KNVB Beker staan AZ en Ajax tegenover elkaar. Maar eerst komt PSV - op bezoek bij FC Den Bosch - in actie. In het buitenland staan onder meer Chelsea - Arsenal, FC Porto - Benfica en wedstrijden van Real Madrid, Bayern München, Napoli en Internazionale op het programma. Ook de halve finales van de Afrika Cup worden vanavond afgewerkt.",
      "publishedAt": "2026-01-14T18:15:04.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Conor Gallagher vows to bring ‘special moments’ to Tottenham after £34.6m transfer",
      "link": "https://www.theguardian.com/football/2026/jan/14/tottenham-sign-conor-gallagher-as-frank-says-he-will-bring-leadership",
      "summary": "Midfielder signs long-term deal after move from Atlético Thomas Frank: ‘Conor will bring leadership and maturity’ Conor Gallagher has pledged to bring “special moments” to Tottenham after completing a £34.6m transfer from Atlético Madrid. The London club moved quickly for a midfielder they have long admired after losing Rodrigo Bentancur to a hamstring injury at Bournemouth last Wednesday, beating off competition from Aston Villa. Bentancur has since undergone surgery. Spurs looked at Gallagher at the end of the 2023-24 season only for him to go from Chelsea to Atlético for £34m. Before the Premier League game between Chelsea and Spurs in May 2024 at Stamford Bridge, the home support unfurled a giant banner of Gallagher. “Chelsea since birth,” read the caption about their academy product. The subtext was clear: do not sell him to Spurs. Continue reading...",
      "publishedAt": "2026-01-14T17:50:23.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'If Flick hadn't come, I would have left Barca' - Raphinha",
      "link": "https://www.bbc.com/sport/football/articles/crmlk8zgrzyo?at_medium=RSS&at_campaign=rss",
      "summary": "Raphinha has become one of Barcelona's most dependable performers and a decisive figure in their biggest matches, which he credits Hansi Flick for.",
      "publishedAt": "2026-01-14T17:48:42.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Bosz verklaart keuzes in opstelling en wijst valkuil in Den Bosch aan",
      "link": "https://www.vi.nl/nieuws/bosz-verklaart-keuzes-in-opstelling-en-wijst-valkuil-in-den-bosch-aan",
      "summary": "PSV neemt het woensdagavond op tegen FC Den Bosch in de Eurojackpot KNVB Beker en voor dat treffen stelde trainer Peter Bosz een alternatieve opstelling samen. Zo begint Noah Fernandez in de basis en start Esmir Bajraktarevic in de spits. De trainer geeft tekst en uitleg bij die keuzes.",
      "publishedAt": "2026-01-14T17:40:09.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Oranje-tegenstander Tunesië presenteert nieuwe bondscoach",
      "link": "https://www.vi.nl/nieuws/oranje-tegenstander-tunesi-presenteert-nieuwe-bondscoach",
      "summary": "Sabri Lamouchi is de nieuwe bondscoach van Tunesië. Lamouchi is de opvolger van Sami Trabelsi, die ontslagen werd na de uitschakeling in de achtste finales van de Afrika Cup tegen Mali.",
      "publishedAt": "2026-01-14T17:34:49.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Littler vs Lim headlines first round of Bahrain Darts Masters",
      "link": "https://www.skysports.com/darts/news/12040/13494294/bahrain-darts-masters-schedule-format-results-as-luke-littler-michael-van-gerwen-luke-humphries-take-part",
      "summary": "Luke Littler, Gian Van Veen and Luke Humphries have been handed their first round matches in this year's Bahrain Darts Masters, in the first event of the 2026 World Series of Darts.",
      "publishedAt": "2026-01-14T17:15:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "De bijzondere WK-droom van Heracles-spits Kulenovic",
      "link": "https://www.vi.nl/nieuws/de-bijzondere-wk-droom-van-heracles-spits-kulenovic",
      "summary": "Er zitten veel haken en ogen aan, maar Luka Kulenovic droomt van deelname aan het WK van komende zomer. Daarvoor moet er nog veel gebeuren, want Bosnië en Herzegovina moet zich nog plaatsen en de spits van Heracles Almelo zit vooralsnog niet bij de selectie. Kulenovic legt uit waarom het komende WK speciaal is voor hem.",
      "publishedAt": "2026-01-14T17:10:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Is Wenger's daylight idea the solution to fix offside?",
      "link": "https://www.bbc.com/sport/football/articles/c17zw81yxp5o?at_medium=RSS&at_campaign=rss",
      "summary": "Is the offside law about to change to Arsene Wenger's daylight idea? And should football make that change just because of VAR?",
      "publishedAt": "2026-01-14T17:00:11.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Tottenham sign Gallagher from Atletico for £35m",
      "link": "https://www.bbc.com/sport/football/articles/cddgzj33r2lo?at_medium=RSS&at_campaign=rss",
      "summary": "The former Chelsea midfielder joins Spurs on a deal until 2031.",
      "publishedAt": "2026-01-14T16:14:59.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Gallagher joins Spurs",
      "link": "https://www.skysports.com/football/news/12040/13494168/conor-gallagher-to-tottenham-atletico-madrid-midfielder-joins-spurs-in-34m-deal-after-aston-villa-interest",
      "summary": "Tottenham have completed the signing of England midfielder Conor Gallagher from Atletico Madrid for a fee of £34m.",
      "publishedAt": "2026-01-14T16:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Football Daily | Alonso and the trouble with replacing ego and vibes with work ethic at Madrid",
      "link": "https://www.theguardian.com/football/2026/jan/14/football-daily-newsletter-real-madrid",
      "summary": "Sign up now! Sign up now! Sign up now? Sign up now! Having started this season at Real Madrid with 13 wins from his first 14 games, Xabi Alonso could be forgiven for thinking he was on to a good thing in his new role of Kindergarten Cop, tasked with instilling discipline among the spoilt and unruly brats in his care. While this excellent run was punctuated by a tonking at the hands of Atlético and a diva strop thrown by Vinícius Júnior, Alonso seemed to have pulled off the unthinkable by introducing something approaching a work ethic into a group of players who had previously been powered on ego and vibes. It wasn’t until November that the passengers on board the Madrid wagon began to unscrew the wheels, when a series of poor results led to revelations that all was not well in the camp. Leaks suggested the squad was split between the few players who were entirely sold on the 43-year-old’s ethos and the apparent vast majority who took exception to this José Come-Lately’s tyrannical demands that they turn up on time, run around a bit and occasionally sit through boring tactical presentations that lasted longer than a FaceSpace Snap. The suggestion that Manchester United hve taken/should take advice from Seinfeld [yesterday’s Football Daily] got me thinking. There was an episode about a competition during which, um, refraining from certain personal activities led to a temporary increase in intelligence (note: for male participants only!). As I recall, one of the outcomes was that George Costanza became fluent in Portuguese. Does this explain why the United board hired Messrs Mourinho and Amorim and signed Cristiano Ronaldo in recent years? And, does the hiring of Mr Carrick signal the, um, the end of the competition?” – Mike Wilner. Following Dan Westacott’s letter about JR (yesterday’s letters), surely a growing number of Manchester United’s fans are praying that they will wake up back in 2013, where Sir Alex Ferguson will be getting out of the shower one morning, preparing himself for a press conference when he will announce that he isn’t actually retiring” – Simon Dunsby. Not only did Dan get a letter published with a joke from 40 years ago, but he won letter of the day! And you didn’t even have to look it up! Oh, wait …” – Z Snook. Seriously guys? Only two options and you gave letter of the day to the writer not called Gumley Slats!?!” – Adam Sherlock. This is an extract from our daily football email … Football Daily. To get the full version, just visit this page and follow the instructions. Continue reading...",
      "publishedAt": "2026-01-14T15:52:29.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "‘One of the world’s best’: Manchester City swoop for USWNT midfielder Sam Coffey",
      "link": "https://www.theguardian.com/football/2026/jan/14/manchester-city-hail-new-signing-sam-coffey-world-best-midfielders-usa-portland-womens-football",
      "summary": "USA mainstay in move from Portland Thorns ‘I couldn’t be more ready and happy about everything’ Manchester City have signed the USA midfielder Sam Coffey on a three-and-a-half year deal. The 27-year-old won gold at the Paris 2024 Olympics and has accrued 42 caps and scored five goals for the USA, becoming a key part of Emma Hayes’ national team. After graduating she joined Portland Thorns and lifted the 2022 NWSL Championship in her debut season. Continue reading...",
      "publishedAt": "2026-01-14T15:20:39.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Premier League's top 50 transfers of all time: Who is No. 1?",
      "link": "https://www.espn.com/soccer/story/_/id/47600750/premier-league-top-transfers-all-bill-connelly",
      "summary": "What makes a great signing? Is it trophies won, goals scored, a long run of dominance ... or all of the above? Bill Connelly breaks down the best 50 Premier League moves since it began in 1992-93.",
      "publishedAt": "2026-01-14T13:43:01.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Spurs sporting director Paratici to join Fiorentina",
      "link": "https://www.skysports.com/football/news/12040/13494214/fabio-paratici-tottenham-sporting-director-to-leave-club-just-three-months-after-returning",
      "summary": "Tottenham's joint sporting director Fabio Paratici is to leave the club and join Fiorentina following the end of the January transfer window, three months after returning to the club.",
      "publishedAt": "2026-01-14T13:20:00.000Z"
    }
  ]
}