{
  "generatedAt": "2026-01-03T16:29:08.299Z",
  "items": [
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "VI Live: Wolves stevent af op eerste zege, Brighton op voorsprong",
      "link": "https://www.vi.nl/nieuws/vi-live-de-dag-van-de-old-firm-en-de-catalaanse-derby",
      "summary": "In deze VI Live volgen we de hoogtepunten in verschillende competities. Met onder meer aandacht voor Celtic - Rangers FC, AFC Bournemouth - Arsenal en Espanyol - Barcelona.",
      "publishedAt": "2026-01-03T16:13:56.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Transfers PSV: bod Fulham op Pepi van tafel geveegd",
      "link": "https://www.vi.nl/nieuws/transfers-psv-bod-fulham-op-pepi-van-tafel-geveegd",
      "summary": "Ook buiten de transferperiode om volgt VI het transfernieuws bij PSV op de voet, ook omdat het sneller dan je denkt alweer januari is. De doelwitten van de Eindhovenaren, duiding van de clubwatcher, of aandacht in buitenlandse media. We verzamelen alles hier.",
      "publishedAt": "2026-01-03T16:12:29.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PSV laat Pepi niet gaan ondanks Fulham-bod, Nagalo mag weg",
      "link": "https://www.vi.nl/nieuws/psv-laat-pepi-niet-gaan-ondanks-fulham-bod-nagalo-mag-weg",
      "summary": "PSV heeft in de afgelopen periode een bod van Fulham op Ricardo Pepi afgeslagen en is niet van plan om de Amerikaanse spits deze winter van de hand te doen. In Eindhoven wordt op dit moment een rustige winter verwacht waarin wel verdediger Adamo Nagalo verkocht mag worden.",
      "publishedAt": "2026-01-03T16:11:06.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Wolves v West Ham, Brighton v Burnley, and more: football clockwatch – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/03/wolves-v-west-ham-brighton-v-burnley-and-more-football-clockwatch-live",
      "summary": "⚽ Get updates from England, Scotland and further afield ⚽ Live scores | Tables | Follow us on Bluesky | Email Billy A bit more on Pablo Felipe, West Ham’s new signing. Position: Striker Age: 22 Nationality: Brazil Signed from: Gil Vicente (Portugal) This season: 14 games, 10 goals Form (last 6 games): 6 goals, 1 assist The intensity levels are better. There’s more of a confidence and belief but that’s only going to come from more results and more performances and being more consistent with what we do. There are certainly certain things that we’ve improved on, but it’s a difficult league, and we came in at a difficult moment, so it was always going to be hard to instantly get those results. I said to the lads after the [United] game that we need to get that performance level at home. That’s the most important thing for us now. Continue reading...",
      "publishedAt": "2026-01-03T16:10:19.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Bournemouth v Arsenal: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/03/bournemouth-v-arsenal-premier-league-live",
      "summary": "⚽ Premier League updates from the 5.30pm GMT kick-off ⚽ Live scores | Tables | Follow us on Bluesky | Email Barry Referee: Chris Kavanagh Assistants: Dan Cook and Ian Hussin Fourth official: Lewis Smith VAR: Paul Tierney Assistant VAR: Marc Perry Continue reading...",
      "publishedAt": "2026-01-03T16:07:53.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "RB Leipzig gaat in op wens van Kampl en stopt contract voortijdig",
      "link": "https://www.vi.nl/nieuws/west-ham-united-legt-23-miljoen-euro-op-tafel-voor-nieuwe-spits",
      "summary": "In dit blog vind je alle speculaties en bevestigde transfers in het buitenland. Bekijk hier ons blog voor de transferperikelen in Nederland.",
      "publishedAt": "2026-01-03T15:59:42.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'We are together with the board' - Nancy defiant after Celtic loss",
      "link": "https://www.bbc.com/sport/football/articles/c2057rrkk77o?at_medium=RSS&at_campaign=rss",
      "summary": "Celtic manager Wilfried Nancy insists he is still \"together with the board\" and believes \"we can turn things around\" despite falling to a sixth loss in eight games following the derby defeat to Rangers.",
      "publishedAt": "2026-01-03T15:55:27.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Keep, Dump or Extend? 5 big questions Arsenal must answer in January",
      "link": "https://www.espn.com/soccer/story/_/id/47471835/big-questions-arsenal-answer-january-transfer-window",
      "summary": "The January window is open, and top clubs such as Arsenal must weigh key decisions on transfers, extensions and more.",
      "publishedAt": "2026-01-03T15:54:29.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "7 questions Liverpool must answer in the January transfer window",
      "link": "https://www.espn.com/soccer/story/_/id/47456664/the-january-transfer-window-moves-liverpool-make",
      "summary": "Top clubs like Liverpool have big and expensive decisions to make.",
      "publishedAt": "2026-01-03T15:54:29.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: Rosenior frontrunner to replace Maresca",
      "link": "https://www.espn.com/soccer/story/_/id/47479925/liam-rosenior-frontrunner-replace-enzo-maresca-chelsea-sources",
      "summary": "Strasbourg boss Liam Rosenior is the leading candidate to succeed Enzo Maresca as Chelsea head coach, sources have told ESPN.",
      "publishedAt": "2026-01-03T15:53:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Alonso unsure when Mbappe (knee) will return",
      "link": "https://www.espn.com/soccer/story/_/id/47490342/real-madrid-kylian-mbappe-injury-xabi-alonso-news-conference",
      "summary": "Xabi Alonso has admitted he \"doesn't know\" when Kylian Mbappé will return for Real Madrid, saying the club are working to have the star forward back from injury \"as soon as possible.\"",
      "publishedAt": "2026-01-03T15:53:49.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Pep denies Maresca, City links: 'I have a contract'",
      "link": "https://www.espn.com/soccer/story/_/id/47481706/pep-guardiola-denies-enzo-maresca-man-city-links-contract",
      "summary": "Pep Guardiola has reiterated his desire to stay on at Manchester City amid fresh rumours surrounding Enzo Maresca.",
      "publishedAt": "2026-01-03T15:53:49.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Farioli veegt speculaties over snel vertrek naar Chelsea van tafel",
      "link": "https://www.vi.nl/nieuws/farioli-veegt-speculaties-over-snel-vertrek-naar-chelsea-van-tafel",
      "summary": "Voor Francesco Farioli is het geen optie om FC Porto gedurende dit seizoen te verlaten voor een stap hogerop. Dat heeft de Italiaanse coach tijdens een persmoment heel duidelijk gemaakt, nadat hij gelinkt werd aan Chelsea.",
      "publishedAt": "2026-01-03T15:37:50.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "John McGinn double sinks Forest and provides perfect tonic for Aston Villa",
      "link": "https://www.theguardian.com/football/2026/jan/03/aston-villa-nottingham-forest-premier-league-match-report",
      "summary": "Aston Villa continue to surpass expectations as they bounced back from defeat by Arsenal to cement their place in the top three. Ollie Watkins celebrated his 250th appearance for the club with his fourth goal in three games and John McGinn added two more as Unai Emery’s side won their 11th straight home game. Villa’s ability to score out of next to nothing epitomises their season. They managed this game superbly, inflicting a fourth straight defeat on Nottingham Forest, but if the league table was made up of their expected goals difference, they would have started this weekend in 15th place. Continue reading...",
      "publishedAt": "2026-01-03T14:50:33.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Nancy plunged into deeper Celtic crisis after Chermiti leads Rangers in derby",
      "link": "https://www.theguardian.com/football/2026/jan/03/celtic-rangers-scottish-premiership-match-report",
      "summary": "Wilfried Nancy spent a memorable Friday press conference pleading for time, context and understanding as he visibly struggles with the role of Celtic manager. This outcome – and the nature of it – will do nothing for Nancy’s hopes of keeping his job. Celtic’s beleaguered directors now face a critical and imminent decision over whether to keep faith with the Frenchman or write his appointment off as a bad mistake. This marked a sixth defeat in eight games for Nancy. It arrived against the backdrop of revolt from paying customers. Celtic feel an on- and off-field mess. Nancy is on the precipice. Continue reading...",
      "publishedAt": "2026-01-03T14:39:41.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Paul loses WBA cruiserweight ranking after defeat to Joshua",
      "link": "https://www.skysports.com/boxing/news/12040/13489910/jake-paul-loses-wba-cruiserweight-ranking-after-defeat-to-anthony-joshua-in-miami-in-december",
      "summary": "Jake Paul has slipped out of the WBA cruiserweight rankings after losing his heavyweight clash with Anthony Joshua in Miami last month.",
      "publishedAt": "2026-01-03T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Liverpool latest: We have no chance of retaining title, says MacAllister",
      "link": "https://www.skysports.com/football/live-blog/12040/13025501/liverpool-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
      "summary": "",
      "publishedAt": "2026-01-03T12:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Swiatek: Women's tennis does not need 'Battle of the Sexes'",
      "link": "https://www.skysports.com/tennis/news/12040/13489865/iga-swiatek-says-womens-tennis-does-not-need-battle-of-the-sexes-after-aryna-sabalenka-vs-nick-kyrgios-match",
      "summary": "Iga Swiatek says women's tennis does not need the 'Battle of the Sexes' and is able to \"stand on its own\".",
      "publishedAt": "2026-01-03T09:00:00.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Blackburn to Barcelona - Dolan's 'unbelievable' journey to Espanyol",
      "link": "https://www.bbc.com/sport/football/articles/cwy1wn866y5o?at_medium=RSS&at_campaign=rss",
      "summary": "Five years ago, Tyrhys Dolan was playing for Clitheroe - now he is preparing to face Barcelona in the Catalan derby.",
      "publishedAt": "2026-01-03T06:46:24.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "I’m the ‘miracle’ woken from a coma by Kenny Dalglish after Hillsborough. And now I’ve met him again",
      "link": "https://www.theguardian.com/football/2026/jan/03/36-years-on-miracle-hillsborough-disaster-survivor-meets-kenny-dalglish-liverpool",
      "summary": "It’s said that you should never meet your heroes, but 36 years after the Liverpool manager sat by my hospital bed, I got to thank our greatest ally Born to a son of Anfield in a Warwickshire village, I grew up geographically remote from my spiritual football home. Emotionally, though, the pull of the boys in red was ever-present: from my first game at Anfield in 1974 to FA Cup final defeat at Wembley in ’77, to witnessing the first of Liverpool’s six European Cups, in Rome, when my first hero, Kevin Keegan, ran Berti Vogts ragged. I cried when Keegan left, but soon a new king was born in my imagination: Kenny Dalglish, that wily, tough, insanely skilful Scot. I travelled the country to follow my team through the peaks and troughs that culminated in the lowest possible low, on 15 April 1989, the day of the FA Cup semi-final between Liverpool and Nottingham Forest. There are many things I remember about Hillsborough, some of which returned to me years, even decades, later. My dad saying: “If it’s a nice day tomorrow, we’ll go.” Ian St John on the end of my hospital bed. My best mate laughing as I struggled to eat a yoghurt. The endless bright white lights of the Royal Hallamshire. The surreal trip to my local hospital in an ancient, drafty ambulance. One thing I don’t remember, though, is meeting my hero. And for good reason. For I’m the “miracle” boy woken by the sound of Kenny’s voice when he spoke at my bedside. Continue reading...",
      "publishedAt": "2026-01-03T06:00:32.000Z"
    }
  ]
}