{
  "generatedAt": "2026-01-06T21:25:02.929Z",
  "items": [
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Drama! Forest equalise moments after West Ham goal ruled out!",
      "link": "https://www.skysports.com/watch/video/13491308/drama-forest-equalise-moments-after-west-ham-goal-ruled-out",
      "summary": "Nottingham Forest find the equaliser just minutes after West Ham had thought they had doubled their lead!",
      "publishedAt": "2026-01-06T21:19:00.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Sources: United approach Carrick, Solskjaer",
      "link": "https://www.espn.com/soccer/story/_/id/47527700/man-united-approach-ole-gunnar-solskjaer-michael-carrick-interim-role",
      "summary": "Manchester United have held \"early-stage informal talks\" with several potential interim managers, including Ole Gunnar Solskjaer and Michael Carrick, sources have told ESPN.",
      "publishedAt": "2026-01-06T21:15:37.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Chelsea name Rosenior as coach on 5½-year deal",
      "link": "https://www.espn.com/soccer/story/_/id/47523773/liam-rosenior-chelsea-appointment-strasbourg-exit-premier-league-manager",
      "summary": "Chelsea have announced the appointment of Liam Rosenior as their new head coach on a 5½-year contract.",
      "publishedAt": "2026-01-06T21:15:37.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Iraola: City-target Semenyo could exit this week",
      "link": "https://www.espn.com/soccer/story/_/id/47530774/bournemouth-andoni-iraola-man-city-antonie-semenyo-transfer",
      "summary": "Bournemouth boss Andoni Iraola said Tuesday that he accepts Antoine Semenyo could make his last appearance for the club against Tottenham on Wednesday night.",
      "publishedAt": "2026-01-06T21:15:37.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "West Ham v Nottingham Forest: Premier League – live",
      "link": "https://www.theguardian.com/football/live/2026/jan/06/west-ham-v-nottingham-forest-premier-league-live",
      "summary": "⚽ Premier League updates from the 8pm GMT kick-off ⚽ Live scores | Follow us on Bluesky | And email Billy West Ham get the ball rolling! The teams are on their way out of the London Stadium tunnel. It’s slightly above freezing and rain, probably not snow, is forecast a bit later this evening. Kick-off is next. Continue reading...",
      "publishedAt": "2026-01-06T21:10:20.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "PSV'er Nagalo zakt door het ijs: glansrol Diallo brengt Ivoorkust naar kwartfinale",
      "link": "https://www.vi.nl/nieuws/psv-er-nagalo-zakt-door-het-ijs-glansrol-diallo-brengt-ivoorkust-naar-kwartfinale",
      "summary": "Titelhouder Ivoorkust heeft geen kind gehad aan Burkina Faso gehad in de achtste finale van de Afrika Cup. Met een glansrol voor Manchester United-aanvaller Amad Diallo en een negatieve hoofdrol voor PSV-speler Adam Nagalo werd het een eenzijdige wedstrijd in Marrakech.",
      "publishedAt": "2026-01-06T21:02:02.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Wintertransfers Eredivisie seizoen 2025/26: alle clubs op een rij",
      "link": "https://www.vi.nl/nieuws/wintertransfers-eredivisie-seizoen-2025-26-alle-clubs-op-een-rij",
      "summary": "De transferperiode is weer losgebarsten. In dit overzicht van VI vind je alle afgeronde, door clubs bevestigde, wintertransfers van de achttien Eredivisie-clubs. Clubs in Nederland kunnen tot en met 3 februari spelers aantrekken.",
      "publishedAt": "2026-01-06T21:00:40.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Who will be Man United's next manager? 12 top candidates to replace Amorim",
      "link": "https://www.espn.com/soccer/story/_/id/47516208/man-united-next-manager-12-candidates-replace-amorim",
      "summary": "Whether Manchester United aim to hire quickly or wait until summer, here are the coaches they could be after.",
      "publishedAt": "2026-01-06T20:49:35.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Fans Strasbourg voelen zich beetgenomen door Chelsea: 'Vernederend'",
      "link": "https://www.vi.nl/nieuws/fans-strasbourg-voelen-zich-beetgenomen-door-chelsea-vernederend",
      "summary": "De aanstelling van Liam Rosenior als nieuwe manager van Chelsea heeft voor woede gezorgd bij de supporters van RC Strasbourg. De Franse club is, net als Chelsea, eigendom van investeringsmaatschappij BlueCo en ziet opnieuw een belangrijk persoon vertrekken richting Londen.",
      "publishedAt": "2026-01-06T20:45:00.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Dream start for West Ham as Murillo scores own goal!",
      "link": "https://www.skysports.com/watch/video/13491290/dream-start-for-west-ham-as-murillo-scores-own-goal",
      "summary": "West Ham take an early lead courtesy of a Murillo own goal.",
      "publishedAt": "2026-01-06T20:19:00.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Fletcher voegt Evans toe aan Man Utd-staf en brengt goed nieuws over Fernandes",
      "link": "https://www.vi.nl/nieuws/fletcher-voegt-evans-toe-aan-man-utd-staf-en-brengt-goed-nieuws-over-fernandes",
      "summary": "Jonny Evans is toegevoegd aan de technische staf van Manchester United. De voormalig speler sluit daarmee aan bij zijn oud-ploeggenoot Darren Fletcher, die momenteel als tussenpaus fungeert na het ontslag van Rúben Amorim. Fletcher bracht daarbij direct goed nieuws over smaakmakers Mason Mount en Bruno Fernandes.",
      "publishedAt": "2026-01-06T20:17:55.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "'A moving moment' as Rosenior breaks barriers",
      "link": "https://www.bbc.com/sport/football/articles/c78e5nn9g8jo?at_medium=RSS&at_campaign=rss",
      "summary": "Liam Rosenior's appointment as Chelsea manager is a \"massive moment\" for representation in the Premier League.",
      "publishedAt": "2026-01-06T20:05:51.000Z"
    },
    {
      "type": "rss",
      "source": "ESPN - Soccer",
      "sourceSlug": "espn-soccer",
      "country": "INT",
      "flag": "🌍",
      "title": "Why Man United sacked Amorim: Tactics, player issues, transfer frustration",
      "link": "https://www.espn.com/soccer/story/_/id/47514917/manchester-united-story-firing-ruben-amorim-analysis-rob-dawson",
      "summary": "Ruben Amorim was seen as a risky choice to lead Man United's rebuild. Here's how things broke down.",
      "publishedAt": "2026-01-06T19:57:36.000Z"
    },
    {
      "type": "rss",
      "source": "Voetbal International",
      "sourceSlug": "voetbal-international",
      "country": "NL",
      "flag": "🇳🇱",
      "title": "Ten Hag sluit terugkeer als trainer niet uit: 'Lat ligt wel heel hoog'",
      "link": "https://www.vi.nl/nieuws/td-ten-hag-sluit-terugkeer-als-trainer-niet-uit-lat-ligt-wel-heel-hoog",
      "summary": "FC Twente maakte dinsdag bekend dat Erik ten Hag de nieuwe technisch directeur is . De Tukker gaf een uitgebreid interview aan het clubkanaal, waarin hij onder meer aangaf een terugkeer als trainer niet uit te sluiten. Al ligt de focus de komende tweeënhalf jaar volledig op zijn nieuwe functie.",
      "publishedAt": "2026-01-06T19:51:05.000Z"
    },
    {
      "type": "rss",
      "source": "Sky Sports - Football",
      "sourceSlug": "sky-sports-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Littler leads charge for first 2026 major at World Masters",
      "link": "https://www.skysports.com/darts/news/12040/13491274/winmau-world-masters-2026-luke-littler-chasing-maiden-title-in-milton-keynes",
      "summary": "Luke Littler goes in search of a maiden title when the 2026 PDC season kicks off with the World Masters in Milton Keynes.",
      "publishedAt": "2026-01-06T19:08:00.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Algeria 1-0 DR Congo: Africa Cup of Nations last 16 – as it happened",
      "link": "https://www.theguardian.com/football/live/2026/jan/06/algeria-v-dr-congo-africa-cup-of-nations-last-16-live",
      "summary": "Adil Boulbina’s sensational strike deep in extra time gave Algeria a 1-0 win in the Africa Cup of Nations last-16 ties against DR Congo 10 min: Algeria win their first corner … Bensebaini takes but it barely clears the first man. Amoura is now down and the replay shows his football boot came clean off during that corner. No foul, which is the right decision I think, and play continues with a DR Congo free-kick. 9 min: Chancel Mbemba is down receiving treatment. Would be a huge miss for DR Congo for their captain to be injured early but he seems to be OK. Continue reading...",
      "publishedAt": "2026-01-06T18:50:30.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Semenyo to Man City deal done pending medical",
      "link": "https://www.bbc.com/sport/football/articles/c8j389dd211o?at_medium=RSS&at_campaign=rss",
      "summary": "Bournemouth winger Antoine Semenyo is set to have a medical after his side's game against Tottenham on Wednesday before he makes a move to Manchester City.",
      "publishedAt": "2026-01-06T18:22:02.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Ruben Amorim’s error? Taking on Jason Wilcox and execs who are never wrong | Jonathan Liew",
      "link": "https://www.theguardian.com/football/2026/jan/06/ruben-amorim-manchester-united-jason-wilcox",
      "summary": "Jaw-dropping LinkedIn profiles matter more to clubs like Manchester United than coaches with ideas and energy Turns out he could survive losing against Grimsby. Survive losing a crucial European final against one of the worst Tottenham teams in living memory. He could survive losing at home against West Ham and Wolves, finishing 15th, the tactical inflexibility, laying waste to some of the club’s best homegrown talent, the 32% win rate, calling his team the worst in Manchester United history. But there was one adversary with whom Ruben Amorim would not be allowed to dance. You come at Jason Wilcox, and you best not miss. Unfortunately, like many a Premiership right-back in Blackburn’s title-winning 1994‑95 season, Amorim came at Jason Wilcox and appears to have missed. Even the most distracted of readers will notice the irony here: a coach who often railed at his players for losing one-on-one duels crumbling in the face of the white heat and animal charisma of one of the Premier League’s most feared sporting directors. Continue reading...",
      "publishedAt": "2026-01-06T17:53:42.000Z"
    },
    {
      "type": "rss",
      "source": "BBC Sport - Football",
      "sourceSlug": "bbc-sport-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Man Utd hold talks with trio over caretaker role",
      "link": "https://www.bbc.com/sport/football/articles/c931qgk3xgqo?at_medium=RSS&at_campaign=rss",
      "summary": "Manchester United hold talks with former players Darren Fletcher, Michael Carrick and Ole Gunnar Solskjaer about becoming the club's caretaker manager.",
      "publishedAt": "2026-01-06T17:12:54.000Z"
    },
    {
      "type": "rss",
      "source": "The Guardian Football",
      "sourceSlug": "the-guardian-football",
      "country": "INT",
      "flag": "🌍",
      "title": "Rosenior needs bright start at Chelsea to avoid being a focus for fan discontent | Jacob Steinberg",
      "link": "https://www.theguardian.com/football/2026/jan/06/liam-rosenior-new-chelsea-head-coach-fan-discontent-ownership",
      "summary": "The club are in a decent position but there is dissatisfaction with the ownership and the new head coach must not get caught in the crossfire The way Chelsea are run will come as no surprise to Liam Rosenior. He has longstanding relationships with three of the five sporting directors and will know from his time at Strasbourg, who are part of the same ownership, that the head coach’s best chance of surviving is not to make the mistake of rebelling against the structure. Rosenior will have to show more political savvy than Enzo Maresca, who talked himself out of the job last week. Yet given the 41‑year‑old is familiar with the working conditions at BlueCo, the investment vehicle that owns Chelsea and Strasbourg, his biggest challenge is unlikely to be managing upwards. Rosenior will know where to train his focus and not to rock the boat. Crucially, he does not inherit a team in crisis. Chelsea are fifth and earned a creditable draw at Manchester City on Sunday; despite the rancour of Maresca’s final days, this is not a situation that calls for a major rebuild. Continue reading...",
      "publishedAt": "2026-01-06T13:00:14.000Z"
    }
  ]
}